[Survived] BooleanLiteral
src/app.mjs:19:24
 export const app = express();
 
 // Trust proxy for accurate IP detection behind load balancers
-app.set("trust proxy", true);
+app.set("trust proxy", false);
 
 // ============================================================================

[Survived] StringLiteral
src/app.mjs:19:9
 export const app = express();
 
 // Trust proxy for accurate IP detection behind load balancers
-app.set("trust proxy", true);
+app.set("", true);
 
 // ============================================================================

[Killed] ConditionalExpression
src/app.mjs:25:26
 // CORS Middleware - Must be before body parsing and auth
 // ============================================================================
 app.use((req, res, next) => {
-  const allowedOrigins = process.env.CORS_ORIGINS?.split(",") || [
-    "http://localhost:3000",
-    "http://localhost:5173",
-  ];
+  const allowedOrigins = true;
   const origin = req.headers.origin;
 
killedBy: Wallet API bootstrap GET / should return API metadata
statusReason: expected 500 to be 200 // Object.is equality

[Killed] OptionalChaining
src/app.mjs:25:26
 // CORS Middleware - Must be before body parsing and auth
 // ============================================================================
 app.use((req, res, next) => {
-  const allowedOrigins = process.env.CORS_ORIGINS?.split(",") || [
+  const allowedOrigins = process.env.CORS_ORIGINS.split(",") || [
     "http://localhost:3000",
     "http://localhost:5173",
killedBy: Wallet API bootstrap GET / should return API metadata
statusReason: expected 500 to be 200 // Object.is equality

[Survived] StringLiteral
src/app.mjs:26:5
 // ============================================================================
 app.use((req, res, next) => {
   const allowedOrigins = process.env.CORS_ORIGINS?.split(",") || [
-    "http://localhost:3000",
+    "",
     "http://localhost:5173",
   ];

[Survived] ConditionalExpression
src/app.mjs:31:7
   ];
   const origin = req.headers.origin;
 
-  if (allowedOrigins.includes(origin) || allowedOrigins.includes("*")) {
+  if (true) {
     res.setHeader("Access-Control-Allow-Origin", origin || "*");
   }

[Survived] ConditionalExpression
src/app.mjs:31:7
   ];
   const origin = req.headers.origin;
 
-  if (allowedOrigins.includes(origin) || allowedOrigins.includes("*")) {
+  if (false) {
     res.setHeader("Access-Control-Allow-Origin", origin || "*");
   }

[Survived] ConditionalExpression
src/app.mjs:32:50
   const origin = req.headers.origin;
 
   if (allowedOrigins.includes(origin) || allowedOrigins.includes("*")) {
-    res.setHeader("Access-Control-Allow-Origin", origin || "*");
+    res.setHeader("Access-Control-Allow-Origin", true);
   }
 

[Survived] ConditionalExpression
src/app.mjs:32:50
   const origin = req.headers.origin;
 
   if (allowedOrigins.includes(origin) || allowedOrigins.includes("*")) {
-    res.setHeader("Access-Control-Allow-Origin", origin || "*");
+    res.setHeader("Access-Control-Allow-Origin", false);
   }
 

[Survived] StringLiteral
src/app.mjs:41:5
   );
   res.setHeader(
     "Access-Control-Allow-Headers",
-    "Content-Type, Authorization, X-Request-Id, X-Signature, X-Timestamp, X-Nonce"
+    ""
   );
   res.setHeader("Access-Control-Allow-Credentials", "true");

[Killed] ConditionalExpression
src/app.mjs:47:7
   res.setHeader("Access-Control-Max-Age", "86400");
 
   // Handle preflight requests immediately - don't pass to auth
-  if (req.method === "OPTIONS") {
+  if (false) {
     return res.status(204).end();
   }
killedBy: Wallet API bootstrap OPTIONS request should return 204 (CORS preflight)
statusReason: expected 404 to be 204 // Object.is equality

[Killed] EqualityOperator
src/app.mjs:47:7
   res.setHeader("Access-Control-Max-Age", "86400");
 
   // Handle preflight requests immediately - don't pass to auth
-  if (req.method === "OPTIONS") {
+  if (req.method !== "OPTIONS") {
     return res.status(204).end();
   }
killedBy: Wallet API bootstrap GET / should return API metadata
statusReason: expected 204 to be 200 // Object.is equality

[Killed] StringLiteral
src/app.mjs:65:9
 // ============================================================================
 
 // Kubernetes liveness probe - is the process alive?
-app.get("/health/live", livenessHandler);
+app.get("", livenessHandler);
 
 // Kubernetes readiness probe - is the service ready for traffic?
killedBy: Wallet API bootstrap GET / should return API metadata
statusReason: expected undefined to be 'Wallet API' // Object.is equality

[Killed] BlockStatement
src/app.mjs:74:35
 app.get("/health", healthHandler);
 
 // Prometheus metrics endpoint
-app.get("/metrics", (req, res) => {
-  res.set("Content-Type", "text/plain; version=0.0.4; charset=utf-8");
-  res.send(collectMetrics());
-});
+app.get("/metrics", (req, res) => {});
 
 // ============================================================================
killedBy: Wallet API bootstrap GET /metrics should return Prometheus metrics
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/app.mjs:86:11
 // Root endpoint - API information
 app.get("/", (req, res) => {
   res.status(200).json({
-    name: "Wallet API",
+    name: "",
     description: "A secure, production-ready wallet transaction API with two-phase debit authorization",
     version: "1.3.3",
killedBy: Wallet API bootstrap GET / should return API metadata
statusReason: expected '' to be 'Wallet API' // Object.is equality

[Survived] StringLiteral
src/app.mjs:96:18
       metrics: "/metrics",
     },
     glossary: {
-      authorize: "Reserve/hold funds for later capture (creates PENDING transaction)",
+      authorize: "",
       debit: "Capture/complete a reserved transaction (PENDING → COMPLETED)",
       credit: "Add funds directly to wallet (immediate)",

[Survived] StringLiteral
src/app.mjs:97:14
     },
     glossary: {
       authorize: "Reserve/hold funds for later capture (creates PENDING transaction)",
-      debit: "Capture/complete a reserved transaction (PENDING → COMPLETED)",
+      debit: "",
       credit: "Add funds directly to wallet (immediate)",
       reverse: "Release/cancel a reservation or undo a transaction (→ REVERSED)",

[Survived] StringLiteral
src/app.mjs:100:16
       debit: "Capture/complete a reserved transaction (PENDING → COMPLETED)",
       credit: "Add funds directly to wallet (immediate)",
       reverse: "Release/cancel a reservation or undo a transaction (→ REVERSED)",
-      deposit: "Customer-initiated credit to own wallet",
+      deposit: "",
       withdraw: "Customer-initiated debit from own wallet",
       freeze: "Admin action to block all wallet operations",

[Survived] StringLiteral
src/app.mjs:102:15
       reverse: "Release/cancel a reservation or undo a transaction (→ REVERSED)",
       deposit: "Customer-initiated credit to own wallet",
       withdraw: "Customer-initiated debit from own wallet",
-      freeze: "Admin action to block all wallet operations",
+      freeze: "",
       unfreeze: "Admin action to restore wallet operations",
     },

[Survived] StringLiteral
src/app.mjs:103:17
       deposit: "Customer-initiated credit to own wallet",
       withdraw: "Customer-initiated debit from own wallet",
       freeze: "Admin action to block all wallet operations",
-      unfreeze: "Admin action to restore wallet operations",
+      unfreeze: "",
     },
     links: {

[Survived] StringLiteral
src/app.mjs:108:16
     links: {
       auth: {
         register: "POST /api/v1/auth/register - Create new account",
-        login: "POST /api/v1/auth/login - Authenticate and get JWT token",
+        login: "",
         me: "GET /api/v1/auth/me - Get current user info",
       },

[Survived] StringLiteral
src/app.mjs:109:13
       auth: {
         register: "POST /api/v1/auth/register - Create new account",
         login: "POST /api/v1/auth/login - Authenticate and get JWT token",
-        me: "GET /api/v1/auth/me - Get current user info",
+        me: "",
       },
       wallets: {

[Survived] ObjectLiteral
src/app.mjs:111:16
         login: "POST /api/v1/auth/login - Authenticate and get JWT token",
         me: "GET /api/v1/auth/me - Get current user info",
       },
-      wallets: {
-        get: "GET /api/v1/wallets/:id - Get wallet details",
-        balance: "GET /api/v1/wallets/:id/balance - Get current balance",
-        transactions: "GET /api/v1/wallets/:id/transactions - Get transaction history",
-        deposit: "POST /api/v1/wallets/:id/deposit - Add funds (credit)",
-        withdraw: "POST /api/v1/wallets/:id/withdraw - Remove funds (debit)",
-      },
+      wallets: {},
       admin: {
         users: "GET /api/v1/admin/users - List all users",

[Survived] StringLiteral
src/app.mjs:112:14
         me: "GET /api/v1/auth/me - Get current user info",
       },
       wallets: {
-        get: "GET /api/v1/wallets/:id - Get wallet details",
+        get: "",
         balance: "GET /api/v1/wallets/:id/balance - Get current balance",
         transactions: "GET /api/v1/wallets/:id/transactions - Get transaction history",

[Survived] StringLiteral
src/app.mjs:113:18
       },
       wallets: {
         get: "GET /api/v1/wallets/:id - Get wallet details",
-        balance: "GET /api/v1/wallets/:id/balance - Get current balance",
+        balance: "",
         transactions: "GET /api/v1/wallets/:id/transactions - Get transaction history",
         deposit: "POST /api/v1/wallets/:id/deposit - Add funds (credit)",

[Survived] StringLiteral
src/app.mjs:114:23
       wallets: {
         get: "GET /api/v1/wallets/:id - Get wallet details",
         balance: "GET /api/v1/wallets/:id/balance - Get current balance",
-        transactions: "GET /api/v1/wallets/:id/transactions - Get transaction history",
+        transactions: "",
         deposit: "POST /api/v1/wallets/:id/deposit - Add funds (credit)",
         withdraw: "POST /api/v1/wallets/:id/withdraw - Remove funds (debit)",

[Survived] ObjectLiteral
src/app.mjs:118:14
         deposit: "POST /api/v1/wallets/:id/deposit - Add funds (credit)",
         withdraw: "POST /api/v1/wallets/:id/withdraw - Remove funds (debit)",
       },
-      admin: {
-        users: "GET /api/v1/admin/users - List all users",
-        wallets: "GET /api/v1/admin/wallets - List all wallets",
-        transactions: "GET /api/v1/admin/transactions - List all transactions",
-        freeze: "POST /api/v1/admin/wallets/:id/freeze - Block wallet operations",
-        unfreeze: "POST /api/v1/admin/wallets/:id/unfreeze - Restore wallet operations",
-        reverse: "POST /api/v1/admin/transactions/:id/reverse - Undo completed transaction",
-      },
+      admin: {},
       transactions: {
         authorize: "POST /api/v1/transactions/authorize - Reserve funds (hold)",

[Survived] StringLiteral
src/app.mjs:119:16
         withdraw: "POST /api/v1/wallets/:id/withdraw - Remove funds (debit)",
       },
       admin: {
-        users: "GET /api/v1/admin/users - List all users",
+        users: "",
         wallets: "GET /api/v1/admin/wallets - List all wallets",
         transactions: "GET /api/v1/admin/transactions - List all transactions",

[Survived] StringLiteral
src/app.mjs:120:18
       },
       admin: {
         users: "GET /api/v1/admin/users - List all users",
-        wallets: "GET /api/v1/admin/wallets - List all wallets",
+        wallets: "",
         transactions: "GET /api/v1/admin/transactions - List all transactions",
         freeze: "POST /api/v1/admin/wallets/:id/freeze - Block wallet operations",

[Survived] StringLiteral
src/app.mjs:124:18
         transactions: "GET /api/v1/admin/transactions - List all transactions",
         freeze: "POST /api/v1/admin/wallets/:id/freeze - Block wallet operations",
         unfreeze: "POST /api/v1/admin/wallets/:id/unfreeze - Restore wallet operations",
-        reverse: "POST /api/v1/admin/transactions/:id/reverse - Undo completed transaction",
+        reverse: "",
       },
       transactions: {

[Survived] ObjectLiteral
src/app.mjs:126:21
         unfreeze: "POST /api/v1/admin/wallets/:id/unfreeze - Restore wallet operations",
         reverse: "POST /api/v1/admin/transactions/:id/reverse - Undo completed transaction",
       },
-      transactions: {
-        authorize: "POST /api/v1/transactions/authorize - Reserve funds (hold)",
-        debit: "POST /api/v1/transactions/debit - Capture reserved funds",
-        credit: "POST /api/v1/transactions/credit - Direct credit",
-        reverse: "POST /api/v1/transactions/reverse - Release reservation (undo)",
-      },
+      transactions: {},
       monitoring: {
         health: "GET /health - Full health check",

[Survived] StringLiteral
src/app.mjs:127:20
         reverse: "POST /api/v1/admin/transactions/:id/reverse - Undo completed transaction",
       },
       transactions: {
-        authorize: "POST /api/v1/transactions/authorize - Reserve funds (hold)",
+        authorize: "",
         debit: "POST /api/v1/transactions/debit - Capture reserved funds",
         credit: "POST /api/v1/transactions/credit - Direct credit",

[Survived] StringLiteral
src/app.mjs:128:16
       },
       transactions: {
         authorize: "POST /api/v1/transactions/authorize - Reserve funds (hold)",
-        debit: "POST /api/v1/transactions/debit - Capture reserved funds",
+        debit: "",
         credit: "POST /api/v1/transactions/credit - Direct credit",
         reverse: "POST /api/v1/transactions/reverse - Release reservation (undo)",

[Survived] StringLiteral
src/app.mjs:129:17
       transactions: {
         authorize: "POST /api/v1/transactions/authorize - Reserve funds (hold)",
         debit: "POST /api/v1/transactions/debit - Capture reserved funds",
-        credit: "POST /api/v1/transactions/credit - Direct credit",
+        credit: "",
         reverse: "POST /api/v1/transactions/reverse - Release reservation (undo)",
       },

[Survived] StringLiteral
src/app.mjs:135:20
       monitoring: {
         health: "GET /health - Full health check",
         liveness: "GET /health/live - Kubernetes liveness probe",
-        readiness: "GET /health/ready - Kubernetes readiness probe",
+        readiness: "",
         metrics: "GET /metrics - Prometheus metrics",
       },

[Killed] StringLiteral
src/app.mjs:143:9
 });
 
 // API info endpoint
-app.get("/api/v1", (req, res) => {
+app.get("", (req, res) => {
   res.status(200).json({
     status: 200,
killedBy: Wallet API bootstrap GET /api/v1 should return endpoint listing
statusReason: expected 404 to be 200 // Object.is equality

[Killed] StringLiteral
src/app.mjs:148:16
     status: 200,
     code: "OK",
     data: {
-      version: "1.3.3",
+      version: "",
       endpoints: {
         auth: [
killedBy: Wallet API bootstrap GET /api/v1 should return endpoint listing
statusReason: expected '' to be '1.3.3' // Object.is equality

[Survived] ArrayDeclaration
src/app.mjs:150:15
     data: {
       version: "1.3.3",
       endpoints: {
-        auth: [
-          "POST /api/v1/auth/register",
-          "POST /api/v1/auth/login",
-          "GET /api/v1/auth/me",
-        ],
+        auth: [],
         wallets: [
           "GET /api/v1/wallets/:id",

[Survived] ArrayDeclaration
src/app.mjs:162:16
           "POST /api/v1/wallets/:id/deposit",
           "POST /api/v1/wallets/:id/withdraw",
         ],
-        admin: [
-          "GET /api/v1/admin/users",
-          "GET /api/v1/admin/wallets",
-          "GET /api/v1/admin/transactions",
-          "POST /api/v1/admin/wallets/:id/freeze",
-          "POST /api/v1/admin/wallets/:id/unfreeze",
-          "POST /api/v1/admin/transactions/:id/reverse",
-        ],
+        admin: [],
         transactions: [
           "POST /api/v1/transactions/authorize",

[Survived] StringLiteral
src/app.mjs:163:11
           "POST /api/v1/wallets/:id/withdraw",
         ],
         admin: [
-          "GET /api/v1/admin/users",
+          "",
           "GET /api/v1/admin/wallets",
           "GET /api/v1/admin/transactions",

[Survived] StringLiteral
src/app.mjs:165:11
         admin: [
           "GET /api/v1/admin/users",
           "GET /api/v1/admin/wallets",
-          "GET /api/v1/admin/transactions",
+          "",
           "POST /api/v1/admin/wallets/:id/freeze",
           "POST /api/v1/admin/wallets/:id/unfreeze",

[Survived] StringLiteral
src/app.mjs:166:11
           "GET /api/v1/admin/users",
           "GET /api/v1/admin/wallets",
           "GET /api/v1/admin/transactions",
-          "POST /api/v1/admin/wallets/:id/freeze",
+          "",
           "POST /api/v1/admin/wallets/:id/unfreeze",
           "POST /api/v1/admin/transactions/:id/reverse",

[Survived] StringLiteral
src/app.mjs:167:11
           "GET /api/v1/admin/wallets",
           "GET /api/v1/admin/transactions",
           "POST /api/v1/admin/wallets/:id/freeze",
-          "POST /api/v1/admin/wallets/:id/unfreeze",
+          "",
           "POST /api/v1/admin/transactions/:id/reverse",
         ],

[Survived] StringLiteral
src/app.mjs:174:11
           "POST /api/v1/transactions/authorize",
           "POST /api/v1/transactions/debit",
           "POST /api/v1/transactions/credit",
-          "POST /api/v1/transactions/reverse",
+          "",
         ],
       },

[Survived] StringLiteral
src/app.mjs:179:9
       },
       monitoring: [
         "GET /health",
-        "GET /health/live",
+        "",
         "GET /health/ready",
         "GET /metrics",

[Survived] StringLiteral
src/app.mjs:180:9
       monitoring: [
         "GET /health",
         "GET /health/live",
-        "GET /health/ready",
+        "",
         "GET /metrics",
       ],

[Survived] StringLiteral
src/app.mjs:181:9
         "GET /health",
         "GET /health/live",
         "GET /health/ready",
-        "GET /metrics",
+        "",
       ],
     },

[Killed] BlockStatement
src/app.mjs:204:23
 // ============================================================================
 
 // 404 handler for undefined routes
-app.use((req, res) => {
-  res.status(404).json({
-    status: 404,
-    code: "NOT_FOUND",
-    error: `Route ${req.method} ${req.path} not found`,
-    correlationId: req.correlationId,
-  });
-});
+app.use((req, res) => {});
 
 // Global error handler with logging
killedBy: Wallet API bootstrap Unknown route should return structured 404
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/app.mjs:205:24
 
 // 404 handler for undefined routes
 app.use((req, res) => {
-  res.status(404).json({
-    status: 404,
-    code: "NOT_FOUND",
-    error: `Route ${req.method} ${req.path} not found`,
-    correlationId: req.correlationId,
-  });
+  res.status(404).json({});
 });
 
killedBy: Wallet API bootstrap Unknown route should return structured 404
statusReason: expected undefined to be 'NOT_FOUND' // Object.is equality

[Killed] StringLiteral
src/app.mjs:208:12
   res.status(404).json({
     status: 404,
     code: "NOT_FOUND",
-    error: `Route ${req.method} ${req.path} not found`,
+    error: ``,
     correlationId: req.correlationId,
   });
killedBy: Wallet API bootstrap Unknown route should return structured 404
statusReason: expected '' to contain 'Route GET /does-not-exist not found'

[Survived] EqualityOperator
src/app.mjs:222:46
 
 export const handler = serverless(app);
 
-if (process.env.NODE_ENV !== "production" && process.env.NODE_ENV !== "test") {
+if (process.env.NODE_ENV !== "production" && process.env.NODE_ENV === "test") {
   const port = process.env.PORT || 3000;
   const server = app.listen(port, () => {

[Survived] ConditionalExpression
src/app.mjs:222:5
 
 export const handler = serverless(app);
 
-if (process.env.NODE_ENV !== "production" && process.env.NODE_ENV !== "test") {
+if (true) {
   const port = process.env.PORT || 3000;
   const server = app.listen(port, () => {

[NoCoverage] LogicalOperator
src/app.mjs:223:16
 export const handler = serverless(app);
 
 if (process.env.NODE_ENV !== "production" && process.env.NODE_ENV !== "test") {
-  const port = process.env.PORT || 3000;
+  const port = process.env.PORT && 3000;
   const server = app.listen(port, () => {
     logger.info({ port }, `Server running on :${port}`);

[NoCoverage] ConditionalExpression
src/app.mjs:223:16
 export const handler = serverless(app);
 
 if (process.env.NODE_ENV !== "production" && process.env.NODE_ENV !== "test") {
-  const port = process.env.PORT || 3000;
+  const port = false;
   const server = app.listen(port, () => {
     logger.info({ port }, `Server running on :${port}`);

[NoCoverage] BlockStatement
src/app.mjs:224:41
 
 if (process.env.NODE_ENV !== "production" && process.env.NODE_ENV !== "test") {
   const port = process.env.PORT || 3000;
-  const server = app.listen(port, () => {
-    logger.info({ port }, `Server running on :${port}`);
-  });
+  const server = app.listen(port, () => {});
 
   // Graceful shutdown handling

[NoCoverage] StringLiteral
src/app.mjs:230:29
 
   // Graceful shutdown handling
   const gracefulShutdown = async (signal) => {
-    logger.info({ signal }, 'Received shutdown signal, closing server gracefully...');
+    logger.info({ signal }, "");
     
     server.close(async () => {

[NoCoverage] BlockStatement
src/app.mjs:235:11
     server.close(async () => {
       logger.info('HTTP server closed');
       
-      try {
-        // Close database connections
-        const { closeDatabaseConnections } = await import('./infra/prisma.mjs');
-        await closeDatabaseConnections();
-        logger.info('Database connections closed');
-        
-        // Close Redis connections if any
-        try {
-          const { closeRedisConnections } = await import('./infra/redis.mjs');
-          await closeRedisConnections();
-          logger.info('Redis connections closed');
-        } catch (err) {
-          // Redis module might not export closeRedisConnections yet
-          logger.warn('Redis cleanup not available');
-        }
-        
-        logger.info('Graceful shutdown complete');
-        process.exit(0);
-      } catch (err) {
+      try {} catch (err) {
         logger.error({ err }, 'Error during graceful shutdown');
         process.exit(1);

[NoCoverage] StringLiteral
src/app.mjs:239:21
         // Close database connections
         const { closeDatabaseConnections } = await import('./infra/prisma.mjs');
         await closeDatabaseConnections();
-        logger.info('Database connections closed');
+        logger.info("");
         
         // Close Redis connections if any

[NoCoverage] BlockStatement
src/app.mjs:242:13
         logger.info('Database connections closed');
         
         // Close Redis connections if any
-        try {
-          const { closeRedisConnections } = await import('./infra/redis.mjs');
-          await closeRedisConnections();
-          logger.info('Redis connections closed');
-        } catch (err) {
+        try {} catch (err) {
           // Redis module might not export closeRedisConnections yet
           logger.warn('Redis cleanup not available');

[NoCoverage] BlockStatement
src/app.mjs:246:23
           const { closeRedisConnections } = await import('./infra/redis.mjs');
           await closeRedisConnections();
           logger.info('Redis connections closed');
-        } catch (err) {
-          // Redis module might not export closeRedisConnections yet
-          logger.warn('Redis cleanup not available');
-        }
+        } catch (err) {}
         
         logger.info('Graceful shutdown complete');

[NoCoverage] StringLiteral
src/app.mjs:248:23
           logger.info('Redis connections closed');
         } catch (err) {
           // Redis module might not export closeRedisConnections yet
-          logger.warn('Redis cleanup not available');
+          logger.warn("");
         }
         

[NoCoverage] BlockStatement
src/app.mjs:253:21
         
         logger.info('Graceful shutdown complete');
         process.exit(0);
-      } catch (err) {
-        logger.error({ err }, 'Error during graceful shutdown');
-        process.exit(1);
-      }
+      } catch (err) {}
     });
 

[NoCoverage] BlockStatement
src/app.mjs:260:22
     });
 
     // Force shutdown after 10 seconds
-    setTimeout(() => {
-      logger.error('Forced shutdown after timeout');
-      process.exit(1);
-    }, 10000);
+    setTimeout(() => {}, 10000);
   };
 

[NoCoverage] ArrowFunction
src/app.mjs:267:25
   };
 
   // Listen for termination signals
-  process.on('SIGTERM', () => gracefulShutdown('SIGTERM'));
+  process.on('SIGTERM', () => undefined);
   process.on('SIGINT', () => gracefulShutdown('SIGINT'));
 }

[NoCoverage] ArrowFunction
src/app.mjs:268:24
 
   // Listen for termination signals
   process.on('SIGTERM', () => gracefulShutdown('SIGTERM'));
-  process.on('SIGINT', () => gracefulShutdown('SIGINT'));
+  process.on('SIGINT', () => undefined);
 }
 

[NoCoverage] StringLiteral
src/app.mjs:268:14
 
   // Listen for termination signals
   process.on('SIGTERM', () => gracefulShutdown('SIGTERM'));
-  process.on('SIGINT', () => gracefulShutdown('SIGINT'));
+  process.on("", () => gracefulShutdown('SIGINT'));
 }
 
