[NoCoverage] BooleanLiteral
src/handlers/credit.mjs:8:20
 export default async function credit(req, res) {
   const { walletId, amount, referenceId } = req.body;
 
-  if (!walletId || !amount || !referenceId) {
+  if (!walletId || amount || !referenceId) {
     return res.status(400).json({
       status: 400,

[NoCoverage] BooleanLiteral
src/handlers/credit.mjs:8:31
 export default async function credit(req, res) {
   const { walletId, amount, referenceId } = req.body;
 
-  if (!walletId || !amount || !referenceId) {
+  if (!walletId || !amount || referenceId) {
     return res.status(400).json({
       status: 400,

[NoCoverage] ObjectLiteral
src/handlers/credit.mjs:9:33
   const { walletId, amount, referenceId } = req.body;
 
   if (!walletId || !amount || !referenceId) {
-    return res.status(400).json({
-      status: 400,
-      code: "BAD_REQUEST",
-      error: "Missing required fields: walletId, amount, referenceId",
-    });
+    return res.status(400).json({});
   }
 

[NoCoverage] ObjectLiteral
src/handlers/credit.mjs:18:48
 
   try {
     const result = await prisma.$transaction(async (tx) => {
-      const wallet = await tx.wallet.findFirst({
-        where: { id: walletId, accountId: req.user.account.id },
-      });
+      const wallet = await tx.wallet.findFirst({});
 
       if (!wallet) {

[NoCoverage] ConditionalExpression
src/handlers/credit.mjs:22:11
         where: { id: walletId, accountId: req.user.account.id },
       });
 
-      if (!wallet) {
+      if (true) {
         const err = new Error("Wallet not found");
         err.statusCode = 404;

[NoCoverage] BooleanLiteral
src/handlers/credit.mjs:22:11
         where: { id: walletId, accountId: req.user.account.id },
       });
 
-      if (!wallet) {
+      if (wallet) {
         const err = new Error("Wallet not found");
         err.statusCode = 404;

[NoCoverage] StringLiteral
src/handlers/credit.mjs:23:31
       });
 
       if (!wallet) {
-        const err = new Error("Wallet not found");
+        const err = new Error("");
         err.statusCode = 404;
         err.code = "NOT_FOUND";

[NoCoverage] LogicalOperator
src/handlers/credit.mjs:29:24
         throw err;
       }
 
-      const currency = wallet.currency || "USD";
+      const currency = wallet.currency && "USD";
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);

[NoCoverage] ConditionalExpression
src/handlers/credit.mjs:29:24
         throw err;
       }
 
-      const currency = wallet.currency || "USD";
+      const currency = false;
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);

[NoCoverage] ObjectLiteral
src/handlers/credit.mjs:36:16
       const newBalance = Number(newBalanceM.minor);
 
       const updatedWallet = await tx.wallet.update({
-        where: { id: walletId },
+        where: {},
         data: { balance: newBalance },
       });

[NoCoverage] StringLiteral
src/handlers/credit.mjs:44:17
         data: {
           id: uuid(),
           walletId,
-          type: "credit",
+          type: "",
           amount,
           status: "completed",

[NoCoverage] ObjectLiteral
src/handlers/credit.mjs:52:15
       });
 
       await tx.ledgerEntry.create({
-        data: {
-          id: uuid(),
-          transactionId: transaction.id,
-          direction: "credit",
-          amount,
-          balanceBefore: wallet.balance,
-          balanceAfter: updatedWallet.balance,
-        },
+        data: {},
       });
 

[NoCoverage] StringLiteral
src/handlers/credit.mjs:55:22
         data: {
           id: uuid(),
           transactionId: transaction.id,
-          direction: "credit",
+          direction: "",
           amount,
           balanceBefore: wallet.balance,

[NoCoverage] ObjectLiteral
src/handlers/credit.mjs:62:14
         },
       });
 
-      return { transaction, wallet: updatedWallet };
+      return {};
     });
 

[NoCoverage] ObjectLiteral
src/handlers/credit.mjs:65:26
       return { transaction, wallet: updatedWallet };
     });
 
-    res.status(200).json({
-      status: 200,
-      code: "OK",
-      data: result,
-    });
+    res.status(200).json({});
   } catch (err) {
     const statusCode = err.statusCode || 500;

[NoCoverage] BlockStatement
src/handlers/credit.mjs:70:17
       code: "OK",
       data: result,
     });
-  } catch (err) {
-    const statusCode = err.statusCode || 500;
-    const code = err.code || "INTERNAL_SERVER_ERROR";
-    res.status(statusCode).json({
-      status: statusCode,
-      code,
-      error: err.message,
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ConditionalExpression
src/handlers/credit.mjs:71:24
       data: result,
     });
   } catch (err) {
-    const statusCode = err.statusCode || 500;
+    const statusCode = true;
     const code = err.code || "INTERNAL_SERVER_ERROR";
     res.status(statusCode).json({

[NoCoverage] LogicalOperator
src/handlers/credit.mjs:71:24
       data: result,
     });
   } catch (err) {
-    const statusCode = err.statusCode || 500;
+    const statusCode = err.statusCode && 500;
     const code = err.code || "INTERNAL_SERVER_ERROR";
     res.status(statusCode).json({

[NoCoverage] ConditionalExpression
src/handlers/credit.mjs:72:18
     });
   } catch (err) {
     const statusCode = err.statusCode || 500;
-    const code = err.code || "INTERNAL_SERVER_ERROR";
+    const code = true;
     res.status(statusCode).json({
       status: statusCode,

[NoCoverage] LogicalOperator
src/handlers/credit.mjs:72:18
     });
   } catch (err) {
     const statusCode = err.statusCode || 500;
-    const code = err.code || "INTERNAL_SERVER_ERROR";
+    const code = err.code && "INTERNAL_SERVER_ERROR";
     res.status(statusCode).json({
       status: statusCode,
