[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:5:29
 import { prisma } from "../../infra/prisma.mjs";
 import logger from "../../infra/logger.mjs";
 
-const bodySchema = z.object({
-  reason: z.string().min(1).max(500).optional(),
-});
+const bodySchema = z.object({});
 
 /**

[NoCoverage] MethodExpression
src/handlers/admin/freezeWallet.mjs:6:11
 import logger from "../../infra/logger.mjs";
 
 const bodySchema = z.object({
-  reason: z.string().min(1).max(500).optional(),
+  reason: z.string().max(1).max(500).optional(),
 });
 

[NoCoverage] MethodExpression
src/handlers/admin/freezeWallet.mjs:6:11
 import logger from "../../infra/logger.mjs";
 
 const bodySchema = z.object({
-  reason: z.string().min(1).max(500).optional(),
+  reason: z.string().min(1).min(500).optional(),
 });
 

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:18:9
     const { id } = req.params;
 
     const validation = bodySchema.safeParse(req.body);
-    if (!validation.success) {
+    if (true) {
       return res.status(400).json({
         status: 400,

[NoCoverage] BooleanLiteral
src/handlers/admin/freezeWallet.mjs:18:9
     const { id } = req.params;
 
     const validation = bodySchema.safeParse(req.body);
-    if (!validation.success) {
+    if (validation.success) {
       return res.status(400).json({
         status: 400,

[NoCoverage] BooleanLiteral
src/handlers/admin/freezeWallet.mjs:36:42
         account: {
           include: {
             user: {
-              select: { id: true, email: true },
+              select: { id: true, email: false },
             },
           },

[NoCoverage] BooleanLiteral
src/handlers/admin/freezeWallet.mjs:36:29
         account: {
           include: {
             user: {
-              select: { id: true, email: true },
+              select: { id: false, email: true },
             },
           },

[NoCoverage] BlockStatement
src/handlers/admin/freezeWallet.mjs:43:18
       },
     });
 
-    if (!wallet) {
-      return res.status(404).json({
-        status: 404,
-        code: "WALLET_NOT_FOUND",
-        error: "Wallet not found",
-      });
-    }
+    if (!wallet) {}
 
     if (wallet.account.status === "FROZEN") {

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:51:9
       });
     }
 
-    if (wallet.account.status === "FROZEN") {
+    if (true) {
       return res.status(409).json({
         status: 409,

[NoCoverage] EqualityOperator
src/handlers/admin/freezeWallet.mjs:51:9
       });
     }
 
-    if (wallet.account.status === "FROZEN") {
+    if (wallet.account.status !== "FROZEN") {
       return res.status(409).json({
         status: 409,

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:52:35
     }
 
     if (wallet.account.status === "FROZEN") {
-      return res.status(409).json({
-        status: 409,
-        code: "ALREADY_FROZEN",
-        error: "Account is already frozen",
-      });
+      return res.status(409).json({});
     }
 

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:60:56
     }
 
     // Freeze the account
-    const updatedAccount = await prisma.account.update({
-      where: { id: wallet.accountId },
-      data: { status: "FROZEN" },
-    });
+    const updatedAccount = await prisma.account.update({});
 
     logger.info(

[NoCoverage] StringLiteral
src/handlers/admin/freezeWallet.mjs:77:16
 
     return res.status(200).json({
       status: 200,
-      message: "Account frozen successfully",
+      message: "",
       data: {
         account: {

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:78:13
     return res.status(200).json({
       status: 200,
       message: "Account frozen successfully",
-      data: {
-        account: {
-          id: updatedAccount.id,
-          status: updatedAccount.status,
-        },
-        user: {
-          id: wallet.account.user.id,
-          email: wallet.account.user.email,
-        },
-        frozenBy: req.user.id,
-        reason: reason || null,
-      },
+      data: {},
     });
   } catch (err) {

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:79:18
       status: 200,
       message: "Account frozen successfully",
       data: {
-        account: {
-          id: updatedAccount.id,
-          status: updatedAccount.status,
-        },
+        account: {},
         user: {
           id: wallet.account.user.id,

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:83:15
           id: updatedAccount.id,
           status: updatedAccount.status,
         },
-        user: {
-          id: wallet.account.user.id,
-          email: wallet.account.user.email,
-        },
+        user: {},
         frozenBy: req.user.id,
         reason: reason || null,

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:88:17
           email: wallet.account.user.email,
         },
         frozenBy: req.user.id,
-        reason: reason || null,
+        reason: true,
       },
     });

[NoCoverage] LogicalOperator
src/handlers/admin/freezeWallet.mjs:88:17
           email: wallet.account.user.email,
         },
         frozenBy: req.user.id,
-        reason: reason || null,
+        reason: reason && null,
       },
     });

[NoCoverage] BlockStatement
src/handlers/admin/freezeWallet.mjs:91:17
         reason: reason || null,
       },
     });
-  } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to freeze wallet");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to freeze wallet",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:93:33
     });
   } catch (err) {
     logger.error({ err, walletId: req.params.id }, "Failed to freeze wallet");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to freeze wallet",
-    });
+    return res.status(500).json({});
   }
 }

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:110:9
     const { id } = req.params;
 
     const validation = bodySchema.safeParse(req.body);
-    if (!validation.success) {
+    if (false) {
       return res.status(400).json({
         status: 400,

[NoCoverage] BlockStatement
src/handlers/admin/freezeWallet.mjs:110:30
     const { id } = req.params;
 
     const validation = bodySchema.safeParse(req.body);
-    if (!validation.success) {
-      return res.status(400).json({
-        status: 400,
-        code: "VALIDATION_ERROR",
-        error: "Invalid request body",
-        details: validation.error.issues,
-      });
-    }
+    if (!validation.success) {}
 
     const { reason } = validation.data;

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:123:14
 
     // Find wallet and its account
     const wallet = await prisma.wallet.findUnique({
-      where: { id },
+      where: {},
       include: {
         account: {

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:143:9
       });
     }
 
-    if (wallet.account.status === "ACTIVE") {
+    if (false) {
       return res.status(409).json({
         status: 409,

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:143:9
       });
     }
 
-    if (wallet.account.status === "ACTIVE") {
+    if (true) {
       return res.status(409).json({
         status: 409,

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:144:35
     }
 
     if (wallet.account.status === "ACTIVE") {
-      return res.status(409).json({
-        status: 409,
-        code: "ALREADY_ACTIVE",
-        error: "Account is already active",
-      });
+      return res.status(409).json({});
     }
 

[NoCoverage] StringLiteral
src/handlers/admin/freezeWallet.mjs:147:16
       return res.status(409).json({
         status: 409,
         code: "ALREADY_ACTIVE",
-        error: "Account is already active",
+        error: "",
       });
     }

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:153:14
 
     // Unfreeze the account
     const updatedAccount = await prisma.account.update({
-      where: { id: wallet.accountId },
+      where: {},
       data: { status: "ACTIVE" },
     });

[NoCoverage] StringLiteral
src/handlers/admin/freezeWallet.mjs:164:7
         userId: wallet.account.user.id,
         reason,
       },
-      "Account unfrozen by admin"
+      ""
     );
 

[NoCoverage] StringLiteral
src/handlers/admin/freezeWallet.mjs:169:16
 
     return res.status(200).json({
       status: 200,
-      message: "Account unfrozen successfully",
+      message: "",
       data: {
         account: {

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:170:13
     return res.status(200).json({
       status: 200,
       message: "Account unfrozen successfully",
-      data: {
-        account: {
-          id: updatedAccount.id,
-          status: updatedAccount.status,
-        },
-        user: {
-          id: wallet.account.user.id,
-          email: wallet.account.user.email,
-        },
-        unfrozenBy: req.user.id,
-        reason: reason || null,
-      },
+      data: {},
     });
   } catch (err) {

[NoCoverage] LogicalOperator
src/handlers/admin/freezeWallet.mjs:180:17
           email: wallet.account.user.email,
         },
         unfrozenBy: req.user.id,
-        reason: reason || null,
+        reason: reason && null,
       },
     });

[NoCoverage] ConditionalExpression
src/handlers/admin/freezeWallet.mjs:180:17
           email: wallet.account.user.email,
         },
         unfrozenBy: req.user.id,
-        reason: reason || null,
+        reason: false,
       },
     });

[NoCoverage] BlockStatement
src/handlers/admin/freezeWallet.mjs:183:17
         reason: reason || null,
       },
     });
-  } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to unfreeze wallet");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to unfreeze wallet",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
src/handlers/admin/freezeWallet.mjs:184:52
       },
     });
   } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to unfreeze wallet");
+    logger.error({ err, walletId: req.params.id }, "");
     return res.status(500).json({
       status: 500,

[NoCoverage] ObjectLiteral
src/handlers/admin/freezeWallet.mjs:184:18
       },
     });
   } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to unfreeze wallet");
+    logger.error({}, "Failed to unfreeze wallet");
     return res.status(500).json({
       status: 500,
