[NoCoverage] ConditionalExpression
src/handlers/debit.mjs:8:7
 export default async function debit(req, res) {
   const { walletId, amount, referenceId } = req.body;
 
-  if (!walletId || !amount || !referenceId) {
+  if (true) {
     return res.status(400).json({
       status: 400,

[NoCoverage] BooleanLiteral
src/handlers/debit.mjs:8:7
 export default async function debit(req, res) {
   const { walletId, amount, referenceId } = req.body;
 
-  if (!walletId || !amount || !referenceId) {
+  if (walletId || !amount || !referenceId) {
     return res.status(400).json({
       status: 400,

[NoCoverage] ObjectLiteral
src/handlers/debit.mjs:19:16
   try {
     const result = await prisma.$transaction(async (tx) => {
       const wallet = await tx.wallet.findFirst({
-        where: { id: walletId, accountId: req.user.account.id },
+        where: {},
       });
 

[NoCoverage] ConditionalExpression
src/handlers/debit.mjs:33:11
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);
 
-      if (balanceM.lessThan(amountM)) {
+      if (true) {
         const err = new Error("Insufficient funds");
         err.statusCode = 422;

[NoCoverage] ConditionalExpression
src/handlers/debit.mjs:33:11
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);
 
-      if (balanceM.lessThan(amountM)) {
+      if (false) {
         const err = new Error("Insufficient funds");
         err.statusCode = 422;

[NoCoverage] ObjectLiteral
src/handlers/debit.mjs:45:15
 
       const updatedWallet = await tx.wallet.update({
         where: { id: walletId, version: wallet.version },
-        data: {
-          balance: newBalance,
-          version: { increment: 1 },
-        },
+        data: {},
       });
 

[NoCoverage] ObjectLiteral
src/handlers/debit.mjs:62:35
         },
       });
 
-      await tx.ledgerEntry.create({
-        data: {
-          id: uuid(),
-          transactionId: transaction.id,
-          direction: "debit",
-          amount,
-          balanceBefore: wallet.balance,
-          balanceAfter: updatedWallet.balance,
-        },
-      });
+      await tx.ledgerEntry.create({});
 
       return { transaction, wallet: updatedWallet };

[NoCoverage] ObjectLiteral
src/handlers/debit.mjs:63:15
       });
 
       await tx.ledgerEntry.create({
-        data: {
-          id: uuid(),
-          transactionId: transaction.id,
-          direction: "debit",
-          amount,
-          balanceBefore: wallet.balance,
-          balanceAfter: updatedWallet.balance,
-        },
+        data: {},
       });
 

[NoCoverage] StringLiteral
src/handlers/debit.mjs:78:13
 
     res.status(200).json({
       status: 200,
-      code: "OK",
+      code: "",
       data: result,
     });

[NoCoverage] ConditionalExpression
src/handlers/debit.mjs:83:18
     });
   } catch (err) {
     const statusCode = err.statusCode || 500;
-    const code = err.code || "INTERNAL_SERVER_ERROR";
+    const code = false;
     res.status(statusCode).json({
       status: statusCode,
