[NoCoverage] BlockStatement
src/handlers/reverse.mjs:7:23
   try {
     const { referenceId } = req.body;
 
-    if (!referenceId) {
-      return res.status(400).json({
-        status: 400,
-        code: "BAD_REQUEST",
-        error: "Missing required field: referenceId",
-      });
-    }
+    if (!referenceId) {}
 
     // Find transaction and ensure it belongs to user's account

[NoCoverage] ConditionalExpression
src/handlers/reverse.mjs:7:9
   try {
     const { referenceId } = req.body;
 
-    if (!referenceId) {
+    if (true) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ObjectLiteral
src/handlers/reverse.mjs:8:35
     const { referenceId } = req.body;
 
     if (!referenceId) {
-      return res.status(400).json({
-        status: 400,
-        code: "BAD_REQUEST",
-        error: "Missing required field: referenceId",
-      });
+      return res.status(400).json({});
     }
 

[NoCoverage] ObjectLiteral
src/handlers/reverse.mjs:16:52
     }
 
     // Find transaction and ensure it belongs to user's account
-    const txn = await prisma.transaction.findFirst({
-      where: {
-        referenceId,
-        wallet: { accountId: req.user.account.id },
-      },
-    });
+    const txn = await prisma.transaction.findFirst({});
 
     if (!txn) {

[NoCoverage] ObjectLiteral
src/handlers/reverse.mjs:17:14
 
     // Find transaction and ensure it belongs to user's account
     const txn = await prisma.transaction.findFirst({
-      where: {
-        referenceId,
-        wallet: { accountId: req.user.account.id },
-      },
+      where: {},
     });
 

[NoCoverage] ConditionalExpression
src/handlers/reverse.mjs:23:9
       },
     });
 
-    if (!txn) {
+    if (true) {
       return res.status(404).json({
         status: 404,

[NoCoverage] BlockStatement
src/handlers/reverse.mjs:23:15
       },
     });
 
-    if (!txn) {
-      return res.status(404).json({
-        status: 404,
-        code: "NOT_FOUND",
-        error: "Transaction not found",
-      });
-    }
+    if (!txn) {}
 
     if (txn.status === "reversed") {

[NoCoverage] ObjectLiteral
src/handlers/reverse.mjs:24:35
     });
 
     if (!txn) {
-      return res.status(404).json({
-        status: 404,
-        code: "NOT_FOUND",
-        error: "Transaction not found",
-      });
+      return res.status(404).json({});
     }
 

[NoCoverage] ConditionalExpression
src/handlers/reverse.mjs:31:9
       });
     }
 
-    if (txn.status === "reversed") {
+    if (true) {
       return res.status(409).json({
         status: 409,

[NoCoverage] BlockStatement
src/handlers/reverse.mjs:31:36
       });
     }
 
-    if (txn.status === "reversed") {
-      return res.status(409).json({
-        status: 409,
-        code: "CONFLICT",
-        error: "Transaction already reversed",
-      });
-    }
+    if (txn.status === "reversed") {}
 
     await prisma.transaction.update({

[NoCoverage] StringLiteral
src/handlers/reverse.mjs:34:15
     if (txn.status === "reversed") {
       return res.status(409).json({
         status: 409,
-        code: "CONFLICT",
+        code: "",
         error: "Transaction already reversed",
       });

[NoCoverage] ObjectLiteral
src/handlers/reverse.mjs:40:14
     }
 
     await prisma.transaction.update({
-      where: { id: txn.id },
+      where: {},
       data: { status: "reversed" },
     });

[NoCoverage] StringLiteral
src/handlers/reverse.mjs:41:23
 
     await prisma.transaction.update({
       where: { id: txn.id },
-      data: { status: "reversed" },
+      data: { status: "" },
     });
 

[NoCoverage] StringLiteral
src/handlers/reverse.mjs:47:23
     res.status(200).json({
       status: 200,
       code: "OK",
-      data: { status: "reversed", referenceId },
+      data: { status: "", referenceId },
     });
   } catch (err) {

[NoCoverage] BlockStatement
src/handlers/reverse.mjs:49:17
       code: "OK",
       data: { status: "reversed", referenceId },
     });
-  } catch (err) {
-    res.status(500).json({
-      status: 500,
-      code: "INTERNAL_SERVER_ERROR",
-      error: err.message,
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
src/handlers/reverse.mjs:52:13
   } catch (err) {
     res.status(500).json({
       status: 500,
-      code: "INTERNAL_SERVER_ERROR",
+      code: "",
       error: err.message,
     });
