[NoCoverage] StringLiteral
src/handlers/admin/listTransactions.mjs:8:27
 const querySchema = z.object({
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
-  type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
+  type: z.enum(["credit", "", "authorize", "reverse"]).optional(),
   status: z.enum(["pending", "completed", "reversed"]).optional(),
   walletId: z.string().uuid().optional(),

[NoCoverage] StringLiteral
src/handlers/admin/listTransactions.mjs:9:19
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
   type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
-  status: z.enum(["pending", "completed", "reversed"]).optional(),
+  status: z.enum(["", "completed", "reversed"]).optional(),
   walletId: z.string().uuid().optional(),
   minAmount: z.coerce.number().int().optional(),

[NoCoverage] BlockStatement
src/handlers/admin/listTransactions.mjs:22:30
 export default async function listTransactions(req, res) {
   try {
     const validation = querySchema.safeParse(req.query);
-    if (!validation.success) {
-      return res.status(400).json({
-        status: 400,
-        code: "VALIDATION_ERROR",
-        error: "Invalid query parameters",
-        details: validation.error.issues,
-      });
-    }
+    if (!validation.success) {}
 
     const { page, limit, type, status, walletId, minAmount, maxAmount } =

[NoCoverage] StringLiteral
src/handlers/admin/listTransactions.mjs:25:15
     if (!validation.success) {
       return res.status(400).json({
         status: 400,
-        code: "VALIDATION_ERROR",
+        code: "",
         error: "Invalid query parameters",
         details: validation.error.issues,

[NoCoverage] ConditionalExpression
src/handlers/admin/listTransactions.mjs:36:9
 
     // Build filter
     const where = {};
-    if (type) where.type = type;
+    if (true) where.type = type;
     if (status) where.status = status;
     if (walletId) where.walletId = walletId;

[NoCoverage] ConditionalExpression
src/handlers/admin/listTransactions.mjs:36:9
 
     // Build filter
     const where = {};
-    if (type) where.type = type;
+    if (false) where.type = type;
     if (status) where.status = status;
     if (walletId) where.walletId = walletId;

[NoCoverage] ConditionalExpression
src/handlers/admin/listTransactions.mjs:38:9
     const where = {};
     if (type) where.type = type;
     if (status) where.status = status;
-    if (walletId) where.walletId = walletId;
+    if (false) where.walletId = walletId;
     if (minAmount !== undefined) where.amount = { gte: minAmount };
     if (maxAmount !== undefined) {

[NoCoverage] ConditionalExpression
src/handlers/admin/listTransactions.mjs:38:9
     const where = {};
     if (type) where.type = type;
     if (status) where.status = status;
-    if (walletId) where.walletId = walletId;
+    if (true) where.walletId = walletId;
     if (minAmount !== undefined) where.amount = { gte: minAmount };
     if (maxAmount !== undefined) {

[NoCoverage] EqualityOperator
src/handlers/admin/listTransactions.mjs:39:9
     if (type) where.type = type;
     if (status) where.status = status;
     if (walletId) where.walletId = walletId;
-    if (minAmount !== undefined) where.amount = { gte: minAmount };
+    if (minAmount === undefined) where.amount = { gte: minAmount };
     if (maxAmount !== undefined) {
       where.amount = { ...where.amount, lte: maxAmount };

[NoCoverage] ConditionalExpression
src/handlers/admin/listTransactions.mjs:39:9
     if (type) where.type = type;
     if (status) where.status = status;
     if (walletId) where.walletId = walletId;
-    if (minAmount !== undefined) where.amount = { gte: minAmount };
+    if (true) where.amount = { gte: minAmount };
     if (maxAmount !== undefined) {
       where.amount = { ...where.amount, lte: maxAmount };

[NoCoverage] ConditionalExpression
src/handlers/admin/listTransactions.mjs:40:9
     if (status) where.status = status;
     if (walletId) where.walletId = walletId;
     if (minAmount !== undefined) where.amount = { gte: minAmount };
-    if (maxAmount !== undefined) {
+    if (false) {
       where.amount = { ...where.amount, lte: maxAmount };
     }

[NoCoverage] EqualityOperator
src/handlers/admin/listTransactions.mjs:40:9
     if (status) where.status = status;
     if (walletId) where.walletId = walletId;
     if (minAmount !== undefined) where.amount = { gte: minAmount };
-    if (maxAmount !== undefined) {
+    if (maxAmount === undefined) {
       where.amount = { ...where.amount, lte: maxAmount };
     }

[NoCoverage] ObjectLiteral
src/handlers/admin/listTransactions.mjs:52:19
         skip: (page - 1) * limit,
         take: limit,
         include: {
-          wallet: {
-            select: {
-              id: true,
-              currency: true,
-              account: {
-                select: {
-                  id: true,
-                  user: {
-                    select: {
-                      id: true,
-                      email: true,
-                    },
-                  },
-                },
-              },
-            },
-          },
+          wallet: {},
           ledger: {
             select: {

[NoCoverage] ObjectLiteral
src/handlers/admin/listTransactions.mjs:53:21
         take: limit,
         include: {
           wallet: {
-            select: {
-              id: true,
-              currency: true,
-              account: {
-                select: {
-                  id: true,
-                  user: {
-                    select: {
-                      id: true,
-                      email: true,
-                    },
-                  },
-                },
-              },
-            },
+            select: {},
           },
           ledger: {

[NoCoverage] ArrowFunction
src/handlers/admin/listTransactions.mjs:88:40
     return res.status(200).json({
       status: 200,
       data: {
-        transactions: transactions.map((tx) => ({
-          id: tx.id,
-          type: tx.type,
-          amount: tx.amount,
-          status: tx.status,
-          referenceId: tx.referenceId,
-          createdAt: tx.createdAt,
-          wallet: {
-            id: tx.wallet.id,
-            currency: tx.wallet.currency,
-          },
-          user: {
-            id: tx.wallet.account.user.id,
-            email: tx.wallet.account.user.email,
-          },
-          ledgerEntries: tx.ledger,
-        })),
+        transactions: transactions.map(() => undefined),
         pagination: {
           page,

[NoCoverage] ObjectLiteral
src/handlers/admin/listTransactions.mjs:88:49
     return res.status(200).json({
       status: 200,
       data: {
-        transactions: transactions.map((tx) => ({
-          id: tx.id,
-          type: tx.type,
-          amount: tx.amount,
-          status: tx.status,
-          referenceId: tx.referenceId,
-          createdAt: tx.createdAt,
-          wallet: {
-            id: tx.wallet.id,
-            currency: tx.wallet.currency,
-          },
-          user: {
-            id: tx.wallet.account.user.id,
-            email: tx.wallet.account.user.email,
-          },
-          ledgerEntries: tx.ledger,
-        })),
+        transactions: transactions.map((tx) => ({})),
         pagination: {
           page,

[NoCoverage] ObjectLiteral
src/handlers/admin/listTransactions.mjs:105:21
           },
           ledgerEntries: tx.ledger,
         })),
-        pagination: {
-          page,
-          limit,
-          total,
-          totalPages,
-          hasNext: page < totalPages,
-          hasPrev: page > 1,
-        },
+        pagination: {},
       },
     });

[NoCoverage] BlockStatement
src/handlers/admin/listTransactions.mjs:115:17
         },
       },
     });
-  } catch (err) {
-    logger.error({ err }, "Failed to list transactions");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to list transactions",
-    });
-  }
+  } catch (err) {}
 }
 
