[NoCoverage] MethodExpression
src/handlers/wallets/deposit.mjs:9:16
 
 const depositSchema = z.object({
   amount: z.number().int().positive("Amount must be a positive integer"),
-  referenceId: z.string().min(1, "Reference ID is required"),
+  referenceId: z.string().max(1, "Reference ID is required"),
   description: z.string().max(255).optional(),
 });

[NoCoverage] StringLiteral
src/handlers/wallets/deposit.mjs:9:34
 
 const depositSchema = z.object({
   amount: z.number().int().positive("Amount must be a positive integer"),
-  referenceId: z.string().min(1, "Reference ID is required"),
+  referenceId: z.string().min(1, ""),
   description: z.string().max(255).optional(),
 });

[NoCoverage] MethodExpression
src/handlers/wallets/deposit.mjs:10:16
 const depositSchema = z.object({
   amount: z.number().int().positive("Amount must be a positive integer"),
   referenceId: z.string().min(1, "Reference ID is required"),
-  description: z.string().max(255).optional(),
+  description: z.string().min(255).optional(),
 });
 

[NoCoverage] BlockStatement
src/handlers/wallets/deposit.mjs:23:30
 
     // Validate request body
     const validation = depositSchema.safeParse(req.body);
-    if (!validation.success) {
-      return res.status(400).json({
-        status: 400,
-        code: "VALIDATION_ERROR",
-        error: "Invalid request body",
-        details: validation.error.issues,
-      });
-    }
+    if (!validation.success) {}
 
     const { amount, referenceId } = validation.data;

[NoCoverage] BooleanLiteral
src/handlers/wallets/deposit.mjs:23:9
 
     // Validate request body
     const validation = depositSchema.safeParse(req.body);
-    if (!validation.success) {
+    if (validation.success) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:24:35
     // Validate request body
     const validation = depositSchema.safeParse(req.body);
     if (!validation.success) {
-      return res.status(400).json({
-        status: 400,
-        code: "VALIDATION_ERROR",
-        error: "Invalid request body",
-        details: validation.error.issues,
-      });
+      return res.status(400).json({});
     }
 

[NoCoverage] StringLiteral
src/handlers/wallets/deposit.mjs:27:16
       return res.status(400).json({
         status: 400,
         code: "VALIDATION_ERROR",
-        error: "Invalid request body",
+        error: "",
         details: validation.error.issues,
       });

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:36:48
 
     const result = await prisma.$transaction(async (tx) => {
       // Verify wallet belongs to user
-      const wallet = await tx.wallet.findFirst({
-        where: {
-          id,
-          accountId: req.user.account.id,
-        },
-        include: {
-          account: true,
-        },
-      });
+      const wallet = await tx.wallet.findFirst({});
 
       if (!wallet) {

[NoCoverage] BooleanLiteral
src/handlers/wallets/deposit.mjs:42:20
           accountId: req.user.account.id,
         },
         include: {
-          account: true,
+          account: false,
         },
       });

[NoCoverage] BlockStatement
src/handlers/wallets/deposit.mjs:46:20
         },
       });
 
-      if (!wallet) {
-        const err = new Error("Wallet not found");
-        err.statusCode = 404;
-        err.code = "WALLET_NOT_FOUND";
-        throw err;
-      }
+      if (!wallet) {}
 
       // Check account is not frozen

[NoCoverage] StringLiteral
src/handlers/wallets/deposit.mjs:49:20
       if (!wallet) {
         const err = new Error("Wallet not found");
         err.statusCode = 404;
-        err.code = "WALLET_NOT_FOUND";
+        err.code = "";
         throw err;
       }

[NoCoverage] ConditionalExpression
src/handlers/wallets/deposit.mjs:54:11
       }
 
       // Check account is not frozen
-      if (wallet.account.status === "FROZEN") {
+      if (false) {
         const err = new Error("Account is frozen");
         err.statusCode = 403;

[NoCoverage] EqualityOperator
src/handlers/wallets/deposit.mjs:54:11
       }
 
       // Check account is not frozen
-      if (wallet.account.status === "FROZEN") {
+      if (wallet.account.status !== "FROZEN") {
         const err = new Error("Account is frozen");
         err.statusCode = 403;

[NoCoverage] ConditionalExpression
src/handlers/wallets/deposit.mjs:66:11
         where: { referenceId },
       });
 
-      if (existingTx) {
+      if (false) {
         const err = new Error("Duplicate reference ID");
         err.statusCode = 409;

[NoCoverage] ConditionalExpression
src/handlers/wallets/deposit.mjs:66:11
         where: { referenceId },
       });
 
-      if (existingTx) {
+      if (true) {
         const err = new Error("Duplicate reference ID");
         err.statusCode = 409;

[NoCoverage] StringLiteral
src/handlers/wallets/deposit.mjs:67:31
       });
 
       if (existingTx) {
-        const err = new Error("Duplicate reference ID");
+        const err = new Error("");
         err.statusCode = 409;
         err.code = "DUPLICATE_REFERENCE";

[NoCoverage] LogicalOperator
src/handlers/wallets/deposit.mjs:74:24
       }
 
       // Credit the wallet
-      const currency = wallet.currency || "USD";
+      const currency = wallet.currency && "USD";
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);

[NoCoverage] ConditionalExpression
src/handlers/wallets/deposit.mjs:74:24
       }
 
       // Credit the wallet
-      const currency = wallet.currency || "USD";
+      const currency = false;
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:81:16
       const newBalance = Number(newBalanceM.minor);
 
       const updatedWallet = await tx.wallet.update({
-        where: { id },
+        where: {},
         data: { balance: newBalance },
       });

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:82:15
 
       const updatedWallet = await tx.wallet.update({
         where: { id },
-        data: { balance: newBalance },
+        data: {},
       });
 

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:87:15
 
       // Create transaction record
       const transaction = await tx.transaction.create({
-        data: {
-          id: uuid(),
-          walletId: id,
-          type: "credit",
-          amount,
-          status: "completed",
-          referenceId,
-        },
+        data: {},
       });
 

[NoCoverage] StringLiteral
src/handlers/wallets/deposit.mjs:90:17
         data: {
           id: uuid(),
           walletId: id,
-          type: "credit",
+          type: "",
           amount,
           status: "completed",

[NoCoverage] StringLiteral
src/handlers/wallets/deposit.mjs:92:19
           walletId: id,
           type: "credit",
           amount,
-          status: "completed",
+          status: "",
           referenceId,
         },

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:126:22
       status: 200,
       message: "Deposit successful",
       data: {
-        transaction: {
-          id: result.transaction.id,
-          type: result.transaction.type,
-          amount: result.transaction.amount,
-          status: result.transaction.status,
-          referenceId: result.transaction.referenceId,
-          createdAt: result.transaction.createdAt,
-        },
+        transaction: {},
         wallet: {
           id: result.wallet.id,

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:134:17
           referenceId: result.transaction.referenceId,
           createdAt: result.transaction.createdAt,
         },
-        wallet: {
-          id: result.wallet.id,
-          balance: result.wallet.balance,
-          currency: result.wallet.currency,
-        },
+        wallet: {},
       },
     });

[NoCoverage] BlockStatement
src/handlers/wallets/deposit.mjs:141:17
         },
       },
     });
-  } catch (err) {
-    if (err.statusCode) {
-      return res.status(err.statusCode).json({
-        status: err.statusCode,
-        code: err.code,
-        error: err.message,
-      });
-    }
-
-    logger.error({ err, walletId: req.params.id }, "Deposit failed");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Deposit failed",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
src/handlers/wallets/deposit.mjs:142:25
       },
     });
   } catch (err) {
-    if (err.statusCode) {
-      return res.status(err.statusCode).json({
-        status: err.statusCode,
-        code: err.code,
-        error: err.message,
-      });
-    }
+    if (err.statusCode) {}
 
     logger.error({ err, walletId: req.params.id }, "Deposit failed");

[NoCoverage] ConditionalExpression
src/handlers/wallets/deposit.mjs:142:9
       },
     });
   } catch (err) {
-    if (err.statusCode) {
+    if (true) {
       return res.status(err.statusCode).json({
         status: err.statusCode,

[NoCoverage] ObjectLiteral
src/handlers/wallets/deposit.mjs:150:18
       });
     }
 
-    logger.error({ err, walletId: req.params.id }, "Deposit failed");
+    logger.error({}, "Deposit failed");
     return res.status(500).json({
       status: 500,
