[NoCoverage] StringLiteral
src/handlers/admin/listUsers.mjs:8:17
 const querySchema = z.object({
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
-  role: z.enum(["CUSTOMER", "ADMIN"]).optional(),
+  role: z.enum(["", "ADMIN"]).optional(),
   search: z.string().max(100).optional(),
 });

[NoCoverage] MethodExpression
src/handlers/admin/listUsers.mjs:9:11
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
   role: z.enum(["CUSTOMER", "ADMIN"]).optional(),
-  search: z.string().max(100).optional(),
+  search: z.string().min(100).optional(),
 });
 

[NoCoverage] BooleanLiteral
src/handlers/admin/listUsers.mjs:19:9
 export default async function listUsers(req, res) {
   try {
     const validation = querySchema.safeParse(req.query);
-    if (!validation.success) {
+    if (validation.success) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ConditionalExpression
src/handlers/admin/listUsers.mjs:33:9
     // Build filter
     const where = {};
     if (role) where.role = role;
-    if (search) {
+    if (true) {
       where.email = { contains: search };
     }

[NoCoverage] ConditionalExpression
src/handlers/admin/listUsers.mjs:33:9
     // Build filter
     const where = {};
     if (role) where.role = role;
-    if (search) {
+    if (false) {
       where.email = { contains: search };
     }

[NoCoverage] StringLiteral
src/handlers/admin/listUsers.mjs:41:31
       prisma.user.count({ where }),
       prisma.user.findMany({
         where,
-        orderBy: { createdAt: "desc" },
+        orderBy: { createdAt: "" },
         skip: (page - 1) * limit,
         take: limit,

[NoCoverage] ObjectLiteral
src/handlers/admin/listUsers.mjs:41:18
       prisma.user.count({ where }),
       prisma.user.findMany({
         where,
-        orderBy: { createdAt: "desc" },
+        orderBy: {},
         skip: (page - 1) * limit,
         take: limit,

[NoCoverage] ObjectLiteral
src/handlers/admin/listUsers.mjs:51:21
           createdAt: true,
           updatedAt: true,
           account: {
-            select: {
-              id: true,
-              status: true,
-              createdAt: true,
-              _count: {
-                select: { wallets: true },
-              },
-            },
+            select: {},
           },
         },

[NoCoverage] ObjectLiteral
src/handlers/admin/listUsers.mjs:55:23
               id: true,
               status: true,
               createdAt: true,
-              _count: {
-                select: { wallets: true },
-              },
+              _count: {},
             },
           },

[NoCoverage] ObjectLiteral
src/handlers/admin/listUsers.mjs:56:25
               status: true,
               createdAt: true,
               _count: {
-                select: { wallets: true },
+                select: {},
               },
             },

[NoCoverage] ArrowFunction
src/handlers/admin/listUsers.mjs:69:26
     return res.status(200).json({
       status: 200,
       data: {
-        users: users.map((u) => ({
-          id: u.id,
-          email: u.email,
-          role: u.role,
-          createdAt: u.createdAt,
-          updatedAt: u.updatedAt,
-          account: u.account
-            ? {
-                id: u.account.id,
-                status: u.account.status,
-                createdAt: u.account.createdAt,
-                walletCount: u.account._count.wallets,
-              }
-            : null,
-        })),
+        users: users.map(() => undefined),
         pagination: {
           page,

[NoCoverage] ObjectLiteral
src/handlers/admin/listUsers.mjs:76:15
           createdAt: u.createdAt,
           updatedAt: u.updatedAt,
           account: u.account
-            ? {
-                id: u.account.id,
-                status: u.account.status,
-                createdAt: u.account.createdAt,
-                walletCount: u.account._count.wallets,
-              }
+            ? {}
             : null,
         })),

[NoCoverage] BlockStatement
src/handlers/admin/listUsers.mjs:94:17
         },
       },
     });
-  } catch (err) {
-    logger.error({ err }, "Failed to list users");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to list users",
-    });
-  }
+  } catch (err) {}
 }
 
