[NoCoverage] ArrayDeclaration
src/handlers/admin/listWallets.mjs:11:25
   currency: z.string().length(3).optional(),
   minBalance: z.coerce.number().int().optional(),
   maxBalance: z.coerce.number().int().optional(),
-  accountStatus: z.enum(["ACTIVE", "FROZEN"]).optional(),
+  accountStatus: z.enum([]).optional(),
 });
 

[NoCoverage] ConditionalExpression
src/handlers/admin/listWallets.mjs:35:9
 
     // Build filter
     const where = {};
-    if (currency) where.currency = currency;
+    if (false) where.currency = currency;
     if (minBalance !== undefined) where.balance = { gte: minBalance };
     if (maxBalance !== undefined) {

[NoCoverage] ConditionalExpression
src/handlers/admin/listWallets.mjs:35:9
 
     // Build filter
     const where = {};
-    if (currency) where.currency = currency;
+    if (true) where.currency = currency;
     if (minBalance !== undefined) where.balance = { gte: minBalance };
     if (maxBalance !== undefined) {

[NoCoverage] EqualityOperator
src/handlers/admin/listWallets.mjs:36:9
     // Build filter
     const where = {};
     if (currency) where.currency = currency;
-    if (minBalance !== undefined) where.balance = { gte: minBalance };
+    if (minBalance === undefined) where.balance = { gte: minBalance };
     if (maxBalance !== undefined) {
       where.balance = { ...where.balance, lte: maxBalance };

[NoCoverage] ConditionalExpression
src/handlers/admin/listWallets.mjs:36:9
     // Build filter
     const where = {};
     if (currency) where.currency = currency;
-    if (minBalance !== undefined) where.balance = { gte: minBalance };
+    if (false) where.balance = { gte: minBalance };
     if (maxBalance !== undefined) {
       where.balance = { ...where.balance, lte: maxBalance };

[NoCoverage] EqualityOperator
src/handlers/admin/listWallets.mjs:37:9
     const where = {};
     if (currency) where.currency = currency;
     if (minBalance !== undefined) where.balance = { gte: minBalance };
-    if (maxBalance !== undefined) {
+    if (maxBalance === undefined) {
       where.balance = { ...where.balance, lte: maxBalance };
     }

[NoCoverage] ConditionalExpression
src/handlers/admin/listWallets.mjs:37:9
     const where = {};
     if (currency) where.currency = currency;
     if (minBalance !== undefined) where.balance = { gte: minBalance };
-    if (maxBalance !== undefined) {
+    if (true) {
       where.balance = { ...where.balance, lte: maxBalance };
     }

[NoCoverage] ConditionalExpression
src/handlers/admin/listWallets.mjs:40:9
     if (maxBalance !== undefined) {
       where.balance = { ...where.balance, lte: maxBalance };
     }
-    if (accountStatus) {
+    if (false) {
       where.account = { status: accountStatus };
     }

[NoCoverage] BlockStatement
src/handlers/admin/listWallets.mjs:40:24
     if (maxBalance !== undefined) {
       where.balance = { ...where.balance, lte: maxBalance };
     }
-    if (accountStatus) {
-      where.account = { status: accountStatus };
-    }
+    if (accountStatus) {}
 
     const [total, wallets] = await Promise.all([

[NoCoverage] ObjectLiteral
src/handlers/admin/listWallets.mjs:51:18
         orderBy: { createdAt: "desc" },
         skip: (page - 1) * limit,
         take: limit,
-        include: {
-          account: {
-            select: {
-              id: true,
-              status: true,
-              user: {
-                select: {
-                  id: true,
-                  email: true,
-                },
-              },
-            },
-          },
-          _count: {
-            select: { txns: true },
-          },
-        },
+        include: {},
       }),
     ]);

[NoCoverage] ObjectLiteral
src/handlers/admin/listWallets.mjs:64:19
               },
             },
           },
-          _count: {
-            select: { txns: true },
-          },
+          _count: {},
         },
       }),

[NoCoverage] BooleanLiteral
src/handlers/admin/listWallets.mjs:65:29
             },
           },
           _count: {
-            select: { txns: true },
+            select: { txns: false },
           },
         },

[NoCoverage] ArrowFunction
src/handlers/admin/listWallets.mjs:76:30
     return res.status(200).json({
       status: 200,
       data: {
-        wallets: wallets.map((w) => ({
-          id: w.id,
-          currency: w.currency,
-          balance: w.balance,
-          version: w.version,
-          createdAt: w.createdAt,
-          transactionCount: w._count.txns,
-          account: {
-            id: w.account.id,
-            status: w.account.status,
-          },
-          user: {
-            id: w.account.user.id,
-            email: w.account.user.email,
-          },
-        })),
+        wallets: wallets.map(() => undefined),
         pagination: {
           page,

[NoCoverage] ObjectLiteral
src/handlers/admin/listWallets.mjs:83:20
           version: w.version,
           createdAt: w.createdAt,
           transactionCount: w._count.txns,
-          account: {
-            id: w.account.id,
-            status: w.account.status,
-          },
+          account: {},
           user: {
             id: w.account.user.id,

[NoCoverage] BlockStatement
src/handlers/admin/listWallets.mjs:102:17
         },
       },
     });
-  } catch (err) {
-    logger.error({ err }, "Failed to list wallets");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to list wallets",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
src/handlers/admin/listWallets.mjs:103:27
       },
     });
   } catch (err) {
-    logger.error({ err }, "Failed to list wallets");
+    logger.error({ err }, "");
     return res.status(500).json({
       status: 500,
