[NoCoverage] ObjectLiteral
src/handlers/wallets/getBalance.mjs:12:50
   try {
     const { id } = req.params;
 
-    const wallet = await prisma.wallet.findFirst({
-      where: {
-        id,
-        accountId: req.user.account.id,
-      },
-      select: {
-        id: true,
-        currency: true,
-        balance: true,
-      },
-    });
+    const wallet = await prisma.wallet.findFirst({});
 
     if (!wallet) {

[NoCoverage] ObjectLiteral
src/handlers/wallets/getBalance.mjs:17:15
         id,
         accountId: req.user.account.id,
       },
-      select: {
-        id: true,
-        currency: true,
-        balance: true,
-      },
+      select: {},
     });
 

[NoCoverage] BooleanLiteral
src/handlers/wallets/getBalance.mjs:19:19
       },
       select: {
         id: true,
-        currency: true,
+        currency: false,
         balance: true,
       },

[NoCoverage] BooleanLiteral
src/handlers/wallets/getBalance.mjs:20:18
       select: {
         id: true,
         currency: true,
-        balance: true,
+        balance: false,
       },
     });

[NoCoverage] ObjectLiteral
src/handlers/wallets/getBalance.mjs:25:35
     });
 
     if (!wallet) {
-      return res.status(404).json({
-        status: 404,
-        code: "WALLET_NOT_FOUND",
-        error: "Wallet not found",
-      });
+      return res.status(404).json({});
     }
 

[NoCoverage] StringLiteral
src/handlers/wallets/getBalance.mjs:27:15
     if (!wallet) {
       return res.status(404).json({
         status: 404,
-        code: "WALLET_NOT_FOUND",
+        code: "",
         error: "Wallet not found",
       });

[NoCoverage] StringLiteral
src/handlers/wallets/getBalance.mjs:28:16
       return res.status(404).json({
         status: 404,
         code: "WALLET_NOT_FOUND",
-        error: "Wallet not found",
+        error: "",
       });
     }

[NoCoverage] BlockStatement
src/handlers/wallets/getBalance.mjs:41:17
         availableBalance: wallet.balance, // Future: subtract pending holds
       },
     });
-  } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to get balance");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to get balance",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
src/handlers/wallets/getBalance.mjs:45:13
     logger.error({ err, walletId: req.params.id }, "Failed to get balance");
     return res.status(500).json({
       status: 500,
-      code: "INTERNAL_ERROR",
+      code: "",
       error: "Failed to get balance",
     });
