[NoCoverage] ObjectLiteral
src/handlers/wallets/getTransactions.mjs:5:30
 import { prisma } from "../../infra/prisma.mjs";
 import logger from "../../infra/logger.mjs";
 
-const querySchema = z.object({
-  page: z.coerce.number().int().min(1).optional().default(1),
-  limit: z.coerce.number().int().min(1).max(100).optional().default(20),
-  type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
-  status: z.enum(["pending", "completed", "reversed"]).optional(),
-});
+const querySchema = z.object({});
 
 /**

[NoCoverage] MethodExpression
src/handlers/wallets/getTransactions.mjs:6:9
 import logger from "../../infra/logger.mjs";
 
 const querySchema = z.object({
-  page: z.coerce.number().int().min(1).optional().default(1),
+  page: z.coerce.number().int().max(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
   type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),

[NoCoverage] MethodExpression
src/handlers/wallets/getTransactions.mjs:7:10
 
 const querySchema = z.object({
   page: z.coerce.number().int().min(1).optional().default(1),
-  limit: z.coerce.number().int().min(1).max(100).optional().default(20),
+  limit: z.coerce.number().int().max(1).max(100).optional().default(20),
   type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
   status: z.enum(["pending", "completed", "reversed"]).optional(),

[NoCoverage] MethodExpression
src/handlers/wallets/getTransactions.mjs:7:10
 
 const querySchema = z.object({
   page: z.coerce.number().int().min(1).optional().default(1),
-  limit: z.coerce.number().int().min(1).max(100).optional().default(20),
+  limit: z.coerce.number().int().min(1).min(100).optional().default(20),
   type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
   status: z.enum(["pending", "completed", "reversed"]).optional(),

[NoCoverage] StringLiteral
src/handlers/wallets/getTransactions.mjs:8:49
 const querySchema = z.object({
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
-  type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
+  type: z.enum(["credit", "debit", "authorize", ""]).optional(),
   status: z.enum(["pending", "completed", "reversed"]).optional(),
 });

[NoCoverage] StringLiteral
src/handlers/wallets/getTransactions.mjs:8:36
 const querySchema = z.object({
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
-  type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
+  type: z.enum(["credit", "debit", "", "reverse"]).optional(),
   status: z.enum(["pending", "completed", "reversed"]).optional(),
 });

[NoCoverage] StringLiteral
src/handlers/wallets/getTransactions.mjs:9:30
   page: z.coerce.number().int().min(1).optional().default(1),
   limit: z.coerce.number().int().min(1).max(100).optional().default(20),
   type: z.enum(["credit", "debit", "authorize", "reverse"]).optional(),
-  status: z.enum(["pending", "completed", "reversed"]).optional(),
+  status: z.enum(["pending", "", "reversed"]).optional(),
 });
 

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:22:9
 
     // Validate query params
     const validation = querySchema.safeParse(req.query);
-    if (!validation.success) {
+    if (false) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:22:9
 
     // Validate query params
     const validation = querySchema.safeParse(req.query);
-    if (!validation.success) {
+    if (true) {
       return res.status(400).json({
         status: 400,

[NoCoverage] StringLiteral
src/handlers/wallets/getTransactions.mjs:26:16
       return res.status(400).json({
         status: 400,
         code: "VALIDATION_ERROR",
-        error: "Invalid query parameters",
+        error: "",
         details: validation.error.issues,
       });

[NoCoverage] BooleanLiteral
src/handlers/wallets/getTransactions.mjs:39:21
         id,
         accountId: req.user.account.id,
       },
-      select: { id: true },
+      select: { id: false },
     });
 

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:42:9
       select: { id: true },
     });
 
-    if (!wallet) {
+    if (false) {
       return res.status(404).json({
         status: 404,

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:52:9
 
     // Build filter
     const where = { walletId: id };
-    if (type) where.type = type;
+    if (true) where.type = type;
     if (status) where.status = status;
 

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:52:9
 
     // Build filter
     const where = { walletId: id };
-    if (type) where.type = type;
+    if (false) where.type = type;
     if (status) where.status = status;
 

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:53:9
     // Build filter
     const where = { walletId: id };
     if (type) where.type = type;
-    if (status) where.status = status;
+    if (true) where.status = status;
 
     // Get total count and transactions

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:53:9
     // Build filter
     const where = { walletId: id };
     if (type) where.type = type;
-    if (status) where.status = status;
+    if (false) where.status = status;
 
     // Get total count and transactions

[NoCoverage] ObjectLiteral
src/handlers/wallets/getTransactions.mjs:58:35
     // Get total count and transactions
     const [total, transactions] = await Promise.all([
       prisma.transaction.count({ where }),
-      prisma.transaction.findMany({
-        where,
-        orderBy: { createdAt: "desc" },
-        skip: (page - 1) * limit,
-        take: limit,
-        include: {
-          ledger: {
-            select: {
-              id: true,
-              direction: true,
-              amount: true,
-              balanceBefore: true,
-              balanceAfter: true,
-              createdAt: true,
-            },
-          },
-        },
-      }),
+      prisma.transaction.findMany({}),
     ]);
 

[NoCoverage] ArithmeticOperator
src/handlers/wallets/getTransactions.mjs:61:15
       prisma.transaction.findMany({
         where,
         orderBy: { createdAt: "desc" },
-        skip: (page - 1) * limit,
+        skip: (page - 1) / limit,
         take: limit,
         include: {

[NoCoverage] ArithmeticOperator
src/handlers/wallets/getTransactions.mjs:61:16
       prisma.transaction.findMany({
         where,
         orderBy: { createdAt: "desc" },
-        skip: (page - 1) * limit,
+        skip: (page + 1) * limit,
         take: limit,
         include: {

[NoCoverage] ObjectLiteral
src/handlers/wallets/getTransactions.mjs:63:18
         orderBy: { createdAt: "desc" },
         skip: (page - 1) * limit,
         take: limit,
-        include: {
-          ledger: {
-            select: {
-              id: true,
-              direction: true,
-              amount: true,
-              balanceBefore: true,
-              balanceAfter: true,
-              createdAt: true,
-            },
-          },
-        },
+        include: {},
       }),
     ]);

[NoCoverage] BooleanLiteral
src/handlers/wallets/getTransactions.mjs:67:26
           ledger: {
             select: {
               id: true,
-              direction: true,
+              direction: false,
               amount: true,
               balanceBefore: true,

[NoCoverage] BooleanLiteral
src/handlers/wallets/getTransactions.mjs:68:23
             select: {
               id: true,
               direction: true,
-              amount: true,
+              amount: false,
               balanceBefore: true,
               balanceAfter: true,

[NoCoverage] BooleanLiteral
src/handlers/wallets/getTransactions.mjs:69:30
               id: true,
               direction: true,
               amount: true,
-              balanceBefore: true,
+              balanceBefore: false,
               balanceAfter: true,
               createdAt: true,

[NoCoverage] BooleanLiteral
src/handlers/wallets/getTransactions.mjs:70:29
               direction: true,
               amount: true,
               balanceBefore: true,
-              balanceAfter: true,
+              balanceAfter: false,
               createdAt: true,
             },

[NoCoverage] BooleanLiteral
src/handlers/wallets/getTransactions.mjs:71:26
               amount: true,
               balanceBefore: true,
               balanceAfter: true,
-              createdAt: true,
+              createdAt: false,
             },
           },

[NoCoverage] ArithmeticOperator
src/handlers/wallets/getTransactions.mjs:78:34
       }),
     ]);
 
-    const totalPages = Math.ceil(total / limit);
+    const totalPages = Math.ceil(total * limit);
 
     return res.status(200).json({

[NoCoverage] ArrowFunction
src/handlers/wallets/getTransactions.mjs:84:40
       status: 200,
       code: "OK",
       data: {
-        transactions: transactions.map((tx) => ({
-          id: tx.id,
-          walletId: tx.walletId,
-          type: tx.type,
-          amount: tx.amount,
-          status: tx.status,
-          referenceId: tx.referenceId,
-          createdAt: tx.createdAt,
-          ledgerEntries: tx.ledger,
-        })),
+        transactions: transactions.map(() => undefined),
         pagination: {
           page,

[NoCoverage] ConditionalExpression
src/handlers/wallets/getTransactions.mjs:100:20
           total,
           totalPages,
           hasNext: page < totalPages,
-          hasPrev: page > 1,
+          hasPrev: false,
         },
       },

[NoCoverage] BlockStatement
src/handlers/wallets/getTransactions.mjs:104:17
         },
       },
     });
-  } catch (err) {
-    logger.error(
-      { err, walletId: req.params.id },
-      "Failed to get transactions"
-    );
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to get transactions",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
src/handlers/wallets/getTransactions.mjs:107:7
   } catch (err) {
     logger.error(
       { err, walletId: req.params.id },
-      "Failed to get transactions"
+      ""
     );
     return res.status(500).json({
