[NoCoverage] MethodExpression
src/handlers/admin/reverseTransaction.mjs:8:11
 import logger from "../../infra/logger.mjs";
 
 const bodySchema = z.object({
-  reason: z.string().min(1, "Reason is required").max(500),
+  reason: z.string().min(1, "Reason is required").min(500),
 });
 

[NoCoverage] MethodExpression
src/handlers/admin/reverseTransaction.mjs:8:11
 import logger from "../../infra/logger.mjs";
 
 const bodySchema = z.object({
-  reason: z.string().min(1, "Reason is required").max(500),
+  reason: z.string().max(1, "Reason is required").max(500),
 });
 

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:34:59
 
     const result = await prisma.$transaction(async (tx) => {
       // Find the transaction
-      const transaction = await tx.transaction.findUnique({
-        where: { id },
-        include: {
-          wallet: true,
-        },
-      });
+      const transaction = await tx.transaction.findUnique({});
 
       if (!transaction) {

[NoCoverage] BooleanLiteral
src/handlers/admin/reverseTransaction.mjs:37:19
       const transaction = await tx.transaction.findUnique({
         where: { id },
         include: {
-          wallet: true,
+          wallet: false,
         },
       });

[NoCoverage] ConditionalExpression
src/handlers/admin/reverseTransaction.mjs:41:11
         },
       });
 
-      if (!transaction) {
+      if (true) {
         const err = new Error("Transaction not found");
         err.statusCode = 404;

[NoCoverage] BooleanLiteral
src/handlers/admin/reverseTransaction.mjs:41:11
         },
       });
 
-      if (!transaction) {
+      if (transaction) {
         const err = new Error("Transaction not found");
         err.statusCode = 404;

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:42:31
       });
 
       if (!transaction) {
-        const err = new Error("Transaction not found");
+        const err = new Error("");
         err.statusCode = 404;
         err.code = "TRANSACTION_NOT_FOUND";

[NoCoverage] ConditionalExpression
src/handlers/admin/reverseTransaction.mjs:48:11
         throw err;
       }
 
-      if (transaction.status === "reversed") {
+      if (false) {
         const err = new Error("Transaction already reversed");
         err.statusCode = 409;

[NoCoverage] EqualityOperator
src/handlers/admin/reverseTransaction.mjs:48:11
         throw err;
       }
 
-      if (transaction.status === "reversed") {
+      if (transaction.status !== "reversed") {
         const err = new Error("Transaction already reversed");
         err.statusCode = 409;

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:49:31
       }
 
       if (transaction.status === "reversed") {
-        const err = new Error("Transaction already reversed");
+        const err = new Error("");
         err.statusCode = 409;
         err.code = "ALREADY_REVERSED";

[NoCoverage] BlockStatement
src/handlers/admin/reverseTransaction.mjs:55:47
         throw err;
       }
 
-      if (transaction.status !== "completed") {
-        const err = new Error("Only completed transactions can be reversed");
-        err.statusCode = 422;
-        err.code = "INVALID_STATUS";
-        throw err;
-      }
+      if (transaction.status !== "completed") {}
 
       const wallet = transaction.wallet;

[NoCoverage] EqualityOperator
src/handlers/admin/reverseTransaction.mjs:55:11
         throw err;
       }
 
-      if (transaction.status !== "completed") {
+      if (transaction.status === "completed") {
         const err = new Error("Only completed transactions can be reversed");
         err.statusCode = 422;

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:56:31
       }
 
       if (transaction.status !== "completed") {
-        const err = new Error("Only completed transactions can be reversed");
+        const err = new Error("");
         err.statusCode = 422;
         err.code = "INVALID_STATUS";

[NoCoverage] ConditionalExpression
src/handlers/admin/reverseTransaction.mjs:65:24
       const wallet = transaction.wallet;
 
       // Calculate new balance based on original transaction type
-      const currency = wallet.currency || "USD";
+      const currency = true;
       const balanceM = money(wallet.balance, currency);
       const amountM = money(transaction.amount, currency);

[NoCoverage] LogicalOperator
src/handlers/admin/reverseTransaction.mjs:65:24
       const wallet = transaction.wallet;
 
       // Calculate new balance based on original transaction type
-      const currency = wallet.currency || "USD";
+      const currency = wallet.currency && "USD";
       const balanceM = money(wallet.balance, currency);
       const amountM = money(transaction.amount, currency);

[NoCoverage] EqualityOperator
src/handlers/admin/reverseTransaction.mjs:71:11
 
       let newBalanceM;
       let reversalType;
-      if (transaction.type === "debit") {
+      if (transaction.type !== "debit") {
         // Debit was subtracted, so add it back
         newBalanceM = balanceM.add(amountM);

[NoCoverage] ConditionalExpression
src/handlers/admin/reverseTransaction.mjs:71:11
 
       let newBalanceM;
       let reversalType;
-      if (transaction.type === "debit") {
+      if (false) {
         // Debit was subtracted, so add it back
         newBalanceM = balanceM.add(amountM);

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:74:24
       if (transaction.type === "debit") {
         // Debit was subtracted, so add it back
         newBalanceM = balanceM.add(amountM);
-        reversalType = "credit";
+        reversalType = "";
       } else if (transaction.type === "credit") {
         // Credit was added, so subtract it

[NoCoverage] EqualityOperator
src/handlers/admin/reverseTransaction.mjs:75:18
         // Debit was subtracted, so add it back
         newBalanceM = balanceM.add(amountM);
         reversalType = "credit";
-      } else if (transaction.type === "credit") {
+      } else if (transaction.type !== "credit") {
         // Credit was added, so subtract it
         if (balanceM.lessThan(amountM)) {

[NoCoverage] ConditionalExpression
src/handlers/admin/reverseTransaction.mjs:75:18
         // Debit was subtracted, so add it back
         newBalanceM = balanceM.add(amountM);
         reversalType = "credit";
-      } else if (transaction.type === "credit") {
+      } else if (true) {
         // Credit was added, so subtract it
         if (balanceM.lessThan(amountM)) {

[NoCoverage] ConditionalExpression
src/handlers/admin/reverseTransaction.mjs:77:13
         reversalType = "credit";
       } else if (transaction.type === "credit") {
         // Credit was added, so subtract it
-        if (balanceM.lessThan(amountM)) {
+        if (false) {
           const err = new Error(
             "Insufficient balance to reverse credit transaction"

[NoCoverage] BlockStatement
src/handlers/admin/reverseTransaction.mjs:77:41
         reversalType = "credit";
       } else if (transaction.type === "credit") {
         // Credit was added, so subtract it
-        if (balanceM.lessThan(amountM)) {
-          const err = new Error(
-            "Insufficient balance to reverse credit transaction"
-          );
-          err.statusCode = 422;
-          err.code = "INSUFFICIENT_FUNDS";
-          throw err;
-        }
+        if (balanceM.lessThan(amountM)) {}
         newBalanceM = balanceM.subtract(amountM);
         reversalType = "debit";

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:79:13
         // Credit was added, so subtract it
         if (balanceM.lessThan(amountM)) {
           const err = new Error(
-            "Insufficient balance to reverse credit transaction"
+            ""
           );
           err.statusCode = 422;

[NoCoverage] BlockStatement
src/handlers/admin/reverseTransaction.mjs:87:14
         }
         newBalanceM = balanceM.subtract(amountM);
         reversalType = "debit";
-      } else {
-        const err = new Error("Cannot reverse this transaction type");
-        err.statusCode = 422;
-        err.code = "INVALID_TRANSACTION_TYPE";
-        throw err;
-      }
+      } else {}
 
       const newBalance = Number(newBalanceM.minor);

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:88:31
         newBalanceM = balanceM.subtract(amountM);
         reversalType = "debit";
       } else {
-        const err = new Error("Cannot reverse this transaction type");
+        const err = new Error("");
         err.statusCode = 422;
         err.code = "INVALID_TRANSACTION_TYPE";

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:97:35
       const newBalance = Number(newBalanceM.minor);
 
       // Update original transaction status
-      await tx.transaction.update({
-        where: { id },
-        data: { status: "reversed" },
-      });
+      await tx.transaction.update({});
 
       // Update wallet balance with optimistic locking

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:99:15
       // Update original transaction status
       await tx.transaction.update({
         where: { id },
-        data: { status: "reversed" },
+        data: {},
       });
 

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:103:52
       });
 
       // Update wallet balance with optimistic locking
-      const updatedWallet = await tx.wallet.update({
-        where: { id: wallet.id, version: wallet.version },
-        data: {
-          balance: newBalance,
-          version: { increment: 1 },
-        },
-      });
+      const updatedWallet = await tx.wallet.update({});
 
       // Create reversal transaction

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:104:16
 
       // Update wallet balance with optimistic locking
       const updatedWallet = await tx.wallet.update({
-        where: { id: wallet.id, version: wallet.version },
+        where: {},
         data: {
           balance: newBalance,

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:116:17
         data: {
           id: uuid(),
           walletId: wallet.id,
-          type: "reverse",
+          type: "",
           amount: transaction.amount,
           status: "completed",

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:143:7
     });
 
     logger.info(
-      {
-        adminId: req.user.id,
-        originalTxId: id,
-        reversalTxId: result.reversalTransaction.id,
-        amount: result.originalTransaction.amount,
-        reason,
-      },
+      {},
       "Transaction reversed by admin"
     );

[NoCoverage] StringLiteral
src/handlers/admin/reverseTransaction.mjs:150:7
         amount: result.originalTransaction.amount,
         reason,
       },
-      "Transaction reversed by admin"
+      ""
     );
 

[NoCoverage] BlockStatement
src/handlers/admin/reverseTransaction.mjs:179:17
         reason,
       },
     });
-  } catch (err) {
-    if (err.statusCode) {
-      return res.status(err.statusCode).json({
-        status: err.statusCode,
-        code: err.code,
-        error: err.message,
-      });
-    }
-
-    logger.error({ err, transactionId: req.params.id }, "Failed to reverse transaction");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to reverse transaction",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ObjectLiteral
src/handlers/admin/reverseTransaction.mjs:188:18
       });
     }
 
-    logger.error({ err, transactionId: req.params.id }, "Failed to reverse transaction");
+    logger.error({}, "Failed to reverse transaction");
     return res.status(500).json({
       status: 500,
