[NoCoverage] ObjectLiteral
src/handlers/auth/login.mjs:8:30
 } from "../../services/auth.service.mjs";
 import logger from "../../infra/logger.mjs";
 
-const loginSchema = z.object({
-  email: z.email("Invalid email format"),
-  password: z.string().min(1, "Password is required"),
-});
+const loginSchema = z.object({});
 
 /**

[NoCoverage] MethodExpression
src/handlers/auth/login.mjs:10:13
 
 const loginSchema = z.object({
   email: z.email("Invalid email format"),
-  password: z.string().min(1, "Password is required"),
+  password: z.string().max(1, "Password is required"),
 });
 

[NoCoverage] ConditionalExpression
src/handlers/auth/login.mjs:21:9
   try {
     const validation = loginSchema.safeParse(req.body);
 
-    if (!validation.success) {
+    if (true) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ConditionalExpression
src/handlers/auth/login.mjs:21:9
   try {
     const validation = loginSchema.safeParse(req.body);
 
-    if (!validation.success) {
+    if (false) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ObjectLiteral
src/handlers/auth/login.mjs:35:17
     const user = await authenticateUser({ email, password });
     const token = generateToken(user);
 
-    logger.info({ userId: user.id, email: user.email }, "User logged in");
+    logger.info({}, "User logged in");
 
     return res.status(200).json({

[NoCoverage] ObjectLiteral
src/handlers/auth/login.mjs:37:33
 
     logger.info({ userId: user.id, email: user.email }, "User logged in");
 
-    return res.status(200).json({
-      status: 200,
-      message: "Login successful",
-      data: {
-        user: {
-          id: user.id,
-          email: user.email,
-          role: user.role,
-        },
-        account: user.account
-          ? {
-              id: user.account.id,
-              status: user.account.status,
-            }
-          : null,
-        token,
-      },
-    });
+    return res.status(200).json({});
   } catch (err) {
     if (err.code === "INVALID_CREDENTIALS") {

[NoCoverage] BlockStatement
src/handlers/auth/login.mjs:55:17
         token,
       },
     });
-  } catch (err) {
-    if (err.code === "INVALID_CREDENTIALS") {
-      return res.status(401).json({
-        status: 401,
-        code: "INVALID_CREDENTIALS",
-        error: err.message,
-      });
-    }
-
-    if (err.code === "ACCOUNT_FROZEN") {
-      return res.status(403).json({
-        status: 403,
-        code: "ACCOUNT_FROZEN",
-        error: err.message,
-      });
-    }
-
-    logger.error({ err }, "Login failed");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Login failed",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
src/handlers/auth/login.mjs:56:45
       },
     });
   } catch (err) {
-    if (err.code === "INVALID_CREDENTIALS") {
-      return res.status(401).json({
-        status: 401,
-        code: "INVALID_CREDENTIALS",
-        error: err.message,
-      });
-    }
+    if (err.code === "INVALID_CREDENTIALS") {}
 
     if (err.code === "ACCOUNT_FROZEN") {

[NoCoverage] EqualityOperator
src/handlers/auth/login.mjs:56:9
       },
     });
   } catch (err) {
-    if (err.code === "INVALID_CREDENTIALS") {
+    if (err.code !== "INVALID_CREDENTIALS") {
       return res.status(401).json({
         status: 401,

[NoCoverage] ObjectLiteral
src/handlers/auth/login.mjs:57:35
     });
   } catch (err) {
     if (err.code === "INVALID_CREDENTIALS") {
-      return res.status(401).json({
-        status: 401,
-        code: "INVALID_CREDENTIALS",
-        error: err.message,
-      });
+      return res.status(401).json({});
     }
 

[NoCoverage] StringLiteral
src/handlers/auth/login.mjs:59:15
     if (err.code === "INVALID_CREDENTIALS") {
       return res.status(401).json({
         status: 401,
-        code: "INVALID_CREDENTIALS",
+        code: "",
         error: err.message,
       });

[NoCoverage] ConditionalExpression
src/handlers/auth/login.mjs:64:9
       });
     }
 
-    if (err.code === "ACCOUNT_FROZEN") {
+    if (true) {
       return res.status(403).json({
         status: 403,

[NoCoverage] ConditionalExpression
src/handlers/auth/login.mjs:64:9
       });
     }
 
-    if (err.code === "ACCOUNT_FROZEN") {
+    if (false) {
       return res.status(403).json({
         status: 403,

[NoCoverage] ObjectLiteral
src/handlers/auth/login.mjs:65:35
     }
 
     if (err.code === "ACCOUNT_FROZEN") {
-      return res.status(403).json({
-        status: 403,
-        code: "ACCOUNT_FROZEN",
-        error: err.message,
-      });
+      return res.status(403).json({});
     }
 

[NoCoverage] StringLiteral
src/handlers/auth/login.mjs:76:14
     return res.status(500).json({
       status: 500,
       code: "INTERNAL_ERROR",
-      error: "Login failed",
+      error: "",
     });
   }
