[NoCoverage] BooleanLiteral
src/handlers/wallets/getWallet.mjs:21:21
         account: {
           select: {
             id: true,
-            status: true,
+            status: false,
           },
         },

[NoCoverage] ObjectLiteral
src/handlers/wallets/getWallet.mjs:35:33
       });
     }
 
-    return res.status(200).json({
-      status: 200,
-      data: {
-        wallet: {
-          id: wallet.id,
-          currency: wallet.currency,
-          balance: wallet.balance,
-          createdAt: wallet.createdAt,
-        },
-        account: {
-          id: wallet.account.id,
-          status: wallet.account.status,
-        },
-      },
-    });
+    return res.status(200).json({});
   } catch (err) {
     logger.error({ err, walletId: req.params.id }, "Failed to get wallet");

[NoCoverage] ObjectLiteral
src/handlers/wallets/getWallet.mjs:38:17
     return res.status(200).json({
       status: 200,
       data: {
-        wallet: {
-          id: wallet.id,
-          currency: wallet.currency,
-          balance: wallet.balance,
-          createdAt: wallet.createdAt,
-        },
+        wallet: {},
         account: {
           id: wallet.account.id,

[NoCoverage] BlockStatement
src/handlers/wallets/getWallet.mjs:50:17
         },
       },
     });
-  } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to get wallet");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to get wallet",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] StringLiteral
src/handlers/wallets/getWallet.mjs:51:52
       },
     });
   } catch (err) {
-    logger.error({ err, walletId: req.params.id }, "Failed to get wallet");
+    logger.error({ err, walletId: req.params.id }, "");
     return res.status(500).json({
       status: 500,

[NoCoverage] StringLiteral
src/handlers/wallets/getWallet.mjs:55:14
     return res.status(500).json({
       status: 500,
       code: "INTERNAL_ERROR",
-      error: "Failed to get wallet",
+      error: "",
     });
   }
