[NoCoverage] ConditionalExpression
src/handlers/wallets/withdraw.mjs:23:9
 
     // Validate request body
     const validation = withdrawSchema.safeParse(req.body);
-    if (!validation.success) {
+    if (false) {
       return res.status(400).json({
         status: 400,

[NoCoverage] BooleanLiteral
src/handlers/wallets/withdraw.mjs:23:9
 
     // Validate request body
     const validation = withdrawSchema.safeParse(req.body);
-    if (!validation.success) {
+    if (validation.success) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ConditionalExpression
src/handlers/wallets/withdraw.mjs:54:11
       }
 
       // Check account is not frozen
-      if (wallet.account.status === "FROZEN") {
+      if (true) {
         const err = new Error("Account is frozen");
         err.statusCode = 403;

[NoCoverage] StringLiteral
src/handlers/wallets/withdraw.mjs:55:31
 
       // Check account is not frozen
       if (wallet.account.status === "FROZEN") {
-        const err = new Error("Account is frozen");
+        const err = new Error("");
         err.statusCode = 403;
         err.code = "ACCOUNT_FROZEN";

[NoCoverage] BlockStatement
src/handlers/wallets/withdraw.mjs:66:23
         where: { referenceId },
       });
 
-      if (existingTx) {
-        const err = new Error("Duplicate reference ID");
-        err.statusCode = 409;
-        err.code = "DUPLICATE_REFERENCE";
-        throw err;
-      }
+      if (existingTx) {}
 
       // Check sufficient balance

[NoCoverage] ConditionalExpression
src/handlers/wallets/withdraw.mjs:74:24
       }
 
       // Check sufficient balance
-      const currency = wallet.currency || "USD";
+      const currency = false;
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);

[NoCoverage] LogicalOperator
src/handlers/wallets/withdraw.mjs:74:24
       }
 
       // Check sufficient balance
-      const currency = wallet.currency || "USD";
+      const currency = wallet.currency && "USD";
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);

[NoCoverage] BlockStatement
src/handlers/wallets/withdraw.mjs:78:39
       const balanceM = money(wallet.balance, currency);
       const amountM = money(amount, currency);
 
-      if (balanceM.lessThan(amountM)) {
-        const err = new Error("Insufficient funds");
-        err.statusCode = 422;
-        err.code = "INSUFFICIENT_FUNDS";
-        throw err;
-      }
+      if (balanceM.lessThan(amountM)) {}
 
       const newBalanceM = balanceM.subtract(amountM);

[NoCoverage] StringLiteral
src/handlers/wallets/withdraw.mjs:79:31
       const amountM = money(amount, currency);
 
       if (balanceM.lessThan(amountM)) {
-        const err = new Error("Insufficient funds");
+        const err = new Error("");
         err.statusCode = 422;
         err.code = "INSUFFICIENT_FUNDS";

[NoCoverage] ObjectLiteral
src/handlers/wallets/withdraw.mjs:90:16
 
       // Debit the wallet with optimistic locking
       const updatedWallet = await tx.wallet.update({
-        where: { id, version: wallet.version },
+        where: {},
         data: {
           balance: newBalance,

[NoCoverage] StringLiteral
src/handlers/wallets/withdraw.mjs:102:17
         data: {
           id: uuid(),
           walletId: id,
-          type: "debit",
+          type: "",
           amount,
           status: "completed",

[NoCoverage] StringLiteral
src/handlers/wallets/withdraw.mjs:114:22
         data: {
           id: uuid(),
           transactionId: transaction.id,
-          direction: "debit",
+          direction: "",
           amount,
           balanceBefore: wallet.balance,

[NoCoverage] BlockStatement
src/handlers/wallets/withdraw.mjs:153:17
         },
       },
     });
-  } catch (err) {
-    if (err.statusCode) {
-      return res.status(err.statusCode).json({
-        status: err.statusCode,
-        code: err.code,
-        error: err.message,
-      });
-    }
-
-    logger.error({ err, walletId: req.params.id }, "Withdrawal failed");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Withdrawal failed",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ObjectLiteral
src/handlers/wallets/withdraw.mjs:155:46
     });
   } catch (err) {
     if (err.statusCode) {
-      return res.status(err.statusCode).json({
-        status: err.statusCode,
-        code: err.code,
-        error: err.message,
-      });
+      return res.status(err.statusCode).json({});
     }
 

[NoCoverage] ObjectLiteral
src/handlers/wallets/withdraw.mjs:162:18
       });
     }
 
-    logger.error({ err, walletId: req.params.id }, "Withdrawal failed");
+    logger.error({}, "Withdrawal failed");
     return res.status(500).json({
       status: 500,
