[NoCoverage] BlockStatement
src/handlers/auth/me.mjs:12:16
   try {
     const user = await getUserById(req.user.id);
 
-    if (!user) {
-      return res.status(404).json({
-        status: 404,
-        code: "USER_NOT_FOUND",
-        error: "User not found",
-      });
-    }
+    if (!user) {}
 
     return res.status(200).json({

[NoCoverage] StringLiteral
src/handlers/auth/me.mjs:16:16
       return res.status(404).json({
         status: 404,
         code: "USER_NOT_FOUND",
-        error: "User not found",
+        error: "",
       });
     }

[NoCoverage] ArrowFunction
src/handlers/auth/me.mjs:38:37
             }
           : null,
         wallets:
-          user.account?.wallets.map((w) => ({
-            id: w.id,
-            currency: w.currency,
-            balance: w.balance,
-            createdAt: w.createdAt,
-          })) || [],
+          user.account?.wallets.map(() => undefined) || [],
       },
     });

[NoCoverage] LogicalOperator
src/handlers/auth/me.mjs:38:11
             }
           : null,
         wallets:
-          user.account?.wallets.map((w) => ({
-            id: w.id,
-            currency: w.currency,
-            balance: w.balance,
-            createdAt: w.createdAt,
-          })) || [],
+          user.account?.wallets.map(w => ({
+  id: w.id,
+  currency: w.currency,
+  balance: w.balance,
+  createdAt: w.createdAt
+})) && [],
       },
     });

[NoCoverage] ArrayDeclaration
src/handlers/auth/me.mjs:43:18
             currency: w.currency,
             balance: w.balance,
             createdAt: w.createdAt,
-          })) || [],
+          })) || ["Stryker was here"],
       },
     });

[NoCoverage] BlockStatement
src/handlers/auth/me.mjs:46:17
           })) || [],
       },
     });
-  } catch (err) {
-    logger.error({ err, userId: req.user?.id }, "Failed to get user profile");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Failed to get user profile",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] OptionalChaining
src/handlers/auth/me.mjs:47:33
       },
     });
   } catch (err) {
-    logger.error({ err, userId: req.user?.id }, "Failed to get user profile");
+    logger.error({ err, userId: req.user.id }, "Failed to get user profile");
     return res.status(500).json({
       status: 500,
