[NoCoverage] ObjectLiteral
src/infra/alerting.mjs:12:23
 const alertState = new Map();
 
 // Default alert configuration (uses environment variables with fallbacks)
-const defaultConfig = {
-  // Error rate threshold (errors per minute)
-  errorRateThreshold: parseInt(process.env.ALERT_ERROR_RATE_THRESHOLD || "10", 10),
-
-  // High latency threshold (ms)
-  latencyThreshold: parseInt(process.env.ALERT_LATENCY_THRESHOLD || "5000", 10),
-
-  // Failed auth threshold (failures per minute)
-  authFailureThreshold: parseInt(process.env.ALERT_AUTH_FAILURE_THRESHOLD || "20", 10),
-
-  // Alert cooldown period (ms) - prevent duplicate alerts
-  cooldownPeriod: parseInt(process.env.ALERT_COOLDOWN_MS || "300000", 10),
-
-  // Channels to send alerts to
-  channels: (process.env.ALERT_CHANNELS || "log").split(","),
-
-  // Webhook URL for external alerting (e.g., Slack, PagerDuty)
-  webhookUrl: process.env.ALERT_WEBHOOK_URL,
-};
+const defaultConfig = {};
 
 let config = { ...defaultConfig };

[NoCoverage] LogicalOperator
src/infra/alerting.mjs:14:32
 // Default alert configuration (uses environment variables with fallbacks)
 const defaultConfig = {
   // Error rate threshold (errors per minute)
-  errorRateThreshold: parseInt(process.env.ALERT_ERROR_RATE_THRESHOLD || "10", 10),
+  errorRateThreshold: parseInt(process.env.ALERT_ERROR_RATE_THRESHOLD && "10", 10),
 
   // High latency threshold (ms)

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:14:32
 // Default alert configuration (uses environment variables with fallbacks)
 const defaultConfig = {
   // Error rate threshold (errors per minute)
-  errorRateThreshold: parseInt(process.env.ALERT_ERROR_RATE_THRESHOLD || "10", 10),
+  errorRateThreshold: parseInt(false, 10),
 
   // High latency threshold (ms)

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:17:30
   errorRateThreshold: parseInt(process.env.ALERT_ERROR_RATE_THRESHOLD || "10", 10),
 
   // High latency threshold (ms)
-  latencyThreshold: parseInt(process.env.ALERT_LATENCY_THRESHOLD || "5000", 10),
+  latencyThreshold: parseInt(true, 10),
 
   // Failed auth threshold (failures per minute)

[NoCoverage] LogicalOperator
src/infra/alerting.mjs:17:30
   errorRateThreshold: parseInt(process.env.ALERT_ERROR_RATE_THRESHOLD || "10", 10),
 
   // High latency threshold (ms)
-  latencyThreshold: parseInt(process.env.ALERT_LATENCY_THRESHOLD || "5000", 10),
+  latencyThreshold: parseInt(process.env.ALERT_LATENCY_THRESHOLD && "5000", 10),
 
   // Failed auth threshold (failures per minute)

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:20:34
   latencyThreshold: parseInt(process.env.ALERT_LATENCY_THRESHOLD || "5000", 10),
 
   // Failed auth threshold (failures per minute)
-  authFailureThreshold: parseInt(process.env.ALERT_AUTH_FAILURE_THRESHOLD || "20", 10),
+  authFailureThreshold: parseInt(true, 10),
 
   // Alert cooldown period (ms) - prevent duplicate alerts

[NoCoverage] LogicalOperator
src/infra/alerting.mjs:20:34
   latencyThreshold: parseInt(process.env.ALERT_LATENCY_THRESHOLD || "5000", 10),
 
   // Failed auth threshold (failures per minute)
-  authFailureThreshold: parseInt(process.env.ALERT_AUTH_FAILURE_THRESHOLD || "20", 10),
+  authFailureThreshold: parseInt(process.env.ALERT_AUTH_FAILURE_THRESHOLD && "20", 10),
 
   // Alert cooldown period (ms) - prevent duplicate alerts

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:23:28
   authFailureThreshold: parseInt(process.env.ALERT_AUTH_FAILURE_THRESHOLD || "20", 10),
 
   // Alert cooldown period (ms) - prevent duplicate alerts
-  cooldownPeriod: parseInt(process.env.ALERT_COOLDOWN_MS || "300000", 10),
+  cooldownPeriod: parseInt(true, 10),
 
   // Channels to send alerts to

[NoCoverage] LogicalOperator
src/infra/alerting.mjs:23:28
   authFailureThreshold: parseInt(process.env.ALERT_AUTH_FAILURE_THRESHOLD || "20", 10),
 
   // Alert cooldown period (ms) - prevent duplicate alerts
-  cooldownPeriod: parseInt(process.env.ALERT_COOLDOWN_MS || "300000", 10),
+  cooldownPeriod: parseInt(process.env.ALERT_COOLDOWN_MS && "300000", 10),
 
   // Channels to send alerts to

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:26:14
   cooldownPeriod: parseInt(process.env.ALERT_COOLDOWN_MS || "300000", 10),
 
   // Channels to send alerts to
-  channels: (process.env.ALERT_CHANNELS || "log").split(","),
+  channels: (true).split(","),
 
   // Webhook URL for external alerting (e.g., Slack, PagerDuty)

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:26:14
   cooldownPeriod: parseInt(process.env.ALERT_COOLDOWN_MS || "300000", 10),
 
   // Channels to send alerts to
-  channels: (process.env.ALERT_CHANNELS || "log").split(","),
+  channels: (false).split(","),
 
   // Webhook URL for external alerting (e.g., Slack, PagerDuty)

[NoCoverage] BlockStatement
src/infra/alerting.mjs:38:41
  * Update alerting configuration
  * @param {object} newConfig - New configuration values
  */
-export const configure = (newConfig) => {
-  config = { ...config, ...newConfig };
-};
+export const configure = (newConfig) => {};
 
 /**

[NoCoverage] ObjectLiteral
src/infra/alerting.mjs:39:12
  * @param {object} newConfig - New configuration values
  */
 export const configure = (newConfig) => {
-  config = { ...config, ...newConfig };
+  config = {};
 };
 

[NoCoverage] StringLiteral
src/infra/alerting.mjs:47:12
  */
 export const AlertSeverity = {
   INFO: "info",
-  WARNING: "warning",
+  WARNING: "",
   CRITICAL: "critical",
 };

[NoCoverage] ObjectLiteral
src/infra/alerting.mjs:54:26
 /**
  * Alert types
  */
-export const AlertType = {
-  HIGH_ERROR_RATE: "high_error_rate",
-  HIGH_LATENCY: "high_latency",
-  AUTH_FAILURE_SPIKE: "auth_failure_spike",
-  DATABASE_ERROR: "database_error",
-  REDIS_ERROR: "redis_error",
-  TRANSACTION_FAILURE: "transaction_failure",
-  SIGNATURE_ATTACK: "signature_attack",
-  INSUFFICIENT_FUNDS_SPIKE: "insufficient_funds_spike",
-  SERVICE_DEGRADATION: "service_degradation",
-};
+export const AlertType = {};
 
 /**

[NoCoverage] StringLiteral
src/infra/alerting.mjs:60:24
   AUTH_FAILURE_SPIKE: "auth_failure_spike",
   DATABASE_ERROR: "database_error",
   REDIS_ERROR: "redis_error",
-  TRANSACTION_FAILURE: "transaction_failure",
+  TRANSACTION_FAILURE: "",
   SIGNATURE_ATTACK: "signature_attack",
   INSUFFICIENT_FUNDS_SPIKE: "insufficient_funds_spike",

[NoCoverage] StringLiteral
src/infra/alerting.mjs:61:21
   DATABASE_ERROR: "database_error",
   REDIS_ERROR: "redis_error",
   TRANSACTION_FAILURE: "transaction_failure",
-  SIGNATURE_ATTACK: "signature_attack",
+  SIGNATURE_ATTACK: "",
   INSUFFICIENT_FUNDS_SPIKE: "insufficient_funds_spike",
   SERVICE_DEGRADATION: "service_degradation",

[NoCoverage] StringLiteral
src/infra/alerting.mjs:62:29
   REDIS_ERROR: "redis_error",
   TRANSACTION_FAILURE: "transaction_failure",
   SIGNATURE_ATTACK: "signature_attack",
-  INSUFFICIENT_FUNDS_SPIKE: "insufficient_funds_spike",
+  INSUFFICIENT_FUNDS_SPIKE: "",
   SERVICE_DEGRADATION: "service_degradation",
 };

[NoCoverage] StringLiteral
src/infra/alerting.mjs:63:24
   TRANSACTION_FAILURE: "transaction_failure",
   SIGNATURE_ATTACK: "signature_attack",
   INSUFFICIENT_FUNDS_SPIKE: "insufficient_funds_spike",
-  SERVICE_DEGRADATION: "service_degradation",
+  SERVICE_DEGRADATION: "",
 };
 

[NoCoverage] BlockStatement
src/infra/alerting.mjs:71:36
  * @param {string} alertKey - Unique alert identifier
  * @returns {boolean} True if in cooldown
  */
-const isInCooldown = (alertKey) => {
-  const lastAlert = alertState.get(alertKey);
-  if (!lastAlert) return false;
-  return Date.now() - lastAlert < config.cooldownPeriod;
-};
+const isInCooldown = (alertKey) => {};
 
 /**

[NoCoverage] BooleanLiteral
src/infra/alerting.mjs:73:7
  */
 const isInCooldown = (alertKey) => {
   const lastAlert = alertState.get(alertKey);
-  if (!lastAlert) return false;
+  if (lastAlert) return false;
   return Date.now() - lastAlert < config.cooldownPeriod;
 };

[NoCoverage] BooleanLiteral
src/infra/alerting.mjs:73:26
  */
 const isInCooldown = (alertKey) => {
   const lastAlert = alertState.get(alertKey);
-  if (!lastAlert) return false;
+  if (!lastAlert) return true;
   return Date.now() - lastAlert < config.cooldownPeriod;
 };

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:74:10
 const isInCooldown = (alertKey) => {
   const lastAlert = alertState.get(alertKey);
   if (!lastAlert) return false;
-  return Date.now() - lastAlert < config.cooldownPeriod;
+  return false;
 };
 

[NoCoverage] ArithmeticOperator
src/infra/alerting.mjs:74:10
 const isInCooldown = (alertKey) => {
   const lastAlert = alertState.get(alertKey);
   if (!lastAlert) return false;
-  return Date.now() - lastAlert < config.cooldownPeriod;
+  return Date.now() + lastAlert < config.cooldownPeriod;
 };
 

[NoCoverage] BlockStatement
src/infra/alerting.mjs:81:35
  * Record alert timestamp
  * @param {string} alertKey - Unique alert identifier
  */
-const recordAlert = (alertKey) => {
-  alertState.set(alertKey, Date.now());
-};
+const recordAlert = (alertKey) => {};
 
 /**

[NoCoverage] BlockStatement
src/infra/alerting.mjs:89:41
  * Send alert to configured channels
  * @param {object} alert - Alert object
  */
-const sendToChannels = async (alert) => {
-  for (const channel of config.channels) {
-    switch (channel) {
-      case "log":
-        sendToLog(alert);
-        break;
-      case "webhook":
-        await sendToWebhook(alert);
-        break;
-      case "email":
-        // Placeholder for email integration
-        logger.debug({ alert }, "Email alerting not implemented");
-        break;
-    }
-  }
-};
+const sendToChannels = async (alert) => {};
 
 /**

[NoCoverage] BlockStatement
src/infra/alerting.mjs:90:42
  * @param {object} alert - Alert object
  */
 const sendToChannels = async (alert) => {
-  for (const channel of config.channels) {
-    switch (channel) {
-      case "log":
-        sendToLog(alert);
-        break;
-      case "webhook":
-        await sendToWebhook(alert);
-        break;
-      case "email":
-        // Placeholder for email integration
-        logger.debug({ alert }, "Email alerting not implemented");
-        break;
-    }
-  }
+  for (const channel of config.channels) {}
 };
 

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:92:7
 const sendToChannels = async (alert) => {
   for (const channel of config.channels) {
     switch (channel) {
-      case "log":
-        sendToLog(alert);
-        break;
+      case "log":
       case "webhook":
         await sendToWebhook(alert);

[NoCoverage] StringLiteral
src/infra/alerting.mjs:92:12
 const sendToChannels = async (alert) => {
   for (const channel of config.channels) {
     switch (channel) {
-      case "log":
+      case "":
         sendToLog(alert);
         break;

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:95:7
       case "log":
         sendToLog(alert);
         break;
-      case "webhook":
-        await sendToWebhook(alert);
-        break;
+      case "webhook":
       case "email":
         // Placeholder for email integration

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:98:7
       case "webhook":
         await sendToWebhook(alert);
         break;
-      case "email":
-        // Placeholder for email integration
-        logger.debug({ alert }, "Email alerting not implemented");
-        break;
+      case "email":
     }
   }

[NoCoverage] StringLiteral
src/infra/alerting.mjs:100:33
         break;
       case "email":
         // Placeholder for email integration
-        logger.debug({ alert }, "Email alerting not implemented");
+        logger.debug({ alert }, "");
         break;
     }

[NoCoverage] ObjectLiteral
src/infra/alerting.mjs:100:22
         break;
       case "email":
         // Placeholder for email integration
-        logger.debug({ alert }, "Email alerting not implemented");
+        logger.debug({}, "Email alerting not implemented");
         break;
     }

[NoCoverage] BlockStatement
src/infra/alerting.mjs:109:30
 /**
  * Send alert to logger
  */
-const sendToLog = (alert) => {
-  const logLevel = alert.severity === AlertSeverity.CRITICAL ? "error" : "warn";
-  logger[logLevel](
-    {
-      alertType: alert.type,
-      alertSeverity: alert.severity,
-      alertTitle: alert.title,
-      alertDetails: alert.details,
-      alertTimestamp: alert.timestamp,
-    },
-    `🚨 ALERT: ${alert.title}`
-  );
-};
+const sendToLog = (alert) => {};
 
 /**

[NoCoverage] EqualityOperator
src/infra/alerting.mjs:110:20
  * Send alert to logger
  */
 const sendToLog = (alert) => {
-  const logLevel = alert.severity === AlertSeverity.CRITICAL ? "error" : "warn";
+  const logLevel = alert.severity !== AlertSeverity.CRITICAL ? "error" : "warn";
   logger[logLevel](
     {

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:110:20
  * Send alert to logger
  */
 const sendToLog = (alert) => {
-  const logLevel = alert.severity === AlertSeverity.CRITICAL ? "error" : "warn";
+  const logLevel = false ? "error" : "warn";
   logger[logLevel](
     {

[NoCoverage] BlockStatement
src/infra/alerting.mjs:127:27
  * Send alert to webhook (Slack, PagerDuty, etc.)
  */
 const sendToWebhook = async (alert) => {
-  if (!config.webhookUrl) {
-    logger.debug("Webhook URL not configured, skipping webhook alert");
-    return;
-  }
+  if (!config.webhookUrl) {}
 
   try {

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:127:7
  * Send alert to webhook (Slack, PagerDuty, etc.)
  */
 const sendToWebhook = async (alert) => {
-  if (!config.webhookUrl) {
+  if (false) {
     logger.debug("Webhook URL not configured, skipping webhook alert");
     return;

[NoCoverage] StringLiteral
src/infra/alerting.mjs:128:18
  */
 const sendToWebhook = async (alert) => {
   if (!config.webhookUrl) {
-    logger.debug("Webhook URL not configured, skipping webhook alert");
+    logger.debug("");
     return;
   }

[NoCoverage] MethodExpression
src/infra/alerting.mjs:134:20
 
   try {
     const payload = {
-      text: `🚨 *${alert.severity.toUpperCase()}*: ${alert.title}`,
+      text: `🚨 *${aalert.severity.toLowerCase()*: ${alert.title}`,
       attachments: [
         {

[NoCoverage] EqualityOperator
src/infra/alerting.mjs:138:13
       attachments: [
         {
           color:
-            alert.severity === AlertSeverity.CRITICAL ? "danger" : "warning",
+            alert.severity !== AlertSeverity.CRITICAL ? "danger" : "warning",
           fields: [
             { title: "Type", value: alert.type, short: true },

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:138:13
       attachments: [
         {
           color:
-            alert.severity === AlertSeverity.CRITICAL ? "danger" : "warning",
+            false ? "danger" : "warning",
           fields: [
             { title: "Type", value: alert.type, short: true },

[NoCoverage] BooleanLiteral
src/infra/alerting.mjs:140:56
           color:
             alert.severity === AlertSeverity.CRITICAL ? "danger" : "warning",
           fields: [
-            { title: "Type", value: alert.type, short: true },
+            { title: "Type", value: alert.type, short: false },
             { title: "Severity", value: alert.severity, short: true },
             { title: "Details", value: JSON.stringify(alert.details, null, 2) },

[NoCoverage] ObjectLiteral
src/infra/alerting.mjs:140:13
           color:
             alert.severity === AlertSeverity.CRITICAL ? "danger" : "warning",
           fields: [
-            { title: "Type", value: alert.type, short: true },
+            {},
             { title: "Severity", value: alert.severity, short: true },
             { title: "Details", value: JSON.stringify(alert.details, null, 2) },

[NoCoverage] BooleanLiteral
src/infra/alerting.mjs:141:64
             alert.severity === AlertSeverity.CRITICAL ? "danger" : "warning",
           fields: [
             { title: "Type", value: alert.type, short: true },
-            { title: "Severity", value: alert.severity, short: true },
+            { title: "Severity", value: alert.severity, short: false },
             { title: "Details", value: JSON.stringify(alert.details, null, 2) },
             { title: "Timestamp", value: alert.timestamp, short: true },

[NoCoverage] StringLiteral
src/infra/alerting.mjs:141:22
             alert.severity === AlertSeverity.CRITICAL ? "danger" : "warning",
           fields: [
             { title: "Type", value: alert.type, short: true },
-            { title: "Severity", value: alert.severity, short: true },
+            { title: "", value: alert.severity, short: true },
             { title: "Details", value: JSON.stringify(alert.details, null, 2) },
             { title: "Timestamp", value: alert.timestamp, short: true },

[NoCoverage] ObjectLiteral
src/infra/alerting.mjs:142:13
           fields: [
             { title: "Type", value: alert.type, short: true },
             { title: "Severity", value: alert.severity, short: true },
-            { title: "Details", value: JSON.stringify(alert.details, null, 2) },
+            {},
             { title: "Timestamp", value: alert.timestamp, short: true },
           ],

[NoCoverage] BooleanLiteral
src/infra/alerting.mjs:143:66
             { title: "Type", value: alert.type, short: true },
             { title: "Severity", value: alert.severity, short: true },
             { title: "Details", value: JSON.stringify(alert.details, null, 2) },
-            { title: "Timestamp", value: alert.timestamp, short: true },
+            { title: "Timestamp", value: alert.timestamp, short: false },
           ],
         },

[NoCoverage] StringLiteral
src/infra/alerting.mjs:143:22
             { title: "Type", value: alert.type, short: true },
             { title: "Severity", value: alert.severity, short: true },
             { title: "Details", value: JSON.stringify(alert.details, null, 2) },
-            { title: "Timestamp", value: alert.timestamp, short: true },
+            { title: "", value: alert.timestamp, short: true },
           ],
         },

[NoCoverage] StringLiteral
src/infra/alerting.mjs:150:15
     };
 
     const response = await fetch(config.webhookUrl, {
-      method: "POST",
+      method: "",
       headers: { "Content-Type": "application/json" },
       body: JSON.stringify(payload),

[NoCoverage] BlockStatement
src/infra/alerting.mjs:155:23
       body: JSON.stringify(payload),
     });
 
-    if (!response.ok) {
-      logger.error({ status: response.status }, "Failed to send webhook alert");
-    }
+    if (!response.ok) {}
   } catch (error) {
     logger.error({ error: error.message }, "Error sending webhook alert");

[NoCoverage] BlockStatement
src/infra/alerting.mjs:158:19
     if (!response.ok) {
       logger.error({ status: response.status }, "Failed to send webhook alert");
     }
-  } catch (error) {
-    logger.error({ error: error.message }, "Error sending webhook alert");
-  }
+  } catch (error) {}
 };
 

[NoCoverage] StringLiteral
src/infra/alerting.mjs:159:44
       logger.error({ status: response.status }, "Failed to send webhook alert");
     }
   } catch (error) {
-    logger.error({ error: error.message }, "Error sending webhook alert");
+    logger.error({ error: error.message }, "");
   }
 };

[NoCoverage] BlockStatement
src/infra/alerting.mjs:177:6
   title,
   details = {},
   dedupeKey = null
-) => {
-  const alertKey = dedupeKey || `${type}:${JSON.stringify(details)}`;
-
-  // Check cooldown
-  if (isInCooldown(alertKey)) {
-    logger.debug({ alertKey }, "Alert suppressed (in cooldown)");
-    return false;
-  }
-
-  const alert = {
-    type,
-    severity,
-    title,
-    details,
-    timestamp: new Date().toISOString(),
-    alertKey,
-  };
-
-  // Record and send
-  recordAlert(alertKey);
-  await sendToChannels(alert);
-
-  return true;
-};
+) => {};
 
 // ============================================================================

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:178:20
   details = {},
   dedupeKey = null
 ) => {
-  const alertKey = dedupeKey || `${type}:${JSON.stringify(details)}`;
+  const alertKey = true;
 
   // Check cooldown

[NoCoverage] LogicalOperator
src/infra/alerting.mjs:178:20
   details = {},
   dedupeKey = null
 ) => {
-  const alertKey = dedupeKey || `${type}:${JSON.stringify(details)}`;
+  const alertKey = dedupeKey && `${type}:${JSON.stringify(details)}`;
 
   // Check cooldown

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:181:7
   const alertKey = dedupeKey || `${type}:${JSON.stringify(details)}`;
 
   // Check cooldown
-  if (isInCooldown(alertKey)) {
+  if (true) {
     logger.debug({ alertKey }, "Alert suppressed (in cooldown)");
     return false;

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:181:7
   const alertKey = dedupeKey || `${type}:${JSON.stringify(details)}`;
 
   // Check cooldown
-  if (isInCooldown(alertKey)) {
+  if (false) {
     logger.debug({ alertKey }, "Alert suppressed (in cooldown)");
     return false;

[NoCoverage] BooleanLiteral
src/infra/alerting.mjs:183:12
   // Check cooldown
   if (isInCooldown(alertKey)) {
     logger.debug({ alertKey }, "Alert suppressed (in cooldown)");
-    return false;
+    return true;
   }
 

[NoCoverage] BlockStatement
src/infra/alerting.mjs:213:6
   errorCount,
   timeWindowMs,
   details = {}
-) => {
-  const rate = errorCount / (timeWindowMs / 60000); // errors per minute
-
-  if (rate >= config.errorRateThreshold) {
-    await triggerAlert(
-      AlertType.HIGH_ERROR_RATE,
-      rate >= config.errorRateThreshold * 2
-        ? AlertSeverity.CRITICAL
-        : AlertSeverity.WARNING,
-      `High error rate detected: ${rate.toFixed(1)} errors/min`,
-      { errorCount, timeWindowMs, rate, ...details },
-      AlertType.HIGH_ERROR_RATE
-    );
-  }
-};
+) => {};
 
 /**

[NoCoverage] ArithmeticOperator
src/infra/alerting.mjs:214:16
   timeWindowMs,
   details = {}
 ) => {
-  const rate = errorCount / (timeWindowMs / 60000); // errors per minute
+  const rate = errorCount * (timeWindowMs / 60000); // errors per minute
 
   if (rate >= config.errorRateThreshold) {

[NoCoverage] ArithmeticOperator
src/infra/alerting.mjs:214:30
   timeWindowMs,
   details = {}
 ) => {
-  const rate = errorCount / (timeWindowMs / 60000); // errors per minute
+  const rate = errorCount / (timeWindowMs * 60000); // errors per minute
 
   if (rate >= config.errorRateThreshold) {

[NoCoverage] BlockStatement
src/infra/alerting.mjs:216:42
 ) => {
   const rate = errorCount / (timeWindowMs / 60000); // errors per minute
 
-  if (rate >= config.errorRateThreshold) {
-    await triggerAlert(
-      AlertType.HIGH_ERROR_RATE,
-      rate >= config.errorRateThreshold * 2
-        ? AlertSeverity.CRITICAL
-        : AlertSeverity.WARNING,
-      `High error rate detected: ${rate.toFixed(1)} errors/min`,
-      { errorCount, timeWindowMs, rate, ...details },
-      AlertType.HIGH_ERROR_RATE
-    );
-  }
+  if (rate >= config.errorRateThreshold) {}
 };
 

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:216:7
 ) => {
   const rate = errorCount / (timeWindowMs / 60000); // errors per minute
 
-  if (rate >= config.errorRateThreshold) {
+  if (true) {
     await triggerAlert(
       AlertType.HIGH_ERROR_RATE,

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:219:7
   if (rate >= config.errorRateThreshold) {
     await triggerAlert(
       AlertType.HIGH_ERROR_RATE,
-      rate >= config.errorRateThreshold * 2
+      true
         ? AlertSeverity.CRITICAL
         : AlertSeverity.WARNING,

[NoCoverage] ArithmeticOperator
src/infra/alerting.mjs:219:15
   if (rate >= config.errorRateThreshold) {
     await triggerAlert(
       AlertType.HIGH_ERROR_RATE,
-      rate >= config.errorRateThreshold * 2
+      rate >= config.errorRateThreshold / 2
         ? AlertSeverity.CRITICAL
         : AlertSeverity.WARNING,

[NoCoverage] StringLiteral
src/infra/alerting.mjs:222:7
       rate >= config.errorRateThreshold * 2
         ? AlertSeverity.CRITICAL
         : AlertSeverity.WARNING,
-      `High error rate detected: ${rate.toFixed(1)} errors/min`,
+      ``,
       { errorCount, timeWindowMs, rate, ...details },
       AlertType.HIGH_ERROR_RATE

[NoCoverage] BlockStatement
src/infra/alerting.mjs:232:78
 /**
  * Alert on high latency
  */
-export const alertHighLatency = async (latencyMs, endpoint, details = {}) => {
-  if (latencyMs >= config.latencyThreshold) {
-    await triggerAlert(
-      AlertType.HIGH_LATENCY,
-      latencyMs >= config.latencyThreshold * 2
-        ? AlertSeverity.CRITICAL
-        : AlertSeverity.WARNING,
-      `High latency detected on ${endpoint}: ${latencyMs}ms`,
-      { latencyMs, endpoint, ...details }
-    );
-  }
-};
+export const alertHighLatency = async (latencyMs, endpoint, details = {}) => {};
 
 /**

[NoCoverage] EqualityOperator
src/infra/alerting.mjs:233:7
  * Alert on high latency
  */
 export const alertHighLatency = async (latencyMs, endpoint, details = {}) => {
-  if (latencyMs >= config.latencyThreshold) {
+  if (latencyMs < config.latencyThreshold) {
     await triggerAlert(
       AlertType.HIGH_LATENCY,

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:233:7
  * Alert on high latency
  */
 export const alertHighLatency = async (latencyMs, endpoint, details = {}) => {
-  if (latencyMs >= config.latencyThreshold) {
+  if (true) {
     await triggerAlert(
       AlertType.HIGH_LATENCY,

[NoCoverage] EqualityOperator
src/infra/alerting.mjs:236:7
   if (latencyMs >= config.latencyThreshold) {
     await triggerAlert(
       AlertType.HIGH_LATENCY,
-      latencyMs >= config.latencyThreshold * 2
+      latencyMs < config.latencyThreshold * 2
         ? AlertSeverity.CRITICAL
         : AlertSeverity.WARNING,

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:236:7
   if (latencyMs >= config.latencyThreshold) {
     await triggerAlert(
       AlertType.HIGH_LATENCY,
-      latencyMs >= config.latencyThreshold * 2
+      false
         ? AlertSeverity.CRITICAL
         : AlertSeverity.WARNING,

[NoCoverage] BlockStatement
src/infra/alerting.mjs:252:6
   failureCount,
   timeWindowMs,
   details = {}
-) => {
-  const rate = failureCount / (timeWindowMs / 60000);
-
-  if (rate >= config.authFailureThreshold) {
-    await triggerAlert(
-      AlertType.AUTH_FAILURE_SPIKE,
-      AlertSeverity.CRITICAL,
-      `Authentication failure spike: ${rate.toFixed(1)} failures/min`,
-      { failureCount, timeWindowMs, rate, ...details },
-      AlertType.AUTH_FAILURE_SPIKE
-    );
-  }
-};
+) => {};
 
 /**

[NoCoverage] ArithmeticOperator
src/infra/alerting.mjs:253:16
   timeWindowMs,
   details = {}
 ) => {
-  const rate = failureCount / (timeWindowMs / 60000);
+  const rate = failureCount * (timeWindowMs / 60000);
 
   if (rate >= config.authFailureThreshold) {

[NoCoverage] ArithmeticOperator
src/infra/alerting.mjs:253:32
   timeWindowMs,
   details = {}
 ) => {
-  const rate = failureCount / (timeWindowMs / 60000);
+  const rate = failureCount / (timeWindowMs * 60000);
 
   if (rate >= config.authFailureThreshold) {

[NoCoverage] ConditionalExpression
src/infra/alerting.mjs:255:7
 ) => {
   const rate = failureCount / (timeWindowMs / 60000);
 
-  if (rate >= config.authFailureThreshold) {
+  if (false) {
     await triggerAlert(
       AlertType.AUTH_FAILURE_SPIKE,

[NoCoverage] EqualityOperator
src/infra/alerting.mjs:255:7
 ) => {
   const rate = failureCount / (timeWindowMs / 60000);
 
-  if (rate >= config.authFailureThreshold) {
+  if (rate > config.authFailureThreshold) {
     await triggerAlert(
       AlertType.AUTH_FAILURE_SPIKE,

[NoCoverage] BlockStatement
src/infra/alerting.mjs:269:77
 /**
  * Alert on database errors
  */
-export const alertDatabaseError = async (error, operation, details = {}) => {
-  await triggerAlert(
-    AlertType.DATABASE_ERROR,
-    AlertSeverity.CRITICAL,
-    `Database error during ${operation}`,
-    { error: error.message, operation, ...details }
-  );
-};
+export const alertDatabaseError = async (error, operation, details = {}) => {};
 
 /**

[NoCoverage] StringLiteral
src/infra/alerting.mjs:273:5
   await triggerAlert(
     AlertType.DATABASE_ERROR,
     AlertSeverity.CRITICAL,
-    `Database error during ${operation}`,
+    ``,
     { error: error.message, operation, ...details }
   );

[NoCoverage] BlockStatement
src/infra/alerting.mjs:281:74
 /**
  * Alert on Redis errors
  */
-export const alertRedisError = async (error, operation, details = {}) => {
-  await triggerAlert(
-    AlertType.REDIS_ERROR,
-    AlertSeverity.WARNING,
-    `Redis error during ${operation}`,
-    { error: error.message, operation, ...details }
-  );
-};
+export const alertRedisError = async (error, operation, details = {}) => {};
 
 /**

[NoCoverage] StringLiteral
src/infra/alerting.mjs:285:5
   await triggerAlert(
     AlertType.REDIS_ERROR,
     AlertSeverity.WARNING,
-    `Redis error during ${operation}`,
+    ``,
     { error: error.message, operation, ...details }
   );

[NoCoverage] BlockStatement
src/infra/alerting.mjs:297:6
   transactionType,
   reason,
   details = {}
-) => {
-  await triggerAlert(
-    AlertType.TRANSACTION_FAILURE,
-    AlertSeverity.WARNING,
-    `Transaction failure: ${transactionType} - ${reason}`,
-    { transactionType, reason, ...details }
-  );
-};
+) => {};
 
 /**

[NoCoverage] BlockStatement
src/infra/alerting.mjs:313:6
   sourceIp,
   failureCount,
   details = {}
-) => {
-  await triggerAlert(
-    AlertType.SIGNATURE_ATTACK,
-    AlertSeverity.CRITICAL,
-    `Potential signature attack from ${sourceIp}`,
-    { sourceIp, failureCount, ...details },
-    `signature_attack:${sourceIp}`
-  );
-};
+) => {};
 
 /**
