[NoCoverage] StringLiteral
src/handlers/auth/register.mjs:6:18
 import logger from "../../infra/logger.mjs";
 
 const registerSchema = z.object({
-  email: z.email("Invalid email format"),
+  email: z.email(""),
   password: z
     .string()

[NoCoverage] MethodExpression
src/handlers/auth/register.mjs:7:13
 
 const registerSchema = z.object({
   email: z.email("Invalid email format"),
-  password: z
-    .string()
-    .min(8, "Password must be at least 8 characters")
-    .max(128, "Password must be at most 128 characters"),
+  password: z.string().min(8, "Password must be at least 8 characters").min(128, "Password must be at most 128 characters"),
   currency: z.string().length(3).optional().default("USD"),
 });

[NoCoverage] MethodExpression
src/handlers/auth/register.mjs:7:13
 
 const registerSchema = z.object({
   email: z.email("Invalid email format"),
-  password: z
-    .string()
-    .min(8, "Password must be at least 8 characters")
+  password: z.string().max(8, "Password must be at least 8 characters")
     .max(128, "Password must be at most 128 characters"),
   currency: z.string().length(3).optional().default("USD"),

[NoCoverage] StringLiteral
src/handlers/auth/register.mjs:9:13
   email: z.email("Invalid email format"),
   password: z
     .string()
-    .min(8, "Password must be at least 8 characters")
+    .min(8, "")
     .max(128, "Password must be at most 128 characters"),
   currency: z.string().length(3).optional().default("USD"),

[NoCoverage] BooleanLiteral
src/handlers/auth/register.mjs:22:9
   try {
     const validation = registerSchema.safeParse(req.body);
 
-    if (!validation.success) {
+    if (validation.success) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ObjectLiteral
src/handlers/auth/register.mjs:33:37
 
     const { email, password, currency } = validation.data;
 
-    const user = await registerUser({ email, password, currency });
+    const user = await registerUser({});
     const token = generateToken(user);
 

[NoCoverage] StringLiteral
src/handlers/auth/register.mjs:36:57
     const user = await registerUser({ email, password, currency });
     const token = generateToken(user);
 
-    logger.info({ userId: user.id, email: user.email }, "User registered");
+    logger.info({ userId: user.id, email: user.email }, "");
 
     return res.status(201).json({

[NoCoverage] ObjectLiteral
src/handlers/auth/register.mjs:48:18
           role: user.role,
           createdAt: user.createdAt,
         },
-        account: {
-          id: user.account.id,
-          status: user.account.status,
-        },
+        account: {},
         wallet: {
           id: user.account.wallets[0].id,

[NoCoverage] BlockStatement
src/handlers/auth/register.mjs:60:17
         token,
       },
     });
-  } catch (err) {
-    if (err.code === "EMAIL_EXISTS") {
-      return res.status(409).json({
-        status: 409,
-        code: "EMAIL_EXISTS",
-        error: err.message,
-      });
-    }
-
-    logger.error({ err }, "Registration failed");
-    return res.status(500).json({
-      status: 500,
-      code: "INTERNAL_ERROR",
-      error: "Registration failed",
-    });
-  }
+  } catch (err) {}
 }
 

[NoCoverage] ConditionalExpression
src/handlers/auth/register.mjs:61:9
       },
     });
   } catch (err) {
-    if (err.code === "EMAIL_EXISTS") {
+    if (false) {
       return res.status(409).json({
         status: 409,

[NoCoverage] EqualityOperator
src/handlers/auth/register.mjs:61:9
       },
     });
   } catch (err) {
-    if (err.code === "EMAIL_EXISTS") {
+    if (err.code !== "EMAIL_EXISTS") {
       return res.status(409).json({
         status: 409,

[NoCoverage] ObjectLiteral
src/handlers/auth/register.mjs:69:18
       });
     }
 
-    logger.error({ err }, "Registration failed");
+    logger.error({}, "Registration failed");
     return res.status(500).json({
       status: 500,

[NoCoverage] StringLiteral
src/handlers/auth/register.mjs:73:14
     return res.status(500).json({
       status: 500,
       code: "INTERNAL_ERROR",
-      error: "Registration failed",
+      error: "",
     });
   }
