[NoCoverage] ConditionalExpression
src/handlers/authorize.mjs:8:9
   try {
     const { walletId, amount, referenceId } = req.body;
 
-    if (!walletId || !amount || !referenceId) {
+    if (false) {
       return res.status(400).json({
         status: 400,

[NoCoverage] ConditionalExpression
src/handlers/authorize.mjs:8:9
   try {
     const { walletId, amount, referenceId } = req.body;
 
-    if (!walletId || !amount || !referenceId) {
+    if (false || !referenceId) {
       return res.status(400).json({
         status: 400,

[NoCoverage] StringLiteral
src/handlers/authorize.mjs:12:16
       return res.status(400).json({
         status: 400,
         code: "BAD_REQUEST",
-        error: "Missing required fields: walletId, amount, referenceId",
+        error: "",
       });
     }

[NoCoverage] BlockStatement
src/handlers/authorize.mjs:21:18
       where: { id: walletId, accountId: req.user.account.id },
     });
 
-    if (!wallet) {
-      return res.status(404).json({
-        status: 404,
-        code: "NOT_FOUND",
-        error: "Wallet not found",
-      });
-    }
+    if (!wallet) {}
 
     if (wallet.balance < amount) {

[NoCoverage] EqualityOperator
src/handlers/authorize.mjs:29:9
       });
     }
 
-    if (wallet.balance < amount) {
+    if (wallet.balance <= amount) {
       return res.status(422).json({
         status: 422,

[NoCoverage] EqualityOperator
src/handlers/authorize.mjs:29:9
       });
     }
 
-    if (wallet.balance < amount) {
+    if (wallet.balance >= amount) {
       return res.status(422).json({
         status: 422,

[NoCoverage] StringLiteral
src/handlers/authorize.mjs:32:15
     if (wallet.balance < amount) {
       return res.status(422).json({
         status: 422,
-        code: "INSUFFICIENT_FUNDS",
+        code: "",
         error: "Insufficient funds",
       });

[NoCoverage] StringLiteral
src/handlers/authorize.mjs:43:17
         walletId,
         type: "authorize",
         amount,
-        status: "pending",
+        status: "",
         referenceId,
       },

[NoCoverage] ObjectLiteral
src/handlers/authorize.mjs:54:26
       data: txn,
     });
   } catch (err) {
-    res.status(500).json({
-      status: 500,
-      code: "INTERNAL_SERVER_ERROR",
-      error: err.message,
-    });
+    res.status(500).json({});
   }
 }
