[NoCoverage] StringLiteral
src/infra/alerting.mjs:317:5
   await triggerAlert(
     AlertType.SIGNATURE_ATTACK,
     AlertSeverity.CRITICAL,
-    `Potential signature attack from ${sourceIp}`,
+    ``,
     { sourceIp, failureCount, ...details },
     `signature_attack:${sourceIp}`

[NoCoverage] BlockStatement
src/infra/alerting.mjs:326:38
 /**
  * Clear alert cooldown (for testing)
  */
-export const clearAlertState = () => {
-  alertState.clear();
-};
+export const clearAlertState = () => {};
 
 export default {
