[NoCoverage] ConditionalExpression
src/infra/logger.mjs:9:22
  * Uses Pino for high-performance JSON logging
  */
 
-const isProduction = process.env.NODE_ENV === "production";
+const isProduction = true;
 const logLevel = process.env.LOG_LEVEL || (isProduction ? "info" : "debug");
 

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:10:18
  */
 
 const isProduction = process.env.NODE_ENV === "production";
-const logLevel = process.env.LOG_LEVEL || (isProduction ? "info" : "debug");
+const logLevel = false;
 
 // Base logger configuration

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:10:18
  */
 
 const isProduction = process.env.NODE_ENV === "production";
-const logLevel = process.env.LOG_LEVEL || (isProduction ? "info" : "debug");
+const logLevel = true;
 
 // Base logger configuration

[NoCoverage] ObjectLiteral
src/infra/logger.mjs:15:9
 // Base logger configuration
 const baseConfig = {
   level: logLevel,
-  base: {
-    service: "wallet-api",
-    version: process.env.npm_package_version || "1.0.0",
-    env: process.env.NODE_ENV || "development",
-  },
+  base: {},
   timestamp: pino.stdTimeFunctions.isoTime,
   formatters: {

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:17:14
   level: logLevel,
   base: {
     service: "wallet-api",
-    version: process.env.npm_package_version || "1.0.0",
+    version: true,
     env: process.env.NODE_ENV || "development",
   },

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:18:10
   base: {
     service: "wallet-api",
     version: process.env.npm_package_version || "1.0.0",
-    env: process.env.NODE_ENV || "development",
+    env: false,
   },
   timestamp: pino.stdTimeFunctions.isoTime,

[NoCoverage] LogicalOperator
src/infra/logger.mjs:18:10
   base: {
     service: "wallet-api",
     version: process.env.npm_package_version || "1.0.0",
-    env: process.env.NODE_ENV || "development",
+    env: process.env.NODE_ENV && "development",
   },
   timestamp: pino.stdTimeFunctions.isoTime,

[NoCoverage] ArrowFunction
src/infra/logger.mjs:22:12
   },
   timestamp: pino.stdTimeFunctions.isoTime,
   formatters: {
-    level: (label) => ({ level: label }),
+    level: () => undefined,
   },
   redact: {

[NoCoverage] StringLiteral
src/infra/logger.mjs:28:7
     paths: [
       "req.headers.authorization",
       "req.headers['x-signature']",
-      "password",
+      "",
       "secret",
       "token",

[NoCoverage] StringLiteral
src/infra/logger.mjs:33:7
       "token",
       "*.password",
       "*.secret",
-      "*.token",
+      "",
     ],
     remove: true,

[NoCoverage] BooleanLiteral
src/infra/logger.mjs:35:13
       "*.secret",
       "*.token",
     ],
-    remove: true,
+    remove: false,
   },
 };

[NoCoverage] ObjectLiteral
src/infra/logger.mjs:46:18
       ...baseConfig,
       transport: {
         target: "pino-pretty",
-        options: {
-          colorize: true,
-          translateTime: "SYS:standard",
-          ignore: "pid,hostname",
-        },
+        options: {},
       },
     });

[NoCoverage] ArrowFunction
src/infra/logger.mjs:58:38
  * Generate a new correlation ID
  * @returns {string} UUID v4
  */
-export const generateCorrelationId = () => randomUUID();
+export const generateCorrelationId = () => undefined;
 
 /**

[NoCoverage] BlockStatement
src/infra/logger.mjs:66:79
  * @param {object} additionalContext - Additional context to include
  * @returns {pino.Logger} Child logger instance
  */
-export const createRequestLogger = (correlationId, additionalContext = {}) => {
-  return logger.child({
-    correlationId,
-    ...additionalContext,
-  });
-};
+export const createRequestLogger = (correlationId, additionalContext = {}) => {};
 
 /**

[NoCoverage] ArrowFunction
src/infra/logger.mjs:80:16
   /**
    * Create transaction log context
    */
-  transaction: (transactionId, type, walletId, amount) => ({
-    transactionId,
-    transactionType: type,
-    walletId,
-    amount: Number(amount),
-  }),
+  transaction: () => undefined,
 
   /**

[NoCoverage] ArrowFunction
src/infra/logger.mjs:90:9
   /**
    * Create authentication log context
    */
-  auth: (accountId, success, reason = null) => ({
-    accountId,
-    authSuccess: success,
-    ...(reason && { authFailReason: reason }),
-  }),
+  auth: () => undefined,
 
   /**

[NoCoverage] ObjectLiteral
src/infra/logger.mjs:90:49
   /**
    * Create authentication log context
    */
-  auth: (accountId, success, reason = null) => ({
-    accountId,
-    authSuccess: success,
-    ...(reason && { authFailReason: reason }),
-  }),
+  auth: (accountId, success, reason = null) => ({}),
 
   /**

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:93:9
   auth: (accountId, success, reason = null) => ({
     accountId,
     authSuccess: success,
-    ...(reason && { authFailReason: reason }),
+    ...(true),
   }),
 

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:93:9
   auth: (accountId, success, reason = null) => ({
     accountId,
     authSuccess: success,
-    ...(reason && { authFailReason: reason }),
+    ...(false),
   }),
 

[NoCoverage] ArrowFunction
src/infra/logger.mjs:99:10
   /**
    * Create error log context
    */
-  error: (error, additionalInfo = {}) => ({
-    errorName: error.name,
-    errorMessage: error.message,
-    errorStack: error.stack,
-    ...additionalInfo,
-  }),
+  error: () => undefined,
 
   /**

[NoCoverage] ObjectLiteral
src/infra/logger.mjs:99:43
   /**
    * Create error log context
    */
-  error: (error, additionalInfo = {}) => ({
-    errorName: error.name,
-    errorMessage: error.message,
-    errorStack: error.stack,
-    ...additionalInfo,
-  }),
+  error: (error, additionalInfo = {}) => ({}),
 
   /**

[NoCoverage] ArrowFunction
src/infra/logger.mjs:109:9
   /**
    * Create HTTP request log context
    */
-  http: (req) => ({
-    method: req.method,
-    path: req.path,
-    query: req.query,
-    userAgent: req.get("user-agent"),
-    ip: req.ip || req.connection?.remoteAddress,
-  }),
+  http: () => undefined,
 
   /**

[NoCoverage] ArrowFunction
src/infra/logger.mjs:120:13
   /**
    * Create database operation log context
    */
-  database: (operation, table, duration = null) => ({
-    dbOperation: operation,
-    dbTable: table,
-    ...(duration !== null && { durationMs: duration }),
-  }),
+  database: () => undefined,
 };
 

[NoCoverage] ObjectLiteral
src/infra/logger.mjs:120:53
   /**
    * Create database operation log context
    */
-  database: (operation, table, duration = null) => ({
-    dbOperation: operation,
-    dbTable: table,
-    ...(duration !== null && { durationMs: duration }),
-  }),
+  database: (operation, table, duration = null) => ({}),
 };
 

[NoCoverage] LogicalOperator
src/infra/logger.mjs:123:9
   database: (operation, table, duration = null) => ({
     dbOperation: operation,
     dbTable: table,
-    ...(duration !== null && { durationMs: duration }),
+    ...(duration !== null || {
+  durationMs: duration
+}),
   }),
 };

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:123:9
   database: (operation, table, duration = null) => ({
     dbOperation: operation,
     dbTable: table,
-    ...(duration !== null && { durationMs: duration }),
+    ...(true),
   }),
 };

[NoCoverage] BlockStatement
src/infra/logger.mjs:134:62
   /**
    * Log successful authentication
    */
-  authSuccess: (correlationId, accountId, method = "jwt") => {
-    logger.info(
-      {
-        correlationId,
-        auditType: "AUTH_SUCCESS",
-        accountId,
-        authMethod: method,
-      },
-      "Authentication successful"
-    );
-  },
+  authSuccess: (correlationId, accountId, method = "jwt") => {},
 
   /**

[NoCoverage] StringLiteral
src/infra/logger.mjs:134:52
   /**
    * Log successful authentication
    */
-  authSuccess: (correlationId, accountId, method = "jwt") => {
+  authSuccess: (correlationId, accountId, method = "") => {
     logger.info(
       {

[NoCoverage] StringLiteral
src/infra/logger.mjs:138:20
     logger.info(
       {
         correlationId,
-        auditType: "AUTH_SUCCESS",
+        auditType: "",
         accountId,
         authMethod: method,

[NoCoverage] BlockStatement
src/infra/logger.mjs:149:57
   /**
    * Log failed authentication
    */
-  authFailure: (correlationId, reason, details = {}) => {
-    logger.warn(
-      {
-        correlationId,
-        auditType: "AUTH_FAILURE",
-        failReason: reason,
-        ...details,
-      },
-      "Authentication failed"
-    );
-  },
+  authFailure: (correlationId, reason, details = {}) => {},
 
   /**

[NoCoverage] StringLiteral
src/infra/logger.mjs:157:7
         failReason: reason,
         ...details,
       },
-      "Authentication failed"
+      ""
     );
   },

[NoCoverage] BlockStatement
src/infra/logger.mjs:164:59
   /**
    * Log transaction events
    */
-  transaction: (correlationId, event, transactionData) => {
-    logger.info(
-      {
-        correlationId,
-        auditType: `TXN_${event.toUpperCase()}`,
-        ...transactionData,
-      },
-      `Transaction ${event}`
-    );
-  },
+  transaction: (correlationId, event, transactionData) => {},
 
   /**

[NoCoverage] MethodExpression
src/infra/logger.mjs:168:27
     logger.info(
       {
         correlationId,
-        auditType: `TXN_${event.toUpperCase()}`,
+        auditType: `TXN_${event.toLowerCase()}`,
         ...transactionData,
       },

[NoCoverage] BlockStatement
src/infra/logger.mjs:178:65
   /**
    * Log signature validation
    */
-  signatureValidation: (correlationId, valid, reason = null) => {
-    const level = valid ? "info" : "warn";
-    logger[level](
-      {
-        correlationId,
-        auditType: valid ? "SIGNATURE_VALID" : "SIGNATURE_INVALID",
-        ...(reason && { reason }),
-      },
-      `Signature validation ${valid ? "passed" : "failed"}`
-    );
-  },
+  signatureValidation: (correlationId, valid, reason = null) => {},
 
   /**

[NoCoverage] StringLiteral
src/infra/logger.mjs:183:48
     logger[level](
       {
         correlationId,
-        auditType: valid ? "SIGNATURE_VALID" : "SIGNATURE_INVALID",
+        auditType: valid ? "SIGNATURE_VALID" : "",
         ...(reason && { reason }),
       },

[NoCoverage] ConditionalExpression
src/infra/logger.mjs:184:13
       {
         correlationId,
         auditType: valid ? "SIGNATURE_VALID" : "SIGNATURE_INVALID",
-        ...(reason && { reason }),
+        ...(false),
       },
       `Signature validation ${valid ? "passed" : "failed"}`

[NoCoverage] LogicalOperator
src/infra/logger.mjs:184:13
       {
         correlationId,
         auditType: valid ? "SIGNATURE_VALID" : "SIGNATURE_INVALID",
-        ...(reason && { reason }),
+        ...(reason || {
+  reason
+}),
       },
       `Signature validation ${valid ? "passed" : "failed"}`

[NoCoverage] BlockStatement
src/infra/logger.mjs:193:58
   /**
    * Log security events
    */
-  securityEvent: (correlationId, event, details = {}) => {
-    logger.warn(
-      {
-        correlationId,
-        auditType: "SECURITY_EVENT",
-        securityEvent: event,
-        ...details,
-      },
-      `Security event: ${event}`
-    );
-  },
+  securityEvent: (correlationId, event, details = {}) => {},
 };
 

[NoCoverage] StringLiteral
src/infra/logger.mjs:201:7
         securityEvent: event,
         ...details,
       },
-      `Security event: ${event}`
+      ``
     );
   },
