[NoCoverage] ObjectLiteral
src/infra/metrics.mjs:7:17
  */
 
 // Metric storage
-const metrics = {
-  counters: new Map(),
-  histograms: new Map(),
-  gauges: new Map(),
-};
+const metrics = {};
 
 // Histogram buckets for response times (in ms)

[NoCoverage] BlockStatement
src/infra/metrics.mjs:20:44
  * Counter metric - monotonically increasing value
  */
 class Counter {
-  constructor(name, help, labelNames = []) {
-    this.name = name;
-    this.help = help;
-    this.labelNames = labelNames;
-    this.values = new Map();
-  }
+  constructor(name, help, labelNames = []) {}
 
   inc(labels = {}, value = 1) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:27:31
     this.values = new Map();
   }
 
-  inc(labels = {}, value = 1) {
-    const key = this._labelKey(labels);
-    const current = this.values.get(key) || { value: 0, labels };
-    current.value += value;
-    this.values.set(key, current);
-  }
+  inc(labels = {}, value = 1) {}
 
   _labelKey(labels) {

[NoCoverage] LogicalOperator
src/infra/metrics.mjs:29:21
 
   inc(labels = {}, value = 1) {
     const key = this._labelKey(labels);
-    const current = this.values.get(key) || { value: 0, labels };
+    const current = this.values.get(key) && {
+  value: 0,
+  labels
+};
     current.value += value;
     this.values.set(key, current);

[NoCoverage] ConditionalExpression
src/infra/metrics.mjs:29:21
 
   inc(labels = {}, value = 1) {
     const key = this._labelKey(labels);
-    const current = this.values.get(key) || { value: 0, labels };
+    const current = true;
     current.value += value;
     this.values.set(key, current);

[NoCoverage] AssignmentOperator
src/infra/metrics.mjs:30:5
   inc(labels = {}, value = 1) {
     const key = this._labelKey(labels);
     const current = this.values.get(key) || { value: 0, labels };
-    current.value += value;
+    current.value -= value;
     this.values.set(key, current);
   }

[NoCoverage] BlockStatement
src/infra/metrics.mjs:34:21
     this.values.set(key, current);
   }
 
-  _labelKey(labels) {
-    return JSON.stringify(labels);
-  }
+  _labelKey(labels) {}
 
   collect() {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:38:13
     return JSON.stringify(labels);
   }
 
-  collect() {
-    const result = [];
-    for (const [, data] of this.values) {
-      result.push({
-        labels: data.labels,
-        value: data.value,
-      });
-    }
-    return result;
-  }
+  collect() {}
 }
 

[NoCoverage] ArrayDeclaration
src/infra/metrics.mjs:39:20
   }
 
   collect() {
-    const result = [];
+    const result = ["Stryker was here"];
     for (const [, data] of this.values) {
       result.push({

[NoCoverage] BlockStatement
src/infra/metrics.mjs:40:41
 
   collect() {
     const result = [];
-    for (const [, data] of this.values) {
-      result.push({
-        labels: data.labels,
-        value: data.value,
-      });
-    }
+    for (const [, data] of this.values) {}
     return result;
   }

[NoCoverage] BlockStatement
src/infra/metrics.mjs:54:71
  * Histogram metric - tracks distribution of values
  */
 class Histogram {
-  constructor(name, help, labelNames = [], buckets = DEFAULT_BUCKETS) {
-    this.name = name;
-    this.help = help;
-    this.labelNames = labelNames;
-    this.buckets = buckets.sort((a, b) => a - b);
-    this.values = new Map();
-  }
+  constructor(name, help, labelNames = [], buckets = DEFAULT_BUCKETS) {}
 
   observe(labels = {}, value) {

[NoCoverage] ArithmeticOperator
src/infra/metrics.mjs:58:43
     this.name = name;
     this.help = help;
     this.labelNames = labelNames;
-    this.buckets = buckets.sort((a, b) => a - b);
+    this.buckets = buckets.sort((a, b) => a + b);
     this.values = new Map();
   }

[NoCoverage] ArrowFunction
src/infra/metrics.mjs:58:33
     this.name = name;
     this.help = help;
     this.labelNames = labelNames;
-    this.buckets = buckets.sort((a, b) => a - b);
+    this.buckets = buckets.sort(() => undefined);
     this.values = new Map();
   }

[NoCoverage] BlockStatement
src/infra/metrics.mjs:62:31
     this.values = new Map();
   }
 
-  observe(labels = {}, value) {
-    const key = this._labelKey(labels);
-    let data = this.values.get(key);
-
-    if (!data) {
-      data = {
-        labels,
-        buckets: this.buckets.reduce((acc, b) => ({ ...acc, [b]: 0 }), {}),
-        sum: 0,
-        count: 0,
-      };
-      this.values.set(key, data);
-    }
-
-    data.sum += value;
-    data.count += 1;
-
-    for (const bucket of this.buckets) {
-      if (value <= bucket) {
-        data.buckets[bucket] += 1;
-      }
-    }
-  }
+  observe(labels = {}, value) {}
 
   startTimer(labels = {}) {

[NoCoverage] ArrowFunction
src/infra/metrics.mjs:69:38
     if (!data) {
       data = {
         labels,
-        buckets: this.buckets.reduce((acc, b) => ({ ...acc, [b]: 0 }), {}),
+        buckets: this.buckets.reduce(() => undefined, {}),
         sum: 0,
         count: 0,

[NoCoverage] ObjectLiteral
src/infra/metrics.mjs:69:51
     if (!data) {
       data = {
         labels,
-        buckets: this.buckets.reduce((acc, b) => ({ ...acc, [b]: 0 }), {}),
+        buckets: this.buckets.reduce((acc, b) => ({}), {}),
         sum: 0,
         count: 0,

[NoCoverage] AssignmentOperator
src/infra/metrics.mjs:76:5
       this.values.set(key, data);
     }
 
-    data.sum += value;
+    data.sum -= value;
     data.count += 1;
 

[NoCoverage] AssignmentOperator
src/infra/metrics.mjs:77:5
     }
 
     data.sum += value;
-    data.count += 1;
+    data.count -= 1;
 
     for (const bucket of this.buckets) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:79:40
     data.sum += value;
     data.count += 1;
 
-    for (const bucket of this.buckets) {
-      if (value <= bucket) {
-        data.buckets[bucket] += 1;
-      }
-    }
+    for (const bucket of this.buckets) {}
   }
 

[NoCoverage] BlockStatement
src/infra/metrics.mjs:80:28
     data.count += 1;
 
     for (const bucket of this.buckets) {
-      if (value <= bucket) {
-        data.buckets[bucket] += 1;
-      }
+      if (value <= bucket) {}
     }
   }

[NoCoverage] ConditionalExpression
src/infra/metrics.mjs:80:11
     data.count += 1;
 
     for (const bucket of this.buckets) {
-      if (value <= bucket) {
+      if (true) {
         data.buckets[bucket] += 1;
       }

[NoCoverage] AssignmentOperator
src/infra/metrics.mjs:81:9
 
     for (const bucket of this.buckets) {
       if (value <= bucket) {
-        data.buckets[bucket] += 1;
+        data.buckets[bucket] -= 1;
       }
     }

[NoCoverage] BlockStatement
src/infra/metrics.mjs:86:27
     }
   }
 
-  startTimer(labels = {}) {
-    const start = process.hrtime.bigint();
-    return () => {
-      const end = process.hrtime.bigint();
-      const durationMs = Number(end - start) / 1e6;
-      this.observe(labels, durationMs);
-      return durationMs;
-    };
-  }
+  startTimer(labels = {}) {}
 
   _labelKey(labels) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:88:18
 
   startTimer(labels = {}) {
     const start = process.hrtime.bigint();
-    return () => {
-      const end = process.hrtime.bigint();
-      const durationMs = Number(end - start) / 1e6;
-      this.observe(labels, durationMs);
-      return durationMs;
-    };
+    return () => {};
   }
 

[NoCoverage] ArithmeticOperator
src/infra/metrics.mjs:90:33
     const start = process.hrtime.bigint();
     return () => {
       const end = process.hrtime.bigint();
-      const durationMs = Number(end - start) / 1e6;
+      const durationMs = Number(end + start) / 1e6;
       this.observe(labels, durationMs);
       return durationMs;

[NoCoverage] ArithmeticOperator
src/infra/metrics.mjs:90:26
     const start = process.hrtime.bigint();
     return () => {
       const end = process.hrtime.bigint();
-      const durationMs = Number(end - start) / 1e6;
+      const durationMs = Number(end - start) * 1e6;
       this.observe(labels, durationMs);
       return durationMs;

[NoCoverage] BlockStatement
src/infra/metrics.mjs:100:13
     return JSON.stringify(labels);
   }
 
-  collect() {
-    const result = [];
-    for (const [, data] of this.values) {
-      result.push({
-        labels: data.labels,
-        buckets: data.buckets,
-        sum: data.sum,
-        count: data.count,
-      });
-    }
-    return result;
-  }
+  collect() {}
 }
 

[NoCoverage] BlockStatement
src/infra/metrics.mjs:102:41
 
   collect() {
     const result = [];
-    for (const [, data] of this.values) {
-      result.push({
-        labels: data.labels,
-        buckets: data.buckets,
-        sum: data.sum,
-        count: data.count,
-      });
-    }
+    for (const [, data] of this.values) {}
     return result;
   }

[NoCoverage] ObjectLiteral
src/infra/metrics.mjs:103:19
   collect() {
     const result = [];
     for (const [, data] of this.values) {
-      result.push({
-        labels: data.labels,
-        buckets: data.buckets,
-        sum: data.sum,
-        count: data.count,
-      });
+      result.push({});
     }
     return result;

[NoCoverage] BlockStatement
src/infra/metrics.mjs:118:44
  * Gauge metric - value that can go up or down
  */
 class Gauge {
-  constructor(name, help, labelNames = []) {
-    this.name = name;
-    this.help = help;
-    this.labelNames = labelNames;
-    this.values = new Map();
-  }
+  constructor(name, help, labelNames = []) {}
 
   set(labels = {}, value) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:125:27
     this.values = new Map();
   }
 
-  set(labels = {}, value) {
-    const key = this._labelKey(labels);
-    this.values.set(key, { labels, value });
-  }
+  set(labels = {}, value) {}
 
   inc(labels = {}, value = 1) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:130:31
     this.values.set(key, { labels, value });
   }
 
-  inc(labels = {}, value = 1) {
-    const key = this._labelKey(labels);
-    const current = this.values.get(key) || { labels, value: 0 };
-    current.value += value;
-    this.values.set(key, current);
-  }
+  inc(labels = {}, value = 1) {}
 
   dec(labels = {}, value = 1) {

[NoCoverage] ConditionalExpression
src/infra/metrics.mjs:132:21
 
   inc(labels = {}, value = 1) {
     const key = this._labelKey(labels);
-    const current = this.values.get(key) || { labels, value: 0 };
+    const current = true;
     current.value += value;
     this.values.set(key, current);

[NoCoverage] LogicalOperator
src/infra/metrics.mjs:132:21
 
   inc(labels = {}, value = 1) {
     const key = this._labelKey(labels);
-    const current = this.values.get(key) || { labels, value: 0 };
+    const current = this.values.get(key) && {
+  labels,
+  value: 0
+};
     current.value += value;
     this.values.set(key, current);

[NoCoverage] AssignmentOperator
src/infra/metrics.mjs:133:5
   inc(labels = {}, value = 1) {
     const key = this._labelKey(labels);
     const current = this.values.get(key) || { labels, value: 0 };
-    current.value += value;
+    current.value -= value;
     this.values.set(key, current);
   }

[NoCoverage] BlockStatement
src/infra/metrics.mjs:137:31
     this.values.set(key, current);
   }
 
-  dec(labels = {}, value = 1) {
-    this.inc(labels, -value);
-  }
+  dec(labels = {}, value = 1) {}
 
   _labelKey(labels) {

[NoCoverage] UnaryOperator
src/infra/metrics.mjs:138:22
   }
 
   dec(labels = {}, value = 1) {
-    this.inc(labels, -value);
+    this.inc(labels, +value);
   }
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:167:22
 export const httpRequestsTotal = new Counter(
   "wallet_http_requests_total",
   "Total number of HTTP requests",
-  ["method", "path", "status"]
+  ["method", "path", ""]
 );
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:171:3
 );
 
 export const httpRequestDuration = new Histogram(
-  "wallet_http_request_duration_ms",
+  "",
   "HTTP request duration in milliseconds",
   ["method", "path", "status"]

[NoCoverage] StringLiteral
src/infra/metrics.mjs:173:14
 export const httpRequestDuration = new Histogram(
   "wallet_http_request_duration_ms",
   "HTTP request duration in milliseconds",
-  ["method", "path", "status"]
+  ["method", "", "status"]
 );
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:181:3
  */
 export const transactionsTotal = new Counter(
   "wallet_transactions_total",
-  "Total number of transactions",
+  "",
   ["type", "status"]
 );

[NoCoverage] StringLiteral
src/infra/metrics.mjs:182:12
 export const transactionsTotal = new Counter(
   "wallet_transactions_total",
   "Total number of transactions",
-  ["type", "status"]
+  ["type", ""]
 );
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:188:4
 export const transactionAmount = new Histogram(
   "wallet_transaction_amount",
   "Transaction amounts",
-  ["type"],
+  [""],
   [10, 100, 500, 1000, 5000, 10000, 50000, 100000]
 );

[NoCoverage] StringLiteral
src/infra/metrics.mjs:196:3
  * Authentication metrics
  */
 export const authAttemptsTotal = new Counter(
-  "wallet_auth_attempts_total",
+  "",
   "Total authentication attempts",
   ["result", "reason"]

[NoCoverage] StringLiteral
src/infra/metrics.mjs:197:3
  */
 export const authAttemptsTotal = new Counter(
   "wallet_auth_attempts_total",
-  "Total authentication attempts",
+  "",
   ["result", "reason"]
 );

[NoCoverage] StringLiteral
src/infra/metrics.mjs:198:4
 export const authAttemptsTotal = new Counter(
   "wallet_auth_attempts_total",
   "Total authentication attempts",
-  ["result", "reason"]
+  ["", "reason"]
 );
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:207:4
 export const signatureValidationsTotal = new Counter(
   "wallet_signature_validations_total",
   "Total signature validations",
-  ["result"]
+  [""]
 );
 

[NoCoverage] ArrayDeclaration
src/infra/metrics.mjs:216:3
 export const dbQueryDuration = new Histogram(
   "wallet_db_query_duration_ms",
   "Database query duration in milliseconds",
-  ["operation", "table"]
+  []
 );
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:230:4
 export const redisOperationsTotal = new Counter(
   "wallet_redis_operations_total",
   "Total Redis operations",
-  ["operation", "result"]
+  ["", "result"]
 );
 

[NoCoverage] ArrayDeclaration
src/infra/metrics.mjs:236:3
 export const redisOperationDuration = new Histogram(
   "wallet_redis_operation_duration_ms",
   "Redis operation duration in milliseconds",
-  ["operation"]
+  []
 );
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:245:12
 export const errorsTotal = new Counter(
   "wallet_errors_total",
   "Total number of errors",
-  ["type", "code"]
+  ["type", ""]
 );
 

[NoCoverage] ArrayDeclaration
src/infra/metrics.mjs:265:17
  * @returns {string} Prometheus-formatted metrics
  */
 export const collectMetrics = () => {
-  const lines = [];
+  const lines = ["Stryker was here"];
 
   // Add process metrics

[NoCoverage] StringLiteral
src/infra/metrics.mjs:271:14
   const memUsage = process.memoryUsage();
   lines.push("# HELP process_memory_heap_used_bytes Process heap memory used");
   lines.push("# TYPE process_memory_heap_used_bytes gauge");
-  lines.push(`process_memory_heap_used_bytes ${memUsage.heapUsed}`);
+  lines.push(``);
 
   lines.push("# HELP process_memory_rss_bytes Process resident set size");

[NoCoverage] ArrayDeclaration
src/infra/metrics.mjs:282:20
   lines.push(`process_uptime_seconds ${Math.floor(process.uptime())}`);
 
   // Collect counters
-  const counters = [
-    httpRequestsTotal,
-    transactionsTotal,
-    authAttemptsTotal,
-    signatureValidationsTotal,
-    redisOperationsTotal,
-    errorsTotal,
-  ];
+  const counters = [];
 
   for (const counter of counters) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:291:35
     errorsTotal,
   ];
 
-  for (const counter of counters) {
-    lines.push(`# HELP ${counter.name} ${counter.help}`);
-    lines.push(`# TYPE ${counter.name} counter`);
-    for (const item of counter.collect()) {
-      const labelStr = formatLabels(item.labels);
-      lines.push(`${counter.name}${labelStr} ${item.value}`);
-    }
-  }
+  for (const counter of counters) {}
 
   // Collect histograms

[NoCoverage] BlockStatement
src/infra/metrics.mjs:294:43
   for (const counter of counters) {
     lines.push(`# HELP ${counter.name} ${counter.help}`);
     lines.push(`# TYPE ${counter.name} counter`);
-    for (const item of counter.collect()) {
-      const labelStr = formatLabels(item.labels);
-      lines.push(`${counter.name}${labelStr} ${item.value}`);
-    }
+    for (const item of counter.collect()) {}
   }
 

[NoCoverage] StringLiteral
src/infra/metrics.mjs:296:18
     lines.push(`# TYPE ${counter.name} counter`);
     for (const item of counter.collect()) {
       const labelStr = formatLabels(item.labels);
-      lines.push(`${counter.name}${labelStr} ${item.value}`);
+      lines.push(``);
     }
   }

[NoCoverage] BlockStatement
src/infra/metrics.mjs:308:39
     redisOperationDuration,
   ];
 
-  for (const histogram of histograms) {
-    lines.push(`# HELP ${histogram.name} ${histogram.help}`);
-    lines.push(`# TYPE ${histogram.name} histogram`);
-    for (const item of histogram.collect()) {
-      const labelStr = formatLabels(item.labels);
-      let cumulative = 0;
-      for (const bucket of histogram.buckets) {
-        cumulative += item.buckets[bucket] || 0;
-        lines.push(
-          `${histogram.name}_bucket${addLabel(labelStr, "le", bucket)} ${cumulative}`
-        );
-      }
-      lines.push(
-        `${histogram.name}_bucket${addLabel(labelStr, "le", "+Inf")} ${item.count}`
-      );
-      lines.push(`${histogram.name}_sum${labelStr} ${item.sum}`);
-      lines.push(`${histogram.name}_count${labelStr} ${item.count}`);
-    }
-  }
+  for (const histogram of histograms) {}
 
   // Collect gauges

[NoCoverage] StringLiteral
src/infra/metrics.mjs:309:16
   ];
 
   for (const histogram of histograms) {
-    lines.push(`# HELP ${histogram.name} ${histogram.help}`);
+    lines.push(``);
     lines.push(`# TYPE ${histogram.name} histogram`);
     for (const item of histogram.collect()) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:311:45
   for (const histogram of histograms) {
     lines.push(`# HELP ${histogram.name} ${histogram.help}`);
     lines.push(`# TYPE ${histogram.name} histogram`);
-    for (const item of histogram.collect()) {
-      const labelStr = formatLabels(item.labels);
-      let cumulative = 0;
-      for (const bucket of histogram.buckets) {
-        cumulative += item.buckets[bucket] || 0;
-        lines.push(
-          `${histogram.name}_bucket${addLabel(labelStr, "le", bucket)} ${cumulative}`
-        );
-      }
-      lines.push(
-        `${histogram.name}_bucket${addLabel(labelStr, "le", "+Inf")} ${item.count}`
-      );
-      lines.push(`${histogram.name}_sum${labelStr} ${item.sum}`);
-      lines.push(`${histogram.name}_count${labelStr} ${item.count}`);
-    }
+    for (const item of histogram.collect()) {}
   }
 

[NoCoverage] BlockStatement
src/infra/metrics.mjs:314:47
     for (const item of histogram.collect()) {
       const labelStr = formatLabels(item.labels);
       let cumulative = 0;
-      for (const bucket of histogram.buckets) {
-        cumulative += item.buckets[bucket] || 0;
-        lines.push(
-          `${histogram.name}_bucket${addLabel(labelStr, "le", bucket)} ${cumulative}`
-        );
-      }
+      for (const bucket of histogram.buckets) {}
       lines.push(
         `${histogram.name}_bucket${addLabel(labelStr, "le", "+Inf")} ${item.count}`

[NoCoverage] ConditionalExpression
src/infra/metrics.mjs:315:23
       const labelStr = formatLabels(item.labels);
       let cumulative = 0;
       for (const bucket of histogram.buckets) {
-        cumulative += item.buckets[bucket] || 0;
+        cumulative += false;
         lines.push(
           `${histogram.name}_bucket${addLabel(labelStr, "le", bucket)} ${cumulative}`

[NoCoverage] LogicalOperator
src/infra/metrics.mjs:315:23
       const labelStr = formatLabels(item.labels);
       let cumulative = 0;
       for (const bucket of histogram.buckets) {
-        cumulative += item.buckets[bucket] || 0;
+        cumulative += item.buckets[bucket] && 0;
         lines.push(
           `${histogram.name}_bucket${addLabel(labelStr, "le", bucket)} ${cumulative}`

[NoCoverage] StringLiteral
src/infra/metrics.mjs:317:57
       for (const bucket of histogram.buckets) {
         cumulative += item.buckets[bucket] || 0;
         lines.push(
-          `${histogram.name}_bucket${addLabel(labelStr, "le", bucket)} ${cumulative}`
+          `${histogram.name}_bucket${addLabel(labelStr, "", bucket)} ${cumulative}`
         );
       }

[NoCoverage] StringLiteral
src/infra/metrics.mjs:321:61
         );
       }
       lines.push(
-        `${histogram.name}_bucket${addLabel(labelStr, "le", "+Inf")} ${item.count}`
+        `${histogram.name}_bucket${addLabel(labelStr, "le", "")} ${item.count}`
       );
       lines.push(`${histogram.name}_sum${labelStr} ${item.sum}`);

[NoCoverage] StringLiteral
src/infra/metrics.mjs:323:18
       lines.push(
         `${histogram.name}_bucket${addLabel(labelStr, "le", "+Inf")} ${item.count}`
       );
-      lines.push(`${histogram.name}_sum${labelStr} ${item.sum}`);
+      lines.push(``);
       lines.push(`${histogram.name}_count${labelStr} ${item.count}`);
     }

[NoCoverage] ArrayDeclaration
src/infra/metrics.mjs:329:18
   }
 
   // Collect gauges
-  const gauges = [dbConnectionsActive, activeRequests];
+  const gauges = [];
 
   for (const gauge of gauges) {

[NoCoverage] BlockStatement
src/infra/metrics.mjs:331:31
   // Collect gauges
   const gauges = [dbConnectionsActive, activeRequests];
 
-  for (const gauge of gauges) {
-    lines.push(`# HELP ${gauge.name} ${gauge.help}`);
-    lines.push(`# TYPE ${gauge.name} gauge`);
-    for (const item of gauge.collect()) {
-      const labelStr = formatLabels(item.labels);
-      lines.push(`${gauge.name}${labelStr} ${item.value}`);
-    }
-  }
+  for (const gauge of gauges) {}
 
   return lines.join("\n");

[NoCoverage] BlockStatement
src/infra/metrics.mjs:334:41
   for (const gauge of gauges) {
     lines.push(`# HELP ${gauge.name} ${gauge.help}`);
     lines.push(`# TYPE ${gauge.name} gauge`);
-    for (const item of gauge.collect()) {
-      const labelStr = formatLabels(item.labels);
-      lines.push(`${gauge.name}${labelStr} ${item.value}`);
-    }
+    for (const item of gauge.collect()) {}
   }
 

[NoCoverage] BlockStatement
src/infra/metrics.mjs:346:34
 /**
  * Format labels for Prometheus exposition format
  */
-const formatLabels = (labels) => {
-  const entries = Object.entries(labels);
-  if (entries.length === 0) return "";
-  const formatted = entries.map(([k, v]) => `${k}="${v}"`).join(",");
-  return `{${formatted}}`;
-};
+const formatLabels = (labels) => {};
 
 /**

[NoCoverage] ConditionalExpression
src/infra/metrics.mjs:348:7
  */
 const formatLabels = (labels) => {
   const entries = Object.entries(labels);
-  if (entries.length === 0) return "";
+  if (true) return "";
   const formatted = entries.map(([k, v]) => `${k}="${v}"`).join(",");
   return `{${formatted}}`;

[NoCoverage] EqualityOperator
src/infra/metrics.mjs:348:7
  */
 const formatLabels = (labels) => {
   const entries = Object.entries(labels);
-  if (entries.length === 0) return "";
+  if (entries.length !== 0) return "";
   const formatted = entries.map(([k, v]) => `${k}="${v}"`).join(",");
   return `{${formatted}}`;

[NoCoverage] ArrowFunction
src/infra/metrics.mjs:349:33
 const formatLabels = (labels) => {
   const entries = Object.entries(labels);
   if (entries.length === 0) return "";
-  const formatted = entries.map(([k, v]) => `${k}="${v}"`).join(",");
+  const formatted = entries.map(() => undefined).join(",");
   return `{${formatted}}`;
 };

[NoCoverage] StringLiteral
src/infra/metrics.mjs:349:65
 const formatLabels = (labels) => {
   const entries = Object.entries(labels);
   if (entries.length === 0) return "";
-  const formatted = entries.map(([k, v]) => `${k}="${v}"`).join(",");
+  const formatted = entries.map(([k, v]) => `${k}="${v}"`).join("");
   return `{${formatted}}`;
 };

[NoCoverage] BlockStatement
src/infra/metrics.mjs:356:44
 /**
  * Add a label to existing label string
  */
-const addLabel = (labelStr, key, value) => {
-  if (labelStr === "") {
-    return `{${key}="${value}"}`;
-  }
-  return labelStr.slice(0, -1) + `,${key}="${value}"}`;
-};
+const addLabel = (labelStr, key, value) => {};
 
 /**

[NoCoverage] EqualityOperator
src/infra/metrics.mjs:357:7
  * Add a label to existing label string
  */
 const addLabel = (labelStr, key, value) => {
-  if (labelStr === "") {
+  if (labelStr !== "") {
     return `{${key}="${value}"}`;
   }

[NoCoverage] ConditionalExpression
src/infra/metrics.mjs:357:7
  * Add a label to existing label string
  */
 const addLabel = (labelStr, key, value) => {
-  if (labelStr === "") {
+  if (false) {
     return `{${key}="${value}"}`;
   }

[NoCoverage] MethodExpression
src/infra/metrics.mjs:360:10
   if (labelStr === "") {
     return `{${key}="${value}"}`;
   }
-  return labelStr.slice(0, -1) + `,${key}="${value}"}`;
+  return labelStr + `,${key}="${value}"}`;
 };
 

[NoCoverage] UnaryOperator
src/infra/metrics.mjs:360:28
   if (labelStr === "") {
     return `{${key}="${value}"}`;
   }
-  return labelStr.slice(0, -1) + `,${key}="${value}"}`;
+  return labelStr.slice(0, +1) + `,${key}="${value}"}`;
 };
 

[NoCoverage] BlockStatement
src/infra/metrics.mjs:366:35
 /**
  * Reset all metrics (useful for testing)
  */
-export const resetMetrics = () => {
-  httpRequestsTotal.values.clear();
-  httpRequestDuration.values.clear();
-  transactionsTotal.values.clear();
-  transactionAmount.values.clear();
-  authAttemptsTotal.values.clear();
-  signatureValidationsTotal.values.clear();
-  dbQueryDuration.values.clear();
-  dbConnectionsActive.values.clear();
-  redisOperationsTotal.values.clear();
-  redisOperationDuration.values.clear();
-  errorsTotal.values.clear();
-  activeRequests.values.clear();
-};
+export const resetMetrics = () => {};
 
 export default {
