[Survived] BlockStatement
src/infra/prisma.mjs:9:34
  * Parse MariaDB connection URL into adapter config
  * Supports: mariadb://user:password@host:port/database
  */
-function parseConnectionUrl(url) {
-  const parsed = new URL(url);
-  return {
-    host: parsed.hostname,
-    port: parseInt(parsed.port, 10) || 3306,
-    user: parsed.username,
-    password: parsed.password || undefined,
-    database: parsed.pathname.slice(1), // Remove leading '/'
-    // Pool configuration
-    connectionLimit: 10,
-    acquireTimeout: 10000,
-    connectTimeout: 10000,
-    idleTimeout: 60000,
-    minDelayValidation: 500,
-  };
-}
+function parseConnectionUrl(url) {}
 
 const adapterConfig = parseConnectionUrl(process.env.DATABASE_ADAPTER_URL);

[Survived] ConditionalExpression
src/infra/prisma.mjs:13:11
   const parsed = new URL(url);
   return {
     host: parsed.hostname,
-    port: parseInt(parsed.port, 10) || 3306,
+    port: true,
     user: parsed.username,
     password: parsed.password || undefined,

[Survived] ConditionalExpression
src/infra/prisma.mjs:13:11
   const parsed = new URL(url);
   return {
     host: parsed.hostname,
-    port: parseInt(parsed.port, 10) || 3306,
+    port: false,
     user: parsed.username,
     password: parsed.password || undefined,

[Survived] ConditionalExpression
src/infra/prisma.mjs:15:15
     host: parsed.hostname,
     port: parseInt(parsed.port, 10) || 3306,
     user: parsed.username,
-    password: parsed.password || undefined,
+    password: true,
     database: parsed.pathname.slice(1), // Remove leading '/'
     // Pool configuration

[Survived] ConditionalExpression
src/infra/prisma.mjs:15:15
     host: parsed.hostname,
     port: parseInt(parsed.port, 10) || 3306,
     user: parsed.username,
-    password: parsed.password || undefined,
+    password: false,
     database: parsed.pathname.slice(1), // Remove leading '/'
     // Pool configuration

[Survived] MethodExpression
src/infra/prisma.mjs:16:15
     port: parseInt(parsed.port, 10) || 3306,
     user: parsed.username,
     password: parsed.password || undefined,
-    database: parsed.pathname.slice(1), // Remove leading '/'
+    database: parsed.pathname, // Remove leading '/'
     // Pool configuration
     connectionLimit: 10,

[Survived] ConditionalExpression
src/infra/prisma.mjs:31:8
 
 export const prisma = new PrismaClient({ 
   adapter,
-  log: process.env.NODE_ENV === 'development' ? ['error', 'warn'] : ['error'],
+  log: false ? ['error', 'warn'] : ['error'],
 });
 

[Survived] ConditionalExpression
src/infra/prisma.mjs:31:8
 
 export const prisma = new PrismaClient({ 
   adapter,
-  log: process.env.NODE_ENV === 'development' ? ['error', 'warn'] : ['error'],
+  log: true ? ['error', 'warn'] : ['error'],
 });
 

[NoCoverage] BlockStatement
src/infra/prisma.mjs:38:50
  * Gracefully close database connections
  * Should be called on application shutdown
  */
-export async function closeDatabaseConnections() {
-  await prisma.$disconnect();
-}
+export async function closeDatabaseConnections() {}
 
