[NoCoverage] BlockStatement
src/middleware/rbac.mjs:11:47
  * @param {...string} allowedRoles - Roles that are allowed access
  * @returns {Function} Express middleware
  */
-export function requireRoles(...allowedRoles) {
-  return (req, res, next) => {
-    if (!req.user) {
-      return res.status(401).json({
-        status: 401,
-        code: "UNAUTHORIZED",
-        error: "Authentication required",
-      });
-    }
-
-    const userRole = req.user.role;
-
-    if (!allowedRoles.includes(userRole)) {
-      return res.status(403).json({
-        status: 403,
-        code: "FORBIDDEN",
-        error: "Insufficient permissions",
-      });
-    }
-
-    next();
-  };
-}
+export function requireRoles(...allowedRoles) {}
 
 /**

[NoCoverage] BlockStatement
src/middleware/rbac.mjs:12:30
  * @returns {Function} Express middleware
  */
 export function requireRoles(...allowedRoles) {
-  return (req, res, next) => {
-    if (!req.user) {
-      return res.status(401).json({
-        status: 401,
-        code: "UNAUTHORIZED",
-        error: "Authentication required",
-      });
-    }
-
-    const userRole = req.user.role;
-
-    if (!allowedRoles.includes(userRole)) {
-      return res.status(403).json({
-        status: 403,
-        code: "FORBIDDEN",
-        error: "Insufficient permissions",
-      });
-    }
-
-    next();
-  };
+  return (req, res, next) => {};
 }
 

[NoCoverage] ConditionalExpression
src/middleware/rbac.mjs:13:9
  */
 export function requireRoles(...allowedRoles) {
   return (req, res, next) => {
-    if (!req.user) {
+    if (false) {
       return res.status(401).json({
         status: 401,

[NoCoverage] ConditionalExpression
src/middleware/rbac.mjs:13:9
  */
 export function requireRoles(...allowedRoles) {
   return (req, res, next) => {
-    if (!req.user) {
+    if (true) {
       return res.status(401).json({
         status: 401,

[NoCoverage] ObjectLiteral
src/middleware/rbac.mjs:14:35
 export function requireRoles(...allowedRoles) {
   return (req, res, next) => {
     if (!req.user) {
-      return res.status(401).json({
-        status: 401,
-        code: "UNAUTHORIZED",
-        error: "Authentication required",
-      });
+      return res.status(401).json({});
     }
 

[NoCoverage] StringLiteral
src/middleware/rbac.mjs:17:16
       return res.status(401).json({
         status: 401,
         code: "UNAUTHORIZED",
-        error: "Authentication required",
+        error: "",
       });
     }

[NoCoverage] ConditionalExpression
src/middleware/rbac.mjs:23:9
 
     const userRole = req.user.role;
 
-    if (!allowedRoles.includes(userRole)) {
+    if (true) {
       return res.status(403).json({
         status: 403,

[NoCoverage] ConditionalExpression
src/middleware/rbac.mjs:23:9
 
     const userRole = req.user.role;
 
-    if (!allowedRoles.includes(userRole)) {
+    if (false) {
       return res.status(403).json({
         status: 403,

[NoCoverage] StringLiteral
src/middleware/rbac.mjs:48:59
 /**
  * Middleware that allows both ADMIN and CUSTOMER roles
  */
-export const requireAuthenticated = requireRoles("ADMIN", "CUSTOMER");
+export const requireAuthenticated = requireRoles("ADMIN", "");
 
