[NoCoverage] ConditionalExpression
src/infra/redis.mjs:10:13
 const redisConfig = process.env.REDIS_URL
   ? process.env.REDIS_URL
   : {
-      host: process.env.REDIS_HOST || "127.0.0.1",
+      host: true,
       port: parseInt(process.env.REDIS_PORT || "6379", 10),
       password: process.env.REDIS_PASSWORD || undefined,

[NoCoverage] ConditionalExpression
src/infra/redis.mjs:10:13
 const redisConfig = process.env.REDIS_URL
   ? process.env.REDIS_URL
   : {
-      host: process.env.REDIS_HOST || "127.0.0.1",
+      host: false,
       port: parseInt(process.env.REDIS_PORT || "6379", 10),
       password: process.env.REDIS_PASSWORD || undefined,

[NoCoverage] LogicalOperator
src/infra/redis.mjs:11:22
   ? process.env.REDIS_URL
   : {
       host: process.env.REDIS_HOST || "127.0.0.1",
-      port: parseInt(process.env.REDIS_PORT || "6379", 10),
+      port: parseInt(process.env.REDIS_PORT && "6379", 10),
       password: process.env.REDIS_PASSWORD || undefined,
       db: parseInt(process.env.REDIS_DB || "0", 10),

[NoCoverage] ConditionalExpression
src/infra/redis.mjs:11:22
   ? process.env.REDIS_URL
   : {
       host: process.env.REDIS_HOST || "127.0.0.1",
-      port: parseInt(process.env.REDIS_PORT || "6379", 10),
+      port: parseInt(true, 10),
       password: process.env.REDIS_PASSWORD || undefined,
       db: parseInt(process.env.REDIS_DB || "0", 10),

[NoCoverage] LogicalOperator
src/infra/redis.mjs:12:17
   : {
       host: process.env.REDIS_HOST || "127.0.0.1",
       port: parseInt(process.env.REDIS_PORT || "6379", 10),
-      password: process.env.REDIS_PASSWORD || undefined,
+      password: process.env.REDIS_PASSWORD && undefined,
       db: parseInt(process.env.REDIS_DB || "0", 10),
       maxRetriesPerRequest: 3,

[NoCoverage] ConditionalExpression
src/infra/redis.mjs:12:17
   : {
       host: process.env.REDIS_HOST || "127.0.0.1",
       port: parseInt(process.env.REDIS_PORT || "6379", 10),
-      password: process.env.REDIS_PASSWORD || undefined,
+      password: true,
       db: parseInt(process.env.REDIS_DB || "0", 10),
       maxRetriesPerRequest: 3,

[NoCoverage] LogicalOperator
src/infra/redis.mjs:13:20
       host: process.env.REDIS_HOST || "127.0.0.1",
       port: parseInt(process.env.REDIS_PORT || "6379", 10),
       password: process.env.REDIS_PASSWORD || undefined,
-      db: parseInt(process.env.REDIS_DB || "0", 10),
+      db: parseInt(process.env.REDIS_DB && "0", 10),
       maxRetriesPerRequest: 3,
       retryDelayOnFailover: 100,

[NoCoverage] ConditionalExpression
src/infra/redis.mjs:13:20
       host: process.env.REDIS_HOST || "127.0.0.1",
       port: parseInt(process.env.REDIS_PORT || "6379", 10),
       password: process.env.REDIS_PASSWORD || undefined,
-      db: parseInt(process.env.REDIS_DB || "0", 10),
+      db: parseInt(false, 10),
       maxRetriesPerRequest: 3,
       retryDelayOnFailover: 100,

[NoCoverage] BlockStatement
src/infra/redis.mjs:24:47
  * Gracefully close Redis connections
  * Should be called on application shutdown
  */
-export async function closeRedisConnections() {
-  await redis.quit();
-}
+export async function closeRedisConnections() {}
 
