[NoCoverage] LogicalOperator
src/middleware/signature.mjs:13:7
     "x-nonce": nonce,
   } = req.headers;
 
-  if (!signature || !version || !timestamp || !nonce) {
+  if ((!signature || !version || !timestamp) && !nonce) {
     return res.status(401).json({ error: "Missing signature headers" });
   }

[NoCoverage] BooleanLiteral
src/middleware/signature.mjs:13:47
     "x-nonce": nonce,
   } = req.headers;
 
-  if (!signature || !version || !timestamp || !nonce) {
+  if (!signature || !version || !timestamp || nonce) {
     return res.status(401).json({ error: "Missing signature headers" });
   }

[NoCoverage] ObjectLiteral
src/middleware/signature.mjs:14:33
   } = req.headers;
 
   if (!signature || !version || !timestamp || !nonce) {
-    return res.status(401).json({ error: "Missing signature headers" });
+    return res.status(401).json({});
   }
 

[NoCoverage] EqualityOperator
src/middleware/signature.mjs:17:7
     return res.status(401).json({ error: "Missing signature headers" });
   }
 
-  if (version !== "v1") {
+  if (version === "v1") {
     return res.status(401).json({ error: "Unsupported signature version" });
   }

[NoCoverage] ConditionalExpression
src/middleware/signature.mjs:17:7
     return res.status(401).json({ error: "Missing signature headers" });
   }
 
-  if (version !== "v1") {
+  if (true) {
     return res.status(401).json({ error: "Unsupported signature version" });
   }

[NoCoverage] BlockStatement
src/middleware/signature.mjs:24:48
   const now = Date.now();
   const ttl = Number(process.env.SIGNATURE_TTL_MS);
 
-  if (Math.abs(now - Number(timestamp)) > ttl) {
-    return res.status(401).json({ error: "Request expired" });
-  }
+  if (Math.abs(now - Number(timestamp)) > ttl) {}
 
   // 🔒 Replay protection

[NoCoverage] ArithmeticOperator
src/middleware/signature.mjs:24:16
   const now = Date.now();
   const ttl = Number(process.env.SIGNATURE_TTL_MS);
 
-  if (Math.abs(now - Number(timestamp)) > ttl) {
+  if (Math.abs(now + Number(timestamp)) > ttl) {
     return res.status(401).json({ error: "Request expired" });
   }

[NoCoverage] BlockStatement
src/middleware/signature.mjs:32:13
   const nonceKey = `nonce:${nonce}`;
   const seen = await redis.get(nonceKey);
 
-  if (seen) {
-    return res.status(401).json({ error: "Replay detected" });
-  }
+  if (seen) {}
 
   await redis.set(nonceKey, "1", "PX", ttl);

[NoCoverage] ConditionalExpression
src/middleware/signature.mjs:32:7
   const nonceKey = `nonce:${nonce}`;
   const seen = await redis.get(nonceKey);
 
-  if (seen) {
+  if (true) {
     return res.status(401).json({ error: "Replay detected" });
   }

[NoCoverage] ObjectLiteral
src/middleware/signature.mjs:33:33
   const seen = await redis.get(nonceKey);
 
   if (seen) {
-    return res.status(401).json({ error: "Replay detected" });
+    return res.status(401).json({});
   }
 

[NoCoverage] StringLiteral
src/middleware/signature.mjs:36:29
     return res.status(401).json({ error: "Replay detected" });
   }
 
-  await redis.set(nonceKey, "1", "PX", ttl);
+  await redis.set(nonceKey, "", "PX", ttl);
 
   const payload = [

[NoCoverage] ArrayDeclaration
src/middleware/signature.mjs:38:19
 
   await redis.set(nonceKey, "1", "PX", ttl);
 
-  const payload = [
-    req.method.toUpperCase(),
-    req.originalUrl,
-    timestamp,
-    nonce,
-    canonicalJson(req.body),
-  ].join("|");
+  const payload = [].join("|");
 
   const expected = crypto

[NoCoverage] MethodExpression
src/middleware/signature.mjs:39:5
   await redis.set(nonceKey, "1", "PX", ttl);
 
   const payload = [
-    req.method.toUpperCase(),
+    req.method.toLowerCase(),
     req.originalUrl,
     timestamp,

[NoCoverage] StringLiteral
src/middleware/signature.mjs:47:17
   ].join("|");
 
   const expected = crypto
-    .createHmac("sha256", process.env.REQUEST_SIGNING_SECRET)
+    .createHmac("", process.env.REQUEST_SIGNING_SECRET)
     .update(payload)
     .digest();

[NoCoverage] LogicalOperator
src/middleware/signature.mjs:55:5
 
   // Constant-time comparison
   if (
-    provided.length !== expected.length ||
-    !crypto.timingSafeEqual(provided, expected)
+    provided.length !== expected.length && !crypto.timingSafeEqual(provided, expected)
   ) {
     return res.status(401).json({ error: "Invalid signature" });

[NoCoverage] EqualityOperator
src/middleware/signature.mjs:55:5
 
   // Constant-time comparison
   if (
-    provided.length !== expected.length ||
+    provided.length === expected.length ||
     !crypto.timingSafeEqual(provided, expected)
   ) {

[NoCoverage] BooleanLiteral
src/middleware/signature.mjs:56:5
   // Constant-time comparison
   if (
     provided.length !== expected.length ||
-    !crypto.timingSafeEqual(provided, expected)
+    crypto.timingSafeEqual(provided, expected)
   ) {
     return res.status(401).json({ error: "Invalid signature" });

[NoCoverage] BlockStatement
src/middleware/signature.mjs:57:5
   if (
     provided.length !== expected.length ||
     !crypto.timingSafeEqual(provided, expected)
-  ) {
-    return res.status(401).json({ error: "Invalid signature" });
-  }
+  ) {}
 
   next();
