[Killed] BlockStatement
src/middleware/auth.mjs:7:57
 export default async function auth(req, res, next) {
   const authHeader = req.headers.authorization;
 
-  if (!authHeader || !authHeader.startsWith("Bearer ")) {
-    return res.status(401).json({
-      status: 401,
-      code: "UNAUTHORIZED",
-      error: "Missing or invalid Authorization header",
-    });
-  }
+  if (!authHeader || !authHeader.startsWith("Bearer ")) {}
 
   const token = authHeader.split(" ")[1];
killedBy: Auth Middleware should return 401 if header is missing
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BooleanLiteral
src/middleware/auth.mjs:7:22
 export default async function auth(req, res, next) {
   const authHeader = req.headers.authorization;
 
-  if (!authHeader || !authHeader.startsWith("Bearer ")) {
+  if (!authHeader || authHeader.startsWith("Bearer ")) {
     return res.status(401).json({
       status: 401,
killedBy: Auth Middleware should return 401 if header is invalid format
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] StringLiteral
src/middleware/auth.mjs:15:34
     });
   }
 
-  const token = authHeader.split(" ")[1];
+  const token = authHeader.split("")[1];
 
   try {

[Killed] StringLiteral
src/middleware/auth.mjs:32:16
       return res.status(401).json({
         status: 401,
         code: "UNAUTHORIZED",
-        error: "User not found",
+        error: "",
       });
     }
killedBy: Auth Middleware should return 401 if user not found
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/middleware/auth.mjs:37:9
     }
 
     // Check if account is frozen
-    if (user.account?.status === "FROZEN") {
+    if (false) {
       return res.status(403).json({
         status: 403,
killedBy: Auth Middleware should return 403 if account is frozen
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Number of calls: 0

[Killed] ConditionalExpression
src/middleware/auth.mjs:37:9
     }
 
     // Check if account is frozen
-    if (user.account?.status === "FROZEN") {
+    if (true) {
       return res.status(403).json({
         status: 403,
killedBy: Auth Middleware should call next() and set req.user if valid
statusReason: expected "vi.fn()" to be called at least once

[Killed] ObjectLiteral
src/middleware/auth.mjs:38:35
 
     // Check if account is frozen
     if (user.account?.status === "FROZEN") {
-      return res.status(403).json({
-        status: 403,
-        code: "ACCOUNT_FROZEN",
-        error: "Account is frozen",
-      });
+      return res.status(403).json({});
     }
 
killedBy: Auth Middleware should return 403 if account is frozen
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] StringLiteral
src/middleware/auth.mjs:40:15
     if (user.account?.status === "FROZEN") {
       return res.status(403).json({
         status: 403,
-        code: "ACCOUNT_FROZEN",
+        code: "",
         error: "Account is frozen",
       });

[Killed] ObjectLiteral
src/middleware/auth.mjs:45:16
       });
     }
 
-    req.user = {
-      id: user.id,
-      email: user.email,
-      role: user.role,
-      account: user.account,
-    };
+    req.user = {};
     next();
   } catch (err) {
killedBy: Auth Middleware should call next() and set req.user if valid
statusReason: expected {} to deeply equal { id: 'user-123', …(3) }

[Killed] BlockStatement
src/middleware/auth.mjs:52:17
       account: user.account,
     };
     next();
-  } catch (err) {
-    return res.status(401).json({
-      status: 401,
-      code: "UNAUTHORIZED",
-      error: "Invalid or expired token",
-    });
-  }
+  } catch (err) {}
 }
 
killedBy: Auth Middleware should return 401 if token is invalid
statusReason: expected "vi.fn()" to be called with arguments: [ 401 ]

Number of calls: 0

[Survived] StringLiteral
src/middleware/auth.mjs:55:13
   } catch (err) {
     return res.status(401).json({
       status: 401,
-      code: "UNAUTHORIZED",
+      code: "",
       error: "Invalid or expired token",
     });
