[NoCoverage] StringLiteral
src/middleware/healthCheck.mjs:10:13
  */
 export const HealthStatus = {
   HEALTHY: "healthy",
-  DEGRADED: "degraded",
+  DEGRADED: "",
   UNHEALTHY: "unhealthy",
 };

[NoCoverage] StringLiteral
src/middleware/healthCheck.mjs:11:14
 export const HealthStatus = {
   HEALTHY: "healthy",
   DEGRADED: "degraded",
-  UNHEALTHY: "unhealthy",
+  UNHEALTHY: "",
 };
 

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:17:35
 /**
  * Check database connectivity
  */
-const checkDatabase = async () => {
-  const start = Date.now();
-  try {
-    await prisma.$queryRaw`SELECT 1`;
-    return {
-      status: HealthStatus.HEALTHY,
-      latencyMs: Date.now() - start,
-    };
-  } catch (error) {
-    logger.error({ error: error.message }, "Database health check failed");
-    return {
-      status: HealthStatus.UNHEALTHY,
-      latencyMs: Date.now() - start,
-      error: error.message,
-    };
-  }
-};
+const checkDatabase = async () => {};
 
 /**

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:19:7
  */
 const checkDatabase = async () => {
   const start = Date.now();
-  try {
-    await prisma.$queryRaw`SELECT 1`;
-    return {
-      status: HealthStatus.HEALTHY,
-      latencyMs: Date.now() - start,
-    };
-  } catch (error) {
+  try {} catch (error) {
     logger.error({ error: error.message }, "Database health check failed");
     return {

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:23:18
     await prisma.$queryRaw`SELECT 1`;
     return {
       status: HealthStatus.HEALTHY,
-      latencyMs: Date.now() - start,
+      latencyMs: Date.now() + start,
     };
   } catch (error) {

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:25:19
       status: HealthStatus.HEALTHY,
       latencyMs: Date.now() - start,
     };
-  } catch (error) {
-    logger.error({ error: error.message }, "Database health check failed");
-    return {
-      status: HealthStatus.UNHEALTHY,
-      latencyMs: Date.now() - start,
-      error: error.message,
-    };
-  }
+  } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:27:12
     };
   } catch (error) {
     logger.error({ error: error.message }, "Database health check failed");
-    return {
-      status: HealthStatus.UNHEALTHY,
-      latencyMs: Date.now() - start,
-      error: error.message,
-    };
+    return {};
   }
 };

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:29:18
     logger.error({ error: error.message }, "Database health check failed");
     return {
       status: HealthStatus.UNHEALTHY,
-      latencyMs: Date.now() - start,
+      latencyMs: Date.now() + start,
       error: error.message,
     };

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:38:32
 /**
  * Check Redis connectivity
  */
-const checkRedis = async () => {
-  const start = Date.now();
-  try {
-    await redis.ping();
-    return {
-      status: HealthStatus.HEALTHY,
-      latencyMs: Date.now() - start,
-    };
-  } catch (error) {
-    logger.error({ error: error.message }, "Redis health check failed");
-    return {
-      status: HealthStatus.UNHEALTHY,
-      latencyMs: Date.now() - start,
-      error: error.message,
-    };
-  }
-};
+const checkRedis = async () => {};
 
 /**

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:40:7
  */
 const checkRedis = async () => {
   const start = Date.now();
-  try {
-    await redis.ping();
-    return {
-      status: HealthStatus.HEALTHY,
-      latencyMs: Date.now() - start,
-    };
-  } catch (error) {
+  try {} catch (error) {
     logger.error({ error: error.message }, "Redis health check failed");
     return {

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:46:19
       status: HealthStatus.HEALTHY,
       latencyMs: Date.now() - start,
     };
-  } catch (error) {
-    logger.error({ error: error.message }, "Redis health check failed");
-    return {
-      status: HealthStatus.UNHEALTHY,
-      latencyMs: Date.now() - start,
-      error: error.message,
-    };
-  }
+  } catch (error) {}
 };
 

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:59:48
 /**
  * Calculate overall health from component statuses
  */
-const calculateOverallHealth = (components) => {
-  const statuses = Object.values(components).map((c) => c.status);
-
-  if (statuses.every((s) => s === HealthStatus.HEALTHY)) {
-    return HealthStatus.HEALTHY;
-  }
-
-  if (statuses.some((s) => s === HealthStatus.UNHEALTHY)) {
-    // If critical components are down, we're unhealthy
-    if (
-      components.database?.status === HealthStatus.UNHEALTHY ||
-      components.redis?.status === HealthStatus.UNHEALTHY
-    ) {
-      return HealthStatus.UNHEALTHY;
-    }
-    return HealthStatus.DEGRADED;
-  }
-
-  return HealthStatus.DEGRADED;
-};
+const calculateOverallHealth = (components) => {};
 
 /**

[NoCoverage] ArrowFunction
src/middleware/healthCheck.mjs:60:50
  * Calculate overall health from component statuses
  */
 const calculateOverallHealth = (components) => {
-  const statuses = Object.values(components).map((c) => c.status);
+  const statuses = Object.values(components).map(() => undefined);
 
   if (statuses.every((s) => s === HealthStatus.HEALTHY)) {

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:62:7
 const calculateOverallHealth = (components) => {
   const statuses = Object.values(components).map((c) => c.status);
 
-  if (statuses.every((s) => s === HealthStatus.HEALTHY)) {
+  if (true) {
     return HealthStatus.HEALTHY;
   }

[NoCoverage] ArrowFunction
src/middleware/healthCheck.mjs:62:22
 const calculateOverallHealth = (components) => {
   const statuses = Object.values(components).map((c) => c.status);
 
-  if (statuses.every((s) => s === HealthStatus.HEALTHY)) {
+  if (statuses.every(() => undefined)) {
     return HealthStatus.HEALTHY;
   }

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:66:28
     return HealthStatus.HEALTHY;
   }
 
-  if (statuses.some((s) => s === HealthStatus.UNHEALTHY)) {
+  if (statuses.some((s) => false)) {
     // If critical components are down, we're unhealthy
     if (

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:66:7
     return HealthStatus.HEALTHY;
   }
 
-  if (statuses.some((s) => s === HealthStatus.UNHEALTHY)) {
+  if (false) {
     // If critical components are down, we're unhealthy
     if (

[NoCoverage] EqualityOperator
src/middleware/healthCheck.mjs:69:7
   if (statuses.some((s) => s === HealthStatus.UNHEALTHY)) {
     // If critical components are down, we're unhealthy
     if (
-      components.database?.status === HealthStatus.UNHEALTHY ||
+      components.database?.status !== HealthStatus.UNHEALTHY ||
       components.redis?.status === HealthStatus.UNHEALTHY
     ) {

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:69:7
   if (statuses.some((s) => s === HealthStatus.UNHEALTHY)) {
     // If critical components are down, we're unhealthy
     if (
-      components.database?.status === HealthStatus.UNHEALTHY ||
-      components.redis?.status === HealthStatus.UNHEALTHY
+      true
     ) {
       return HealthStatus.UNHEALTHY;

[NoCoverage] EqualityOperator
src/middleware/healthCheck.mjs:70:7
     // If critical components are down, we're unhealthy
     if (
       components.database?.status === HealthStatus.UNHEALTHY ||
-      components.redis?.status === HealthStatus.UNHEALTHY
+      components.redis?.status !== HealthStatus.UNHEALTHY
     ) {
       return HealthStatus.UNHEALTHY;

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:70:7
     // If critical components are down, we're unhealthy
     if (
       components.database?.status === HealthStatus.UNHEALTHY ||
-      components.redis?.status === HealthStatus.UNHEALTHY
+      false
     ) {
       return HealthStatus.UNHEALTHY;

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:71:7
     if (
       components.database?.status === HealthStatus.UNHEALTHY ||
       components.redis?.status === HealthStatus.UNHEALTHY
-    ) {
-      return HealthStatus.UNHEALTHY;
-    }
+    ) {}
     return HealthStatus.DEGRADED;
   }

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:84:46
  * Simple liveness probe - is the process running?
  * Kubernetes: livenessProbe
  */
-export const livenessHandler = (req, res) => {
-  res.status(200).json({
-    status: 200,
-    code: "OK",
-    data: {
-      alive: true,
-      timestamp: new Date().toISOString(),
-    },
-  });
-};
+export const livenessHandler = (req, res) => {};
 
 /**

[NoCoverage] BooleanLiteral
src/middleware/healthCheck.mjs:89:14
     status: 200,
     code: "OK",
     data: {
-      alive: true,
+      alive: false,
       timestamp: new Date().toISOString(),
     },

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:100:7
  * Kubernetes: readinessProbe
  */
 export const readinessHandler = async (req, res) => {
-  try {
-    const components = {
-      database: await checkDatabase(),
-      redis: await checkRedis(),
-    };
-
-    const overallStatus = calculateOverallHealth(components);
-    const isReady = overallStatus !== HealthStatus.UNHEALTHY;
-
-    const response = {
-      status: isReady ? 200 : 503,
-      code: isReady ? "OK" : "SERVICE_UNAVAILABLE",
-      data: {
-        ready: isReady,
-        status: overallStatus,
-        timestamp: new Date().toISOString(),
-        components,
-      },
-    };
-
-    res.status(response.status).json(response);
-  } catch (error) {
+  try {} catch (error) {
     logger.error({ error: error.message }, "Readiness check error");
     res.status(503).json({

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:101:24
  */
 export const readinessHandler = async (req, res) => {
   try {
-    const components = {
-      database: await checkDatabase(),
-      redis: await checkRedis(),
-    };
+    const components = {};
 
     const overallStatus = calculateOverallHealth(components);

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:107:21
     };
 
     const overallStatus = calculateOverallHealth(components);
-    const isReady = overallStatus !== HealthStatus.UNHEALTHY;
+    const isReady = false;
 
     const response = {

[NoCoverage] EqualityOperator
src/middleware/healthCheck.mjs:107:21
     };
 
     const overallStatus = calculateOverallHealth(components);
-    const isReady = overallStatus !== HealthStatus.UNHEALTHY;
+    const isReady = overallStatus === HealthStatus.UNHEALTHY;
 
     const response = {

[NoCoverage] StringLiteral
src/middleware/healthCheck.mjs:111:30
 
     const response = {
       status: isReady ? 200 : 503,
-      code: isReady ? "OK" : "SERVICE_UNAVAILABLE",
+      code: isReady ? "OK" : "",
       data: {
         ready: isReady,

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:121:19
     };
 
     res.status(response.status).json(response);
-  } catch (error) {
-    logger.error({ error: error.message }, "Readiness check error");
-    res.status(503).json({
-      status: 503,
-      code: "SERVICE_UNAVAILABLE",
-      data: {
-        ready: false,
-        status: HealthStatus.UNHEALTHY,
-        error: "Health check failed",
-        timestamp: new Date().toISOString(),
-      },
-    });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:122:18
 
     res.status(response.status).json(response);
   } catch (error) {
-    logger.error({ error: error.message }, "Readiness check error");
+    logger.error({}, "Readiness check error");
     res.status(503).json({
       status: 503,

[NoCoverage] BooleanLiteral
src/middleware/healthCheck.mjs:127:16
       status: 503,
       code: "SERVICE_UNAVAILABLE",
       data: {
-        ready: false,
+        ready: true,
         status: HealthStatus.UNHEALTHY,
         error: "Health check failed",

[NoCoverage] StringLiteral
src/middleware/healthCheck.mjs:129:16
       data: {
         ready: false,
         status: HealthStatus.UNHEALTHY,
-        error: "Health check failed",
+        error: "",
         timestamp: new Date().toISOString(),
       },

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:148:7
 
     const overallStatus = calculateOverallHealth(components);
     const httpStatus =
-      overallStatus === HealthStatus.HEALTHY
+      false
         ? 200
         : overallStatus === HealthStatus.DEGRADED

[NoCoverage] EqualityOperator
src/middleware/healthCheck.mjs:148:7
 
     const overallStatus = calculateOverallHealth(components);
     const httpStatus =
-      overallStatus === HealthStatus.HEALTHY
+      overallStatus !== HealthStatus.HEALTHY
         ? 200
         : overallStatus === HealthStatus.DEGRADED

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:150:11
     const httpStatus =
       overallStatus === HealthStatus.HEALTHY
         ? 200
-        : overallStatus === HealthStatus.DEGRADED
+        : false
           ? 200
           : 503;

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:150:11
     const httpStatus =
       overallStatus === HealthStatus.HEALTHY
         ? 200
-        : overallStatus === HealthStatus.DEGRADED
+        : true
           ? 200
           : 503;

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:156:13
 
     const response = {
       status: httpStatus,
-      code: httpStatus === 200 ? "OK" : "SERVICE_UNAVAILABLE",
+      code: false ? "OK" : "SERVICE_UNAVAILABLE",
       data: {
         service: "wallet-api",

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:156:13
 
     const response = {
       status: httpStatus,
-      code: httpStatus === 200 ? "OK" : "SERVICE_UNAVAILABLE",
+      code: true ? "OK" : "SERVICE_UNAVAILABLE",
       data: {
         service: "wallet-api",

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:157:13
     const response = {
       status: httpStatus,
       code: httpStatus === 200 ? "OK" : "SERVICE_UNAVAILABLE",
-      data: {
-        service: "wallet-api",
-        version: process.env.npm_package_version || "1.0.0",
-        status: overallStatus,
-        timestamp: new Date().toISOString(),
-        uptime: Math.floor(process.uptime()),
-        components,
-        process: {
-          pid: process.pid,
-          memoryUsage: {
-            heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
-            heapTotal: Math.round(
-              process.memoryUsage().heapTotal / 1024 / 1024
-            ),
-            rss: Math.round(process.memoryUsage().rss / 1024 / 1024),
-          },
-        },
-      },
+      data: {},
     };
 

[NoCoverage] StringLiteral
src/middleware/healthCheck.mjs:158:18
       status: httpStatus,
       code: httpStatus === 200 ? "OK" : "SERVICE_UNAVAILABLE",
       data: {
-        service: "wallet-api",
+        service: "",
         version: process.env.npm_package_version || "1.0.0",
         status: overallStatus,

[NoCoverage] LogicalOperator
src/middleware/healthCheck.mjs:159:18
       code: httpStatus === 200 ? "OK" : "SERVICE_UNAVAILABLE",
       data: {
         service: "wallet-api",
-        version: process.env.npm_package_version || "1.0.0",
+        version: process.env.npm_package_version && "1.0.0",
         status: overallStatus,
         timestamp: new Date().toISOString(),

[NoCoverage] ConditionalExpression
src/middleware/healthCheck.mjs:159:18
       code: httpStatus === 200 ? "OK" : "SERVICE_UNAVAILABLE",
       data: {
         service: "wallet-api",
-        version: process.env.npm_package_version || "1.0.0",
+        version: false,
         status: overallStatus,
         timestamp: new Date().toISOString(),

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:164:18
         timestamp: new Date().toISOString(),
         uptime: Math.floor(process.uptime()),
         components,
-        process: {
-          pid: process.pid,
-          memoryUsage: {
-            heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
-            heapTotal: Math.round(
-              process.memoryUsage().heapTotal / 1024 / 1024
-            ),
-            rss: Math.round(process.memoryUsage().rss / 1024 / 1024),
-          },
-        },
+        process: {},
       },
     };

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:166:24
         components,
         process: {
           pid: process.pid,
-          memoryUsage: {
-            heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
-            heapTotal: Math.round(
-              process.memoryUsage().heapTotal / 1024 / 1024
-            ),
-            rss: Math.round(process.memoryUsage().rss / 1024 / 1024),
-          },
+          memoryUsage: {},
         },
       },

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:167:34
         process: {
           pid: process.pid,
           memoryUsage: {
-            heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
+            heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 * 1024),
             heapTotal: Math.round(
               process.memoryUsage().heapTotal / 1024 / 1024

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:167:34
         process: {
           pid: process.pid,
           memoryUsage: {
-            heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
+            heapUsed: Math.round(process.memoryUsage().heapUsed * 1024 / 1024),
             heapTotal: Math.round(
               process.memoryUsage().heapTotal / 1024 / 1024

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:169:15
           memoryUsage: {
             heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
             heapTotal: Math.round(
-              process.memoryUsage().heapTotal / 1024 / 1024
+              process.memoryUsage().heapTotal / 1024 * 1024
             ),
             rss: Math.round(process.memoryUsage().rss / 1024 / 1024),

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:169:15
           memoryUsage: {
             heapUsed: Math.round(process.memoryUsage().heapUsed / 1024 / 1024),
             heapTotal: Math.round(
-              process.memoryUsage().heapTotal / 1024 / 1024
+              process.memoryUsage().heapTotal * 1024 / 1024
             ),
             rss: Math.round(process.memoryUsage().rss / 1024 / 1024),

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:171:29
             heapTotal: Math.round(
               process.memoryUsage().heapTotal / 1024 / 1024
             ),
-            rss: Math.round(process.memoryUsage().rss / 1024 / 1024),
+            rss: Math.round(process.memoryUsage().rss * 1024 / 1024),
           },
         },

[NoCoverage] ArithmeticOperator
src/middleware/healthCheck.mjs:171:29
             heapTotal: Math.round(
               process.memoryUsage().heapTotal / 1024 / 1024
             ),
-            rss: Math.round(process.memoryUsage().rss / 1024 / 1024),
+            rss: Math.round(process.memoryUsage().rss / 1024 * 1024),
           },
         },

[NoCoverage] BlockStatement
src/middleware/healthCheck.mjs:178:19
     };
 
     res.status(httpStatus).json(response);
-  } catch (error) {
-    logger.error({ error: error.message }, "Health check error");
-    res.status(503).json({
-      status: 503,
-      code: "SERVICE_UNAVAILABLE",
-      data: {
-        status: HealthStatus.UNHEALTHY,
-        error: "Health check failed",
-        timestamp: new Date().toISOString(),
-      },
-    });
-  }
+  } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:179:18
 
     res.status(httpStatus).json(response);
   } catch (error) {
-    logger.error({ error: error.message }, "Health check error");
+    logger.error({}, "Health check error");
     res.status(503).json({
       status: 503,

[NoCoverage] ObjectLiteral
src/middleware/healthCheck.mjs:183:13
     res.status(503).json({
       status: 503,
       code: "SERVICE_UNAVAILABLE",
-      data: {
-        status: HealthStatus.UNHEALTHY,
-        error: "Health check failed",
-        timestamp: new Date().toISOString(),
-      },
+      data: {},
     });
   }
