[Killed] StringLiteral
src/services/auth.service.mjs:6:24
 import { prisma } from "../infra/prisma.mjs";
 
 const SALT_ROUNDS = 12;
-const JWT_EXPIRES_IN = "24h";
+const JWT_EXPIRES_IN = "";
 
 /**
killedBy: Auth Service generateToken should generate valid JWT
statusReason: "expiresIn" should be a number of seconds or string representing a timespan

[Killed] BlockStatement
src/services/auth.service.mjs:13:46
  * @param {string} password - Plain text password
  * @returns {Promise<string>} - Hashed password
  */
-export async function hashPassword(password) {
-  return bcrypt.hash(password, SALT_ROUNDS);
-}
+export async function hashPassword(password) {}
 
 /**
killedBy: Auth Service hashPassword should hash password
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/services/auth.service.mjs:23:54
  * @param {string} hash - Hashed password
  * @returns {Promise<boolean>} - True if password matches
  */
-export async function verifyPassword(password, hash) {
-  return bcrypt.compare(password, hash);
-}
+export async function verifyPassword(password, hash) {}
 
 /**
killedBy: Auth Service verifyPassword should return true for correct password
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/services/auth.service.mjs:32:37
  * @param {Object} user - User object
  * @returns {string} - JWT token
  */
-export function generateToken(user) {
-  return jwt.sign(
-    {
-      sub: user.id,
-      email: user.email,
-      role: user.role,
-    },
-    process.env.JWT_SECRET,
-    { expiresIn: JWT_EXPIRES_IN }
-  );
-}
+export function generateToken(user) {}
 
 /**
killedBy: Auth Service generateToken should generate valid JWT
statusReason: jwt must be provided

[Survived] ObjectLiteral
src/services/auth.service.mjs:40:5
       role: user.role,
     },
     process.env.JWT_SECRET,
-    { expiresIn: JWT_EXPIRES_IN }
+    {}
   );
 }

[Survived] StringLiteral
src/services/auth.service.mjs:52:66
  * @param {string} [data.currency='USD'] - Default wallet currency
  * @returns {Promise<Object>} - Created user with account
  */
-export async function registerUser({ email, password, currency = "USD" }) {
+export async function registerUser({ email, password, currency = "" }) {
   const existingUser = await prisma.user.findUnique({
     where: { email },

[Killed] ObjectLiteral
src/services/auth.service.mjs:54:12
  */
 export async function registerUser({ email, password, currency = "USD" }) {
   const existingUser = await prisma.user.findUnique({
-    where: { email },
+    where: {},
   });
 
killedBy: Auth Service registerUser should register new user
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/services/auth.service.mjs:57:21
     where: { email },
   });
 
-  if (existingUser) {
-    const error = new Error("Email already registered");
-    error.code = "EMAIL_EXISTS";
-    error.status = 409;
-    throw error;
-  }
+  if (existingUser) {}
 
   const passwordHash = await hashPassword(password);
killedBy: Auth Service registerUser should fail if email exists
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/services/auth.service.mjs:59:18
 
   if (existingUser) {
     const error = new Error("Email already registered");
-    error.code = "EMAIL_EXISTS";
+    error.code = "";
     error.status = 409;
     throw error;

[Survived] ObjectLiteral
src/services/auth.service.mjs:69:13
   // Create user, account, and default wallet in a transaction
   const user = await prisma.$transaction(async (tx) => {
     const newUser = await tx.user.create({
-      data: {
-        email,
-        passwordHash,
-        account: {
-          create: {
-            status: "ACTIVE",
-            wallets: {
-              create: {
-                balance: 0,
-                currency,
-              },
-            },
-          },
-        },
-      },
+      data: {},
       include: {
         account: {

[Survived] ObjectLiteral
src/services/auth.service.mjs:86:20
       },
       include: {
         account: {
-          include: {
-            wallets: true,
-          },
+          include: {},
         },
       },

[Survived] ObjectLiteral
src/services/auth.service.mjs:108:12
  */
 export async function authenticateUser({ email, password }) {
   const user = await prisma.user.findUnique({
-    where: { email },
+    where: {},
     include: {
       account: true,

[Killed] StringLiteral
src/services/auth.service.mjs:115:29
   });
 
   if (!user) {
-    const error = new Error("Invalid email or password");
+    const error = new Error("");
     error.code = "INVALID_CREDENTIALS";
     error.status = 401;
killedBy: Auth Service authenticateUser should fail if user not found
statusReason: expected [Function] to throw error including 'Invalid email or password' but got ''

[Survived] StringLiteral
src/services/auth.service.mjs:116:18
 
   if (!user) {
     const error = new Error("Invalid email or password");
-    error.code = "INVALID_CREDENTIALS";
+    error.code = "";
     error.status = 401;
     throw error;

[Killed] StringLiteral
src/services/auth.service.mjs:124:29
   const isValid = await verifyPassword(password, user.passwordHash);
 
   if (!isValid) {
-    const error = new Error("Invalid email or password");
+    const error = new Error("");
     error.code = "INVALID_CREDENTIALS";
     error.status = 401;
killedBy: Auth Service authenticateUser should fail if password invalid
statusReason: expected [Function] to throw error including 'Invalid email or password' but got ''

[Killed] BlockStatement
src/services/auth.service.mjs:131:42
   }
 
   // Check if account is frozen
-  if (user.account?.status === "FROZEN") {
-    const error = new Error("Account is frozen");
-    error.code = "ACCOUNT_FROZEN";
-    error.status = 403;
-    throw error;
-  }
+  if (user.account?.status === "FROZEN") {}
 
   return user;
killedBy: Auth Service authenticateUser should fail if account frozen
statusReason: promise resolved "{ id: 'u-1', …(2) }" instead of rejecting

[Killed] StringLiteral
src/services/auth.service.mjs:132:29
 
   // Check if account is frozen
   if (user.account?.status === "FROZEN") {
-    const error = new Error("Account is frozen");
+    const error = new Error("");
     error.code = "ACCOUNT_FROZEN";
     error.status = 403;
killedBy: Auth Service authenticateUser should fail if account frozen
statusReason: expected [Function] to throw error including 'Account is frozen' but got ''

[Killed] BlockStatement
src/services/auth.service.mjs:146:43
  * @param {string} userId - User ID
  * @returns {Promise<Object|null>} - User object or null
  */
-export async function getUserById(userId) {
-  return prisma.user.findUnique({
-    where: { id: userId },
-    include: {
-      account: {
-        include: {
-          wallets: true,
-        },
-      },
-    },
-  });
-}
+export async function getUserById(userId) {}
 
killedBy: Auth Service getUserById should return user
statusReason: expected undefined to be { id: 'u-1' } // Object.is equality

[Survived] ObjectLiteral
src/services/auth.service.mjs:147:33
  * @returns {Promise<Object|null>} - User object or null
  */
 export async function getUserById(userId) {
-  return prisma.user.findUnique({
-    where: { id: userId },
-    include: {
-      account: {
-        include: {
-          wallets: true,
-        },
-      },
-    },
-  });
+  return prisma.user.findUnique({});
 }
 
