[NoCoverage] ConditionalExpression
src/middleware/idempotency.mjs:6:7
 export async function idempotency(req, res, next) {
   const { referenceId } = req.body;
 
-  if (!referenceId) {
+  if (false) {
     return res.status(400).json({
       status: 400,

[NoCoverage] BooleanLiteral
src/middleware/idempotency.mjs:6:7
 export async function idempotency(req, res, next) {
   const { referenceId } = req.body;
 
-  if (!referenceId) {
+  if (referenceId) {
     return res.status(400).json({
       status: 400,

[NoCoverage] ObjectLiteral
src/middleware/idempotency.mjs:16:12
 
   // Ensure idempotency is scoped to the user's account
   const exists = await prisma.transaction.findFirst({
-    where: {
-      referenceId,
-      wallet: { accountId: req.user.account.id },
-    },
+    where: {},
   });
 

[NoCoverage] BlockStatement
src/middleware/idempotency.mjs:22:15
     },
   });
 
-  if (exists) {
-    return res.status(409).json({
-      status: 409,
-      code: "CONFLICT",
-      error: "Duplicate transaction: referenceId already exists",
-    });
-  }
+  if (exists) {}
 
   next();
