[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:20:5
 export const requestLogger = (req, res, next) => {
   // Generate or extract correlation ID
   const correlationId =
-    req.headers["x-correlation-id"] ||
-    req.headers["x-request-id"] ||
-    generateCorrelationId();
+    false;
 
   // Attach to request and response

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:20:5
 export const requestLogger = (req, res, next) => {
   // Generate or extract correlation ID
   const correlationId =
-    req.headers["x-correlation-id"] ||
-    req.headers["x-request-id"] ||
+    false ||
     generateCorrelationId();
 

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:21:17
   // Generate or extract correlation ID
   const correlationId =
     req.headers["x-correlation-id"] ||
-    req.headers["x-request-id"] ||
+    req.headers[""] ||
     generateCorrelationId();
 

[NoCoverage] OptionalChaining
src/middleware/requestLogger.mjs:33:19
     method: req.method,
     path: req.path,
     userAgent: req.get("user-agent"),
-    ip: req.ip || req.connection?.remoteAddress,
+    ip: req.ip || req.connection.remoteAddress,
   });
 

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:33:9
     method: req.method,
     path: req.path,
     userAgent: req.get("user-agent"),
-    ip: req.ip || req.connection?.remoteAddress,
+    ip: true,
   });
 

[NoCoverage] ObjectLiteral
src/middleware/requestLogger.mjs:44:5
 
   // Log request start
   req.log.info(
-    {
-      query: Object.keys(req.query).length > 0 ? req.query : undefined,
-      contentLength: req.get("content-length"),
-    },
+    {},
     "Request started"
   );

[NoCoverage] EqualityOperator
src/middleware/requestLogger.mjs:45:14
   // Log request start
   req.log.info(
     {
-      query: Object.keys(req.query).length > 0 ? req.query : undefined,
+      query: Object.keys(req.query).length >= 0 ? req.query : undefined,
       contentLength: req.get("content-length"),
     },

[NoCoverage] EqualityOperator
src/middleware/requestLogger.mjs:45:14
   // Log request start
   req.log.info(
     {
-      query: Object.keys(req.query).length > 0 ? req.query : undefined,
+      query: Object.keys(req.query).length <= 0 ? req.query : undefined,
       contentLength: req.get("content-length"),
     },

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:52:10
   );
 
   // Capture response on finish
-  res.on("finish", async () => {
+  res.on("", async () => {
     const endTime = process.hrtime.bigint();
     const durationMs = Number(endTime - startTime) / 1e6;

[NoCoverage] ArithmeticOperator
src/middleware/requestLogger.mjs:54:24
   // Capture response on finish
   res.on("finish", async () => {
     const endTime = process.hrtime.bigint();
-    const durationMs = Number(endTime - startTime) / 1e6;
+    const durationMs = Number(endTime - startTime) * 1e6;
 
     // Decrement active requests

[NoCoverage] ArithmeticOperator
src/middleware/requestLogger.mjs:54:31
   // Capture response on finish
   res.on("finish", async () => {
     const endTime = process.hrtime.bigint();
-    const durationMs = Number(endTime - startTime) / 1e6;
+    const durationMs = Number(endTime + startTime) / 1e6;
 
     // Decrement active requests

[NoCoverage] ArithmeticOperator
src/middleware/requestLogger.mjs:81:19
     // Log based on status code
     const logData = {
       status: res.statusCode,
-      durationMs: Math.round(durationMs * 100) / 100,
+      durationMs: Math.round(durationMs * 100) * 100,
       contentLength: res.get("content-length"),
     };

[NoCoverage] ArithmeticOperator
src/middleware/requestLogger.mjs:81:30
     // Log based on status code
     const logData = {
       status: res.statusCode,
-      durationMs: Math.round(durationMs * 100) / 100,
+      durationMs: Math.round(durationMs / 100) / 100,
       contentLength: res.get("content-length"),
     };

[NoCoverage] BlockStatement
src/middleware/requestLogger.mjs:85:32
       contentLength: res.get("content-length"),
     };
 
-    if (res.statusCode >= 500) {
-      req.log.error(logData, "Request failed with server error");
-      errorsTotal.inc({ type: "server_error", code: res.statusCode });
-    } else if (res.statusCode >= 400) {
+    if (res.statusCode >= 500) {} else if (res.statusCode >= 400) {
       req.log.warn(logData, "Request failed with client error");
       errorsTotal.inc({ type: "client_error", code: res.statusCode });

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:85:9
       contentLength: res.get("content-length"),
     };
 
-    if (res.statusCode >= 500) {
+    if (false) {
       req.log.error(logData, "Request failed with server error");
       errorsTotal.inc({ type: "server_error", code: res.statusCode });

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:87:31
 
     if (res.statusCode >= 500) {
       req.log.error(logData, "Request failed with server error");
-      errorsTotal.inc({ type: "server_error", code: res.statusCode });
+      errorsTotal.inc({ type: "", code: res.statusCode });
     } else if (res.statusCode >= 400) {
       req.log.warn(logData, "Request failed with client error");

[NoCoverage] EqualityOperator
src/middleware/requestLogger.mjs:88:16
     if (res.statusCode >= 500) {
       req.log.error(logData, "Request failed with server error");
       errorsTotal.inc({ type: "server_error", code: res.statusCode });
-    } else if (res.statusCode >= 400) {
+    } else if (res.statusCode > 400) {
       req.log.warn(logData, "Request failed with client error");
       errorsTotal.inc({ type: "client_error", code: res.statusCode });

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:88:16
     if (res.statusCode >= 500) {
       req.log.error(logData, "Request failed with server error");
       errorsTotal.inc({ type: "server_error", code: res.statusCode });
-    } else if (res.statusCode >= 400) {
+    } else if (false) {
       req.log.warn(logData, "Request failed with client error");
       errorsTotal.inc({ type: "client_error", code: res.statusCode });

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:89:29
       req.log.error(logData, "Request failed with server error");
       errorsTotal.inc({ type: "server_error", code: res.statusCode });
     } else if (res.statusCode >= 400) {
-      req.log.warn(logData, "Request failed with client error");
+      req.log.warn(logData, "");
       errorsTotal.inc({ type: "client_error", code: res.statusCode });
     } else {

[NoCoverage] ObjectLiteral
src/middleware/requestLogger.mjs:90:23
       errorsTotal.inc({ type: "server_error", code: res.statusCode });
     } else if (res.statusCode >= 400) {
       req.log.warn(logData, "Request failed with client error");
-      errorsTotal.inc({ type: "client_error", code: res.statusCode });
+      errorsTotal.inc({});
     } else {
       req.log.info(logData, "Request completed");

[NoCoverage] BlockStatement
src/middleware/requestLogger.mjs:91:12
     } else if (res.statusCode >= 400) {
       req.log.warn(logData, "Request failed with client error");
       errorsTotal.inc({ type: "client_error", code: res.statusCode });
-    } else {
-      req.log.info(logData, "Request completed");
-    }
+    } else {}
 
     // Alert on high latency

[NoCoverage] BlockStatement
src/middleware/requestLogger.mjs:96:28
     }
 
     // Alert on high latency
-    if (durationMs > 5000) {
-      await alertHighLatency(durationMs, normalizedPath, {
-        correlationId,
-        method: req.method,
-      });
-    }
+    if (durationMs > 5000) {}
   });
 

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:96:9
     }
 
     // Alert on high latency
-    if (durationMs > 5000) {
+    if (true) {
       await alertHighLatency(durationMs, normalizedPath, {
         correlationId,

[NoCoverage] BlockStatement
src/middleware/requestLogger.mjs:105:30
   });
 
   // Handle request errors
-  res.on("error", (error) => {
-    req.log.error(
-      {
-        error: error.message,
-        stack: error.stack,
-      },
-      "Request error"
-    );
-    errorsTotal.inc({ type: "request_error", code: "unknown" });
-  });
+  res.on("error", (error) => {});
 
   next();

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:105:10
   });
 
   // Handle request errors
-  res.on("error", (error) => {
+  res.on("", (error) => {
     req.log.error(
       {

[NoCoverage] ObjectLiteral
src/middleware/requestLogger.mjs:107:7
   // Handle request errors
   res.on("error", (error) => {
     req.log.error(
-      {
-        error: error.message,
-        stack: error.stack,
-      },
+      {},
       "Request error"
     );

[NoCoverage] BlockStatement
src/middleware/requestLogger.mjs:123:33
  * Normalize path for metrics to prevent cardinality explosion
  * Replace dynamic segments (UUIDs, IDs) with placeholders
  */
-const normalizePath = (path) => {
-  return (
-    path
-      // Replace UUIDs
-      .replace(
-        /[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/gi,
-        ":id"
-      )
-      // Replace numeric IDs
-      .replace(/\/\d+(?=\/|$)/g, "/:id")
-      // Replace hex strings (32+ chars)
-      .replace(/\/[0-9a-f]{32,}/gi, "/:hash")
-  );
-};
+const normalizePath = (path) => {};
 
 /**

[NoCoverage] Regex
src/middleware/requestLogger.mjs:128:9
     path
       // Replace UUIDs
       .replace(
-        /[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/gi,
+        /[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[^0-9a-f]{4}-[0-9a-f]{12}/gi,
         ":id"
       )

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:134:37
       // Replace numeric IDs
       .replace(/\/\d+(?=\/|$)/g, "/:id")
       // Replace hex strings (32+ chars)
-      .replace(/\/[0-9a-f]{32,}/gi, "/:hash")
+      .replace(/\/[0-9a-f]{32,}/gi, "")
   );
 };

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:143:25
  * Should be registered after routes
  */
 export const errorLogger = (err, req, res, next) => {
-  const correlationId = req.correlationId || generateCorrelationId();
+  const correlationId = false;
 
   logger.error(

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:143:25
  * Should be registered after routes
  */
 export const errorLogger = (err, req, res, next) => {
-  const correlationId = req.correlationId || generateCorrelationId();
+  const correlationId = true;
 
   logger.error(

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:152:19
       stack: err.stack,
       method: req.method,
       path: req.path,
-      statusCode: err.statusCode || 500,
+      statusCode: true,
     },
     "Unhandled error"

[NoCoverage] LogicalOperator
src/middleware/requestLogger.mjs:152:19
       stack: err.stack,
       method: req.method,
       path: req.path,
-      statusCode: err.statusCode || 500,
+      statusCode: err.statusCode && 500,
     },
     "Unhandled error"

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:159:11
 
   errorsTotal.inc({
     type: "unhandled_error",
-    code: err.statusCode || 500,
+    code: true,
   });
 

[NoCoverage] LogicalOperator
src/middleware/requestLogger.mjs:159:11
 
   errorsTotal.inc({
     type: "unhandled_error",
-    code: err.statusCode || 500,
+    code: err.statusCode && 500,
   });
 

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:163:24
   });
 
   // Don't expose internal errors in production
-  const isProduction = process.env.NODE_ENV === "production";
+  const isProduction = false;
 
   res.status(err.statusCode || 500).json({

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:163:24
   });
 
   // Don't expose internal errors in production
-  const isProduction = process.env.NODE_ENV === "production";
+  const isProduction = true;
 
   res.status(err.statusCode || 500).json({

[NoCoverage] LogicalOperator
src/middleware/requestLogger.mjs:165:14
   // Don't expose internal errors in production
   const isProduction = process.env.NODE_ENV === "production";
 
-  res.status(err.statusCode || 500).json({
+  res.status(err.statusCode && 500).json({
     status: err.statusCode || 500,
     code: err.code || "INTERNAL_ERROR",

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:165:14
   // Don't expose internal errors in production
   const isProduction = process.env.NODE_ENV === "production";
 
-  res.status(err.statusCode || 500).json({
+  res.status(false).json({
     status: err.statusCode || 500,
     code: err.code || "INTERNAL_ERROR",

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:166:13
   const isProduction = process.env.NODE_ENV === "production";
 
   res.status(err.statusCode || 500).json({
-    status: err.statusCode || 500,
+    status: false,
     code: err.code || "INTERNAL_ERROR",
     error: isProduction ? "An internal error occurred" : err.message,

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:166:13
   const isProduction = process.env.NODE_ENV === "production";
 
   res.status(err.statusCode || 500).json({
-    status: err.statusCode || 500,
+    status: true,
     code: err.code || "INTERNAL_ERROR",
     error: isProduction ? "An internal error occurred" : err.message,

[NoCoverage] ConditionalExpression
src/middleware/requestLogger.mjs:167:11
 
   res.status(err.statusCode || 500).json({
     status: err.statusCode || 500,
-    code: err.code || "INTERNAL_ERROR",
+    code: true,
     error: isProduction ? "An internal error occurred" : err.message,
     correlationId,

[NoCoverage] LogicalOperator
src/middleware/requestLogger.mjs:167:11
 
   res.status(err.statusCode || 500).json({
     status: err.statusCode || 500,
-    code: err.code || "INTERNAL_ERROR",
+    code: err.code && "INTERNAL_ERROR",
     error: isProduction ? "An internal error occurred" : err.message,
     correlationId,

[NoCoverage] StringLiteral
src/middleware/requestLogger.mjs:168:27
   res.status(err.statusCode || 500).json({
     status: err.statusCode || 500,
     code: err.code || "INTERNAL_ERROR",
-    error: isProduction ? "An internal error occurred" : err.message,
+    error: isProduction ? "" : err.message,
     correlationId,
   });
