[Survived] StringLiteral
src/services/transaction.service.mjs:39:50
     );
 
     if (!wallet) {
-      throw new ServiceError("Wallet not found", "WALLET_NOT_FOUND", 404);
+      throw new ServiceError("Wallet not found", "", 404);
     }
 

[Killed] LogicalOperator
src/services/transaction.service.mjs:104:22
     }
 
     // Debit the wallet
-    const currency = wallet.currency || "USD";
+    const currency = wallet.currency && "USD";
     const balanceM = money(wallet.balance, currency);
     const amountM = money(amount, currency);
killedBy: Transaction Service debit should use default USD currency if missing
statusReason: Cannot read properties of null (reading 'code')

[Survived] ConditionalExpression
src/services/transaction.service.mjs:104:22
     }
 
     // Debit the wallet
-    const currency = wallet.currency || "USD";
+    const currency = false;
     const balanceM = money(wallet.balance, currency);
     const amountM = money(amount, currency);

[Killed] StringLiteral
src/services/transaction.service.mjs:120:13
     const transaction = await txRepo.createTransaction(tx, {
       id: uuid(),
       walletId,
-      type: "debit",
+      type: "",
       amount,
       status: "completed",
killedBy: Transaction Service debit should debit wallet and create completion records
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] StringLiteral
src/services/transaction.service.mjs:167:9
     const existingTx = await txRepo.findByReferenceTx(tx, referenceId);
     if (existingTx) {
       throw new ServiceError(
-        "Duplicate reference ID",
+        "",
         "DUPLICATE_REFERENCE",
         409
killedBy: Transaction Service credit should fail duplicate reference
statusReason: expected [Function] to throw error including 'Duplicate reference ID' but got ''

[Survived] ObjectLiteral
src/services/transaction.service.mjs:197:44
     });
 
     // Create ledger entry
-    await ledgerRepo.createLedgerEntry(tx, {
-      id: uuid(),
-      transactionId: transaction.id,
-      direction: "credit",
-      amount,
-      balanceBefore: wallet.balance,
-      balanceAfter: updatedWallet.balance,
-    });
+    await ledgerRepo.createLedgerEntry(tx, {});
 
     return { transaction, wallet: updatedWallet };

[Killed] BlockStatement
src/services/transaction.service.mjs:221:23
   return prisma.$transaction(async (tx) => {
     const transaction = await txRepo.findByIdTx(tx, transactionId);
 
-    if (!transaction) {
-      throw new ServiceError(
-        "Transaction not found",
-        "TRANSACTION_NOT_FOUND",
-        404
-      );
-    }
+    if (!transaction) {}
 
     // Verify ownership
killedBy: Transaction Service reverse (pending) should fail if transaction not found
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Cannot read properties of null (readi…'

[Survived] StringLiteral
src/services/transaction.service.mjs:224:9
     if (!transaction) {
       throw new ServiceError(
         "Transaction not found",
-        "TRANSACTION_NOT_FOUND",
+        "",
         404
       );

[Killed] ConditionalExpression
src/services/transaction.service.mjs:230:9
     }
 
     // Verify ownership
-    if (transaction.wallet.accountId !== accountId) {
+    if (false) {
       throw new ServiceError(
         "Transaction not found",
killedBy: Transaction Service reverse (pending) should fail if not owner
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Transaction is not pending'

[Killed] BlockStatement
src/services/transaction.service.mjs:230:53
     }
 
     // Verify ownership
-    if (transaction.wallet.accountId !== accountId) {
-      throw new ServiceError(
-        "Transaction not found",
-        "TRANSACTION_NOT_FOUND",
-        404
-      );
-    }
+    if (transaction.wallet.accountId !== accountId) {}
 
     assertTransactionPending(transaction);
killedBy: Transaction Service reverse (pending) should fail if not owner
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Transaction is not pending'

[Killed] ConditionalExpression
src/services/transaction.service.mjs:263:9
   return prisma.$transaction(async (tx) => {
     const transaction = await txRepo.findByIdTx(tx, transactionId);
 
-    if (!transaction) {
+    if (false) {
       throw new ServiceError(
         "Transaction not found",
killedBy: Transaction Service adminReverse should fail if transaction not found
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
src/services/transaction.service.mjs:265:9
 
     if (!transaction) {
       throw new ServiceError(
-        "Transaction not found",
+        "",
         "TRANSACTION_NOT_FOUND",
         404
killedBy: Transaction Service adminReverse should fail if transaction not found
statusReason: expected [Function] to throw error including 'Transaction not found' but got ''

[Killed] ConditionalExpression
src/services/transaction.service.mjs:271:9
       );
     }
 
-    if (transaction.status === "reversed") {
+    if (true) {
       throw new ServiceError(
         "Transaction already reversed",
killedBy: Transaction Service adminReverse should fail if not completed
statusReason: expected [Function] to throw error including 'Only completed transactions can be re…' but got 'Transaction already reversed'

[Killed] ConditionalExpression
src/services/transaction.service.mjs:279:9
       );
     }
 
-    if (transaction.status !== "completed") {
+    if (false) {
       throw new ServiceError(
         "Only completed transactions can be reversed",
killedBy: Transaction Service adminReverse should fail if not completed
statusReason: expected [Function] to throw error including 'Only completed transactions can be re…' but got 'Cannot reverse this transaction type'

[Killed] BlockStatement
src/services/transaction.service.mjs:279:45
       );
     }
 
-    if (transaction.status !== "completed") {
-      throw new ServiceError(
-        "Only completed transactions can be reversed",
-        "INVALID_STATUS",
-        422
-      );
-    }
+    if (transaction.status !== "completed") {}
 
     const wallet = transaction.wallet;
killedBy: Transaction Service adminReverse should fail if not completed
statusReason: expected [Function] to throw error including 'Only completed transactions can be re…' but got 'Cannot reverse this transaction type'

[Killed] StringLiteral
src/services/transaction.service.mjs:281:9
 
     if (transaction.status !== "completed") {
       throw new ServiceError(
-        "Only completed transactions can be reversed",
+        "",
         "INVALID_STATUS",
         422
killedBy: Transaction Service adminReverse should fail if not completed
statusReason: expected [Function] to throw error including 'Only completed transactions can be re…' but got ''

[Killed] BlockStatement
src/services/transaction.service.mjs:293:39
     let newBalance;
     let reversalType;
 
-    if (transaction.type === "debit") {
-      newBalance = wallet.balance + transaction.amount;
-      reversalType = "credit";
-    } else if (transaction.type === "credit") {
+    if (transaction.type === "debit") {} else if (transaction.type === "credit") {
       if (wallet.balance < transaction.amount) {
         throw new ServiceError(
killedBy: Transaction Service adminReverse should reverse a debit transaction
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, …(2) ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] ConditionalExpression
src/services/transaction.service.mjs:293:9
     let newBalance;
     let reversalType;
 
-    if (transaction.type === "debit") {
+    if (false) {
       newBalance = wallet.balance + transaction.amount;
       reversalType = "credit";
killedBy: Transaction Service adminReverse should reverse a debit transaction
statusReason: Cannot reverse this transaction type

[Killed] ArithmeticOperator
src/services/transaction.service.mjs:294:20
     let reversalType;
 
     if (transaction.type === "debit") {
-      newBalance = wallet.balance + transaction.amount;
+      newBalance = wallet.balance - transaction.amount;
       reversalType = "credit";
     } else if (transaction.type === "credit") {
killedBy: Transaction Service adminReverse should reverse a debit transaction
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, …(2) ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] ConditionalExpression
src/services/transaction.service.mjs:296:16
     if (transaction.type === "debit") {
       newBalance = wallet.balance + transaction.amount;
       reversalType = "credit";
-    } else if (transaction.type === "credit") {
+    } else if (false) {
       if (wallet.balance < transaction.amount) {
         throw new ServiceError(
killedBy: Transaction Service adminReverse should reverse a credit transaction
statusReason: Cannot reverse this transaction type

[Killed] EqualityOperator
src/services/transaction.service.mjs:297:11
       newBalance = wallet.balance + transaction.amount;
       reversalType = "credit";
     } else if (transaction.type === "credit") {
-      if (wallet.balance < transaction.amount) {
+      if (wallet.balance <= transaction.amount) {
         throw new ServiceError(
           "Insufficient balance to reverse credit transaction",
killedBy: Transaction Service adminReverse should reverse a credit transaction
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/services/transaction.service.mjs:297:11
       newBalance = wallet.balance + transaction.amount;
       reversalType = "credit";
     } else if (transaction.type === "credit") {
-      if (wallet.balance < transaction.amount) {
+      if (wallet.balance >= transaction.amount) {
         throw new ServiceError(
           "Insufficient balance to reverse credit transaction",
killedBy: Transaction Service adminReverse should reverse a credit transaction
statusReason: Insufficient balance to reverse credit transaction

[Killed] ArithmeticOperator
src/services/transaction.service.mjs:304:20
           422
         );
       }
-      newBalance = wallet.balance - transaction.amount;
+      newBalance = wallet.balance + transaction.amount;
       reversalType = "debit";
     } else {
killedBy: Transaction Service adminReverse should reverse a credit transaction
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/services/transaction.service.mjs:306:12
       }
       newBalance = wallet.balance - transaction.amount;
       reversalType = "debit";
-    } else {
-      throw new ServiceError(
-        "Cannot reverse this transaction type",
-        "INVALID_TRANSACTION_TYPE",
-        422
-      );
-    }
+    } else {}
 
     // Update original transaction status
killedBy: Transaction Service adminReverse should fail if unknown transaction type
statusReason: expected [Function] to throw error including 'Cannot reverse this transaction type' but got 'Cannot read properties of undefined (…'

[Survived] ObjectLiteral
src/services/transaction.service.mjs:335:44
     });
 
     // Create ledger entry
-    await ledgerRepo.createLedgerEntry(tx, {
-      id: uuid(),
-      transactionId: reversalTx.id,
-      direction: reversalType,
-      amount: transaction.amount,
-      balanceBefore: wallet.balance,
-      balanceAfter: newBalance,
-    });
+    await ledgerRepo.createLedgerEntry(tx, {});
 
     return {

[Survived] ObjectLiteral
src/services/transaction.service.mjs:345:28
     });
 
     return {
-      originalTransaction: { ...transaction, status: "reversed" },
+      originalTransaction: {},
       reversalTransaction: reversalTx,
       wallet: updatedWallet,
