[Killed] BlockStatement
src/domain/transactions.mjs:5:42
  * Domain error with code and status
  */
 class DomainError extends Error {
-  constructor(message, code, statusCode) {
-    super(message);
-    this.code = code;
-    this.statusCode = statusCode;
-  }
+  constructor(message, code, statusCode) {}
 }
 
killedBy: Transaction Service reverse (pending) should fail if not pending
statusReason: expected [Function] to throw error including 'Transaction is not pending' but got 'Must call super constructor in derive…'

[Killed] BlockStatement
src/domain/transactions.mjs:17:47
  * @param {Object} txn - Transaction to check
  * @throws {DomainError} If transaction is null or not pending
  */
-export function assertTransactionPending(txn) {
-  if (!txn) {
-    throw new DomainError(
-      "Transaction not found",
-      "TRANSACTION_NOT_FOUND",
-      404
-    );
-  }
-  if (txn.status !== "pending") {
-    throw new DomainError(
-      "Transaction is not pending",
-      "TRANSACTION_NOT_PENDING",
-      422
-    );
-  }
-}
+export function assertTransactionPending(txn) {}
 
 /**
killedBy: Transaction Service reverse (pending) should fail if not pending
statusReason: promise resolved "{ transaction: { id: 'tx-1', …(1) } }" instead of rejecting

[Killed] BlockStatement
src/domain/transactions.mjs:18:13
  * @throws {DomainError} If transaction is null or not pending
  */
 export function assertTransactionPending(txn) {
-  if (!txn) {
-    throw new DomainError(
-      "Transaction not found",
-      "TRANSACTION_NOT_FOUND",
-      404
-    );
-  }
+  if (!txn) {}
   if (txn.status !== "pending") {
     throw new DomainError(
killedBy: Transaction Domain assertTransactionPending should throw error if transaction is null
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/domain/transactions.mjs:18:7
  * @throws {DomainError} If transaction is null or not pending
  */
 export function assertTransactionPending(txn) {
-  if (!txn) {
+  if (false) {
     throw new DomainError(
       "Transaction not found",
killedBy: Transaction Domain assertTransactionPending should throw error if transaction is null
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
src/domain/transactions.mjs:20:7
 export function assertTransactionPending(txn) {
   if (!txn) {
     throw new DomainError(
-      "Transaction not found",
+      "",
       "TRANSACTION_NOT_FOUND",
       404
killedBy: Transaction Domain assertTransactionPending should throw error if transaction is null
statusReason: expected [Function] to throw error including 'Transaction not found' but got ''

[Killed] BlockStatement
src/domain/transactions.mjs:25:33
       404
     );
   }
-  if (txn.status !== "pending") {
-    throw new DomainError(
-      "Transaction is not pending",
-      "TRANSACTION_NOT_PENDING",
-      422
-    );
-  }
+  if (txn.status !== "pending") {}
 }
 
killedBy: Transaction Domain assertTransactionPending should throw error if transaction status is completed
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/transactions.mjs:25:7
       404
     );
   }
-  if (txn.status !== "pending") {
+  if (true) {
     throw new DomainError(
       "Transaction is not pending",
killedBy: Transaction Service reverse (pending) should update status to reversed
statusReason: Transaction is not pending

[Killed] BlockStatement
src/domain/transactions.mjs:39:39
  * @param {Object} txn - Transaction to check
  * @throws {DomainError} If transaction cannot be reversed
  */
-export function assertCanReverse(txn) {
-  if (!txn) {
-    throw new DomainError(
-      "Transaction not found",
-      "TRANSACTION_NOT_FOUND",
-      404
-    );
-  }
-  if (txn.status === "reversed") {
-    throw new DomainError(
-      "Transaction already reversed",
-      "ALREADY_REVERSED",
-      409
-    );
-  }
-  if (txn.status !== "completed") {
-    throw new DomainError(
-      "Only completed transactions can be reversed",
-      "INVALID_STATUS",
-      422
-    );
-  }
-}
+export function assertCanReverse(txn) {}
 
 export { DomainError };
killedBy: Transaction Domain assertCanReverse should throw if transaction is null
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/transactions.mjs:40:7
  * @throws {DomainError} If transaction cannot be reversed
  */
 export function assertCanReverse(txn) {
-  if (!txn) {
+  if (false) {
     throw new DomainError(
       "Transaction not found",
killedBy: Transaction Domain assertCanReverse should throw if transaction is null
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Cannot read properties of null (readi…'

[Killed] BooleanLiteral
src/domain/transactions.mjs:40:7
  * @throws {DomainError} If transaction cannot be reversed
  */
 export function assertCanReverse(txn) {
-  if (!txn) {
+  if (txn) {
     throw new DomainError(
       "Transaction not found",
killedBy: Transaction Domain assertCanReverse should throw if transaction is null
statusReason: expected [Function] to throw error including 'Transaction not found' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/domain/transactions.mjs:47:34
       404
     );
   }
-  if (txn.status === "reversed") {
-    throw new DomainError(
-      "Transaction already reversed",
-      "ALREADY_REVERSED",
-      409
-    );
-  }
+  if (txn.status === "reversed") {}
   if (txn.status !== "completed") {
     throw new DomainError(
killedBy: Transaction Domain assertCanReverse should throw if transaction is already reversed
statusReason: expected [Function] to throw error including 'Transaction already reversed' but got 'Only completed transactions can be re…'

[Killed] ConditionalExpression
src/domain/transactions.mjs:47:7
       404
     );
   }
-  if (txn.status === "reversed") {
+  if (false) {
     throw new DomainError(
       "Transaction already reversed",
killedBy: Transaction Domain assertCanReverse should throw if transaction is already reversed
statusReason: expected [Function] to throw error including 'Transaction already reversed' but got 'Only completed transactions can be re…'

[Killed] StringLiteral
src/domain/transactions.mjs:49:7
   }
   if (txn.status === "reversed") {
     throw new DomainError(
-      "Transaction already reversed",
+      "",
       "ALREADY_REVERSED",
       409
killedBy: Transaction Domain assertCanReverse should throw if transaction is already reversed
statusReason: expected [Function] to throw error including 'Transaction already reversed' but got ''

[Killed] EqualityOperator
src/domain/transactions.mjs:54:7
       409
     );
   }
-  if (txn.status !== "completed") {
+  if (txn.status === "completed") {
     throw new DomainError(
       "Only completed transactions can be reversed",
killedBy: Transaction Domain assertCanReverse should throw if transaction is pending (not completed)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/domain/transactions.mjs:54:7
       409
     );
   }
-  if (txn.status !== "completed") {
+  if (false) {
     throw new DomainError(
       "Only completed transactions can be reversed",
killedBy: Transaction Domain assertCanReverse should throw if transaction is pending (not completed)
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/transactions.mjs:56:7
   }
   if (txn.status !== "completed") {
     throw new DomainError(
-      "Only completed transactions can be reversed",
+      "",
       "INVALID_STATUS",
       422
killedBy: Transaction Domain assertCanReverse should throw if transaction is pending (not completed)
statusReason: expected [Function] to throw error including 'Only completed transactions can be re…' but got ''

[Survived] StringLiteral
src/domain/transactions.mjs:57:7
   if (txn.status !== "completed") {
     throw new DomainError(
       "Only completed transactions can be reversed",
-      "INVALID_STATUS",
+      "",
       422
     );
