[Killed] BlockStatement
src/domain/wallet.mjs:19:44
  * @param {Object} wallet - Wallet with account
  * @throws {DomainError} If wallet is null or account is frozen
  */
-export function assertWalletActive(wallet) {
-  if (!wallet) {
-    throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
-  }
-  if (wallet.account?.status === "FROZEN") {
-    throw new DomainError("Account is frozen", "ACCOUNT_FROZEN", 403);
-  }
-}
+export function assertWalletActive(wallet) {}
 
 /**
killedBy: Wallet Service deposit should throw if account is frozen
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/domain/wallet.mjs:20:7
  * @throws {DomainError} If wallet is null or account is frozen
  */
 export function assertWalletActive(wallet) {
-  if (!wallet) {
+  if (true) {
     throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
   }
killedBy: Transaction Service authorize should create authorize transaction (pending)
statusReason: Wallet not found

[Killed] BooleanLiteral
src/domain/wallet.mjs:20:7
  * @throws {DomainError} If wallet is null or account is frozen
  */
 export function assertWalletActive(wallet) {
-  if (!wallet) {
+  if (wallet) {
     throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
   }
killedBy: Wallet Service deposit should process deposit successfully
statusReason: Wallet not found

[Survived] StringLiteral
src/domain/wallet.mjs:21:47
  */
 export function assertWalletActive(wallet) {
   if (!wallet) {
-    throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
+    throw new DomainError("Wallet not found", "", 404);
   }
   if (wallet.account?.status === "FROZEN") {

[Killed] ConditionalExpression
src/domain/wallet.mjs:23:7
   if (!wallet) {
     throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
   }
-  if (wallet.account?.status === "FROZEN") {
+  if (true) {
     throw new DomainError("Account is frozen", "ACCOUNT_FROZEN", 403);
   }
killedBy: Transaction Service authorize should create authorize transaction (pending)
statusReason: Account is frozen

[Killed] BlockStatement
src/domain/wallet.mjs:23:44
   if (!wallet) {
     throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
   }
-  if (wallet.account?.status === "FROZEN") {
-    throw new DomainError("Account is frozen", "ACCOUNT_FROZEN", 403);
-  }
+  if (wallet.account?.status === "FROZEN") {}
 }
 
killedBy: Wallet Service deposit should throw if account is frozen
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] StringLiteral
src/domain/wallet.mjs:24:27
     throw new DomainError("Wallet not found", "WALLET_NOT_FOUND", 404);
   }
   if (wallet.account?.status === "FROZEN") {
-    throw new DomainError("Account is frozen", "ACCOUNT_FROZEN", 403);
+    throw new DomainError("", "ACCOUNT_FROZEN", 403);
   }
 }
killedBy: Wallet Service deposit should throw if account is frozen
statusReason: expected [Function] to throw error including 'Account is frozen' but got ''

[Killed] BlockStatement
src/domain/wallet.mjs:34:42
  * @param {number} amount - Amount to debit
  * @throws {DomainError} If amount is invalid or insufficient funds
  */
-export function canDebit(wallet, amount) {
-  const currency = wallet.currency || "USD";
-  const amountMoney = money(amount, currency);
-  const balanceMoney = money(wallet.balance, currency);
-
-  if (amountMoney.isNegative() || amountMoney.isZero()) {
-    throw new DomainError(
-      "Amount must be positive",
-      "INVALID_AMOUNT",
-      400
-    );
-  }
-  if (balanceMoney.lessThan(amountMoney)) {
-    throw new DomainError(
-      "Insufficient funds",
-      "INSUFFICIENT_FUNDS",
-      422
-    );
-  }
-}
+export function canDebit(wallet, amount) {}
 
 /**
killedBy: Wallet Service withdraw should fail if insufficient funds
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] LogicalOperator
src/domain/wallet.mjs:35:20
  * @throws {DomainError} If amount is invalid or insufficient funds
  */
 export function canDebit(wallet, amount) {
-  const currency = wallet.currency || "USD";
+  const currency = wallet.currency && "USD";
   const amountMoney = money(amount, currency);
   const balanceMoney = money(wallet.balance, currency);
killedBy: Transaction Service debit should use default USD currency if missing
statusReason: Cannot read properties of null (reading 'code')

[Survived] ConditionalExpression
src/domain/wallet.mjs:35:20
  * @throws {DomainError} If amount is invalid or insufficient funds
  */
 export function canDebit(wallet, amount) {
-  const currency = wallet.currency || "USD";
+  const currency = false;
   const amountMoney = money(amount, currency);
   const balanceMoney = money(wallet.balance, currency);

[Killed] ConditionalExpression
src/domain/wallet.mjs:39:7
   const amountMoney = money(amount, currency);
   const balanceMoney = money(wallet.balance, currency);
 
-  if (amountMoney.isNegative() || amountMoney.isZero()) {
+  if (true) {
     throw new DomainError(
       "Amount must be positive",
killedBy: Wallet Service withdraw should process withdraw successfully
statusReason: Amount must be positive

[Killed] LogicalOperator
src/domain/wallet.mjs:39:7
   const amountMoney = money(amount, currency);
   const balanceMoney = money(wallet.balance, currency);
 
-  if (amountMoney.isNegative() || amountMoney.isZero()) {
+  if (amountMoney.isNegative() && amountMoney.isZero()) {
     throw new DomainError(
       "Amount must be positive",
killedBy: Wallet Domain canDebit should throw error for zero amount
statusReason: expected [Function] to throw an error

[Survived] StringLiteral
src/domain/wallet.mjs:42:7
   if (amountMoney.isNegative() || amountMoney.isZero()) {
     throw new DomainError(
       "Amount must be positive",
-      "INVALID_AMOUNT",
+      "",
       400
     );

[Killed] ConditionalExpression
src/domain/wallet.mjs:46:7
       400
     );
   }
-  if (balanceMoney.lessThan(amountMoney)) {
+  if (true) {
     throw new DomainError(
       "Insufficient funds",
killedBy: Wallet Domain canDebit should not throw for valid debit
statusReason: expected [Function] to not throw an error but 'Error: Insufficient funds' was thrown

[Killed] ConditionalExpression
src/domain/wallet.mjs:46:7
       400
     );
   }
-  if (balanceMoney.lessThan(amountMoney)) {
+  if (false) {
     throw new DomainError(
       "Insufficient funds",
killedBy: Transaction Service authorize should fail if insufficient funds
statusReason: promise resolved "{ transaction: { id: 'tx-1' }, …(1) }" instead of rejecting

[Killed] BlockStatement
src/domain/wallet.mjs:61:57
  * @param {string} currencyCode - Currency code
  * @throws {DomainError} If amount is invalid
  */
-export function canCredit(amount, currencyCode = "USD") {
-  const amountMoney = money(amount, currencyCode);
-
-  if (amountMoney.isNegative() || amountMoney.isZero()) {
-    throw new DomainError(
-      "Amount must be positive",
-      "INVALID_AMOUNT",
-      400
-    );
-  }
-}
+export function canCredit(amount, currencyCode = "USD") {}
 
 export { DomainError };
killedBy: Wallet Domain canCredit should throw error for zero amount
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/domain/wallet.mjs:61:50
  * @param {string} currencyCode - Currency code
  * @throws {DomainError} If amount is invalid
  */
-export function canCredit(amount, currencyCode = "USD") {
+export function canCredit(amount, currencyCode = "") {
   const amountMoney = money(amount, currencyCode);
 
killedBy: Wallet Domain canCredit should throw error for zero amount
statusReason: expected [Function] to throw error including 'Amount must be positive' but got 'Currency \'\' not found in registry.'

[Killed] ConditionalExpression
src/domain/wallet.mjs:64:7
 export function canCredit(amount, currencyCode = "USD") {
   const amountMoney = money(amount, currencyCode);
 
-  if (amountMoney.isNegative() || amountMoney.isZero()) {
+  if (false) {
     throw new DomainError(
       "Amount must be positive",
killedBy: Wallet Domain canCredit should throw error for zero amount
statusReason: expected [Function] to throw an error
