[Killed] BlockStatement
src/infra/repositories/account.repo.mjs:8:36
  * @param {string} id - Account ID
  * @returns {Promise<Object|null>} Account with user
  */
-export async function findById(id) {
-  return prisma.account.findUnique({
-    where: { id },
-    include: {
-      user: true,
-      wallets: true,
-    },
-  });
-}
+export async function findById(id) {}
 
 /**
killedBy: Account Repository findById should find unique
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Number of calls: 0

[Killed] BooleanLiteral
src/infra/repositories/account.repo.mjs:12:13
   return prisma.account.findUnique({
     where: { id },
     include: {
-      user: true,
+      user: false,
       wallets: true,
     },
killedBy: Account Repository findById should find unique
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BooleanLiteral
src/infra/repositories/account.repo.mjs:13:16
     where: { id },
     include: {
       user: true,
-      wallets: true,
+      wallets: false,
     },
   });
killedBy: Account Repository findById should find unique
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] BlockStatement
src/infra/repositories/account.repo.mjs:23:44
  * @param {string} userId - User ID
  * @returns {Promise<Object|null>} Account
  */
-export async function findByUserId(userId) {
-  return prisma.account.findUnique({
-    where: { userId },
-    include: {
-      wallets: true,
-    },
-  });
-}
+export async function findByUserId(userId) {}
 
 /**
killedBy: Account Repository findByUserId should find by user id
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { userId: 'u-1' }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/account.repo.mjs:26:14
 export async function findByUserId(userId) {
   return prisma.account.findUnique({
     where: { userId },
-    include: {
-      wallets: true,
-    },
+    include: {},
   });
 }
killedBy: Account Repository findByUserId should find by user id
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { userId: 'u-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BooleanLiteral
src/infra/repositories/account.repo.mjs:27:16
   return prisma.account.findUnique({
     where: { userId },
     include: {
-      wallets: true,
+      wallets: false,
     },
   });
killedBy: Account Repository findByUserId should find by user id
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { userId: 'u-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/account.repo.mjs:38:48
  * @param {string} status - New status ('ACTIVE' or 'FROZEN')
  * @returns {Promise<Object>} Updated account
  */
-export async function updateStatus(id, status) {
-  return prisma.account.update({
-    where: { id },
-    data: { status },
-  });
-}
+export async function updateStatus(id, status) {}
 
 /**
killedBy: Account Repository updateStatus should update status
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/account.repo.mjs:50:34
  * @param {string} id - Account ID
  * @returns {Promise<Object>} Updated account
  */
-export async function freeze(id) {
-  return updateStatus(id, "FROZEN");
-}
+export async function freeze(id) {}
 
 /**
killedBy: Account Repository freeze should call updateStatus with FROZEN
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/account.repo.mjs:59:36
  * @param {string} id - Account ID
  * @returns {Promise<Object>} Updated account
  */
-export async function unfreeze(id) {
-  return updateStatus(id, "ACTIVE");
-}
+export async function unfreeze(id) {}
 
killedBy: Account Repository unfreeze should call updateStatus with ACTIVE
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Number of calls: 0

[Killed] StringLiteral
src/infra/repositories/account.repo.mjs:60:27
  * @returns {Promise<Object>} Updated account
  */
 export async function unfreeze(id) {
-  return updateStatus(id, "ACTIVE");
+  return updateStatus(id, "");
 }
 
killedBy: Account Repository unfreeze should call updateStatus with ACTIVE
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [
