[Killed] BlockStatement
src/infra/repositories/ledger.repo.mjs:7:51
  * @param {Object} data - Ledger entry data
  * @returns {Promise<Object>} Created ledger entry
  */
-export async function createLedgerEntry(tx, data) {
-  return tx.ledgerEntry.create({ data });
-}
+export async function createLedgerEntry(tx, data) {}
 
 /**
killedBy: Ledger Repository createLedgerEntry should create entry
statusReason: expected "vi.fn()" to be called with arguments: [ { data: { id: '1' } } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/ledger.repo.mjs:17:62
  * @param {string} transactionId - Transaction ID
  * @returns {Promise<Array>} List of ledger entries
  */
-export async function findByTransactionId(tx, transactionId) {
-  return tx.ledgerEntry.findMany({
-    where: { transactionId },
-    orderBy: { createdAt: "asc" },
-  });
-}
+export async function findByTransactionId(tx, transactionId) {}
 
killedBy: Ledger Repository findByTransactionId should find entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/ledger.repo.mjs:18:34
  * @returns {Promise<Array>} List of ledger entries
  */
 export async function findByTransactionId(tx, transactionId) {
-  return tx.ledgerEntry.findMany({
-    where: { transactionId },
-    orderBy: { createdAt: "asc" },
-  });
+  return tx.ledgerEntry.findMany({});
 }
 
killedBy: Ledger Repository findByTransactionId should find entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] StringLiteral
src/infra/repositories/ledger.repo.mjs:20:27
 export async function findByTransactionId(tx, transactionId) {
   return tx.ledgerEntry.findMany({
     where: { transactionId },
-    orderBy: { createdAt: "asc" },
+    orderBy: { createdAt: "" },
   });
 }
killedBy: Ledger Repository findByTransactionId should find entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] ObjectLiteral
src/infra/repositories/ledger.repo.mjs:20:14
 export async function findByTransactionId(tx, transactionId) {
   return tx.ledgerEntry.findMany({
     where: { transactionId },
-    orderBy: { createdAt: "asc" },
+    orderBy: {},
   });
 }
killedBy: Ledger Repository findByTransactionId should find entries
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {
