[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:8:52
  * @param {string} referenceId - Unique reference ID
  * @returns {Promise<Object|null>} Transaction
  */
-export async function findByReference(referenceId) {
-  return prisma.transaction.findUnique({ where: { referenceId } });
-}
+export async function findByReference(referenceId) {}
 
 /**
killedBy: Transaction Repository findByReference should call findUnique with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { referenceId: 'ref-1' } } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:18:58
  * @param {string} referenceId - Unique reference ID
  * @returns {Promise<Object|null>} Transaction
  */
-export async function findByReferenceTx(tx, referenceId) {
-  return tx.transaction.findUnique({ where: { referenceId } });
-}
+export async function findByReferenceTx(tx, referenceId) {}
 
 /**
killedBy: Transaction Repository findByReferenceTx should call findUnique on tx client
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { referenceId: 'ref-1' } } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:27:36
  * @param {string} id - Transaction ID
  * @returns {Promise<Object|null>} Transaction with wallet
  */
-export async function findById(id) {
-  return prisma.transaction.findUnique({
-    where: { id },
-    include: { wallet: true },
-  });
-}
+export async function findById(id) {}
 
 /**
killedBy: Transaction Repository findById should call findUnique with include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/transactions.repo.mjs:28:40
  * @returns {Promise<Object|null>} Transaction with wallet
  */
 export async function findById(id) {
-  return prisma.transaction.findUnique({
-    where: { id },
-    include: { wallet: true },
-  });
+  return prisma.transaction.findUnique({});
 }
 
killedBy: Transaction Repository findById should call findUnique with include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
src/infra/repositories/transactions.repo.mjs:29:12
  */
 export async function findById(id) {
   return prisma.transaction.findUnique({
-    where: { id },
+    where: {},
     include: { wallet: true },
   });
killedBy: Transaction Repository findById should call findUnique with include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BooleanLiteral
src/infra/repositories/transactions.repo.mjs:30:24
 export async function findById(id) {
   return prisma.transaction.findUnique({
     where: { id },
-    include: { wallet: true },
+    include: { wallet: false },
   });
 }
killedBy: Transaction Repository findById should call findUnique with include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:40:42
  * @param {string} id - Transaction ID
  * @returns {Promise<Object|null>} Transaction with wallet
  */
-export async function findByIdTx(tx, id) {
-  return tx.transaction.findUnique({
-    where: { id },
-    include: { wallet: true },
-  });
-}
+export async function findByIdTx(tx, id) {}
 
 /**
killedBy: Transaction Repository findByIdTx should call findUnique on tx with include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/transactions.repo.mjs:42:12
  */
 export async function findByIdTx(tx, id) {
   return tx.transaction.findUnique({
-    where: { id },
+    where: {},
     include: { wallet: true },
   });
killedBy: Transaction Repository findByIdTx should call findUnique on tx with include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:53:51
  * @param {Object} data - Transaction data
  * @returns {Promise<Object>} Created transaction
  */
-export async function createTransaction(tx, data) {
-  return tx.transaction.create({ data });
-}
+export async function createTransaction(tx, data) {}
 
 /**
killedBy: Transaction Repository createTransaction should call create
statusReason: expected "vi.fn()" to be called with arguments: [ { data: { id: 'tx-1', …(1) } } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:64:63
  * @param {string} status - New status
  * @returns {Promise<Object>} Updated transaction
  */
-export async function updateTransactionStatus(tx, id, status) {
-  return tx.transaction.update({
-    where: { id },
-    data: { status },
-  });
-}
+export async function updateTransactionStatus(tx, id, status) {}
 
 /**
killedBy: Transaction Repository updateTransactionStatus should call update
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'tx-1' }, …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:77:62
  * @param {Object} options - Query options
  * @returns {Promise<Array>} List of transactions
  */
-export async function findByWalletId(walletId, options = {}) {
-  const { page = 1, limit = 20, type, status } = options;
-
-  const where = { walletId };
-  if (type) where.type = type;
-  if (status) where.status = status;
-
-  return prisma.transaction.findMany({
-    where,
-    orderBy: { createdAt: "desc" },
-    skip: (page - 1) * limit,
-    take: limit,
-    include: {
-      ledger: true,
-    },
-  });
-}
+export async function findByWalletId(walletId, options = {}) {}
 
 /**
killedBy: Transaction Repository findByWalletId should query with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infra/repositories/transactions.repo.mjs:81:7
   const { page = 1, limit = 20, type, status } = options;
 
   const where = { walletId };
-  if (type) where.type = type;
+  if (false) where.type = type;
   if (status) where.status = status;
 
killedBy: Transaction Repository findByWalletId should query with filters and pagination
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { …(3) }, …(4) } ]

Received: 

  1st vi.fn() call:

@@ -8,10 +8,9 @@
      },

[Survived] ConditionalExpression
src/infra/repositories/transactions.repo.mjs:81:7
   const { page = 1, limit = 20, type, status } = options;
 
   const where = { walletId };
-  if (type) where.type = type;
+  if (true) where.type = type;
   if (status) where.status = status;
 

[Killed] ObjectLiteral
src/infra/repositories/transactions.repo.mjs:89:14
     orderBy: { createdAt: "desc" },
     skip: (page - 1) * limit,
     take: limit,
-    include: {
-      ledger: true,
-    },
+    include: {},
   });
 }
killedBy: Transaction Repository findByWalletId should query with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

@@ -1,10 +1,8 @@
  [

[Killed] BooleanLiteral
src/infra/repositories/transactions.repo.mjs:90:15
     skip: (page - 1) * limit,
     take: limit,
     include: {
-      ledger: true,
+      ledger: false,
     },
   });
killedBy: Transaction Repository findByWalletId should query with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/transactions.repo.mjs:101:63
  * @param {Object} options - Filter options
  * @returns {Promise<number>} Count
  */
-export async function countByWalletId(walletId, options = {}) {
-  const { type, status } = options;
-
-  const where = { walletId };
-  if (type) where.type = type;
-  if (status) where.status = status;
-
-  return prisma.transaction.count({ where });
-}
+export async function countByWalletId(walletId, options = {}) {}
 
killedBy: Transaction Repository countByWalletId should count with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { walletId: 'w-1' } } ]

Number of calls: 0
