[Killed] BlockStatement
src/infra/repositories/user.repo.mjs:8:36
  * @param {string} id - User ID
  * @returns {Promise<Object|null>} User with account
  */
-export async function findById(id) {
-  return prisma.user.findUnique({
-    where: { id },
-    include: {
-      account: {
-        include: {
-          wallets: true,
-        },
-      },
-    },
-  });
-}
+export async function findById(id) {}
 
 /**
killedBy: User Repository findById should call findUnique with correct include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'u-1' }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/user.repo.mjs:9:33
  * @returns {Promise<Object|null>} User with account
  */
 export async function findById(id) {
-  return prisma.user.findUnique({
-    where: { id },
-    include: {
-      account: {
-        include: {
-          wallets: true,
-        },
-      },
-    },
-  });
+  return prisma.user.findUnique({});
 }
 
killedBy: User Repository findById should call findUnique with correct include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'u-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
src/infra/repositories/user.repo.mjs:10:12
  */
 export async function findById(id) {
   return prisma.user.findUnique({
-    where: { id },
+    where: {},
     include: {
       account: {
killedBy: User Repository findById should call findUnique with correct include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'u-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -5,10 +5,8 @@
          "include": {

[Killed] ObjectLiteral
src/infra/repositories/user.repo.mjs:12:16
   return prisma.user.findUnique({
     where: { id },
     include: {
-      account: {
-        include: {
-          wallets: true,
-        },
-      },
+      account: {},
     },
   });
killedBy: User Repository findById should call findUnique with correct include
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: 'u-1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,13 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/user.repo.mjs:26:42
  * @param {string} email - User email
  * @returns {Promise<Object|null>} User with account
  */
-export async function findByEmail(email) {
-  return prisma.user.findUnique({
-    where: { email },
-    include: {
-      account: true,
-    },
-  });
-}
+export async function findByEmail(email) {}
 
 /**
killedBy: User Repository findByEmail should call findUnique w email
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/user.repo.mjs:29:14
 export async function findByEmail(email) {
   return prisma.user.findUnique({
     where: { email },
-    include: {
-      account: true,
-    },
+    include: {},
   });
 }
killedBy: User Repository findByEmail should call findUnique w email
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
src/infra/repositories/user.repo.mjs:46:39
  * @returns {Promise<Object>} Created user with account and wallet
  */
 export async function createUserWithAccountAndWallet(tx, data) {
-  const { email, passwordHash, role = "CUSTOMER", currency = "USD" } = data;
+  const { email, passwordHash, role = "", currency = "USD" } = data;
 
   return tx.user.create({
killedBy: User Repository createUserWithAccountAndWallet should create shallow nested structure
statusReason: expected "vi.fn()" to be called with arguments: [ { data: { …(4) }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -12,11 +12,11 @@
            },

[Killed] ObjectLiteral
src/infra/repositories/user.repo.mjs:57:21
         create: {
           status: "ACTIVE",
           wallets: {
-            create: {
-              balance: 0,
-              currency,
-            },
+            create: {},
           },
         },
killedBy: User Repository createUserWithAccountAndWallet should create shallow nested structure
statusReason: expected "vi.fn()" to be called with arguments: [ { data: { …(4) }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -3,14 +3,11 @@
      "data": {

[Killed] ConditionalExpression
src/infra/repositories/user.repo.mjs:84:7
   const { page = 1, limit = 20, role, search } = options;
 
   const where = {};
-  if (role) where.role = role;
+  if (false) where.role = role;
   if (search) where.email = { contains: search };
 
killedBy: User Repository findMany should query with filters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(5) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Survived] ConditionalExpression
src/infra/repositories/user.repo.mjs:84:7
   const { page = 1, limit = 20, role, search } = options;
 
   const where = {};
-  if (role) where.role = role;
+  if (true) where.role = role;
   if (search) where.email = { contains: search };
 

[Killed] ConditionalExpression
src/infra/repositories/user.repo.mjs:85:7
 
   const where = {};
   if (role) where.role = role;
-  if (search) where.email = { contains: search };
+  if (true) where.email = { contains: search };
 
   return prisma.user.findMany({
killedBy: User Repository findMany should query with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ { where: {}, …(4) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/infra/repositories/user.repo.mjs:85:7
 
   const where = {};
   if (role) where.role = role;
-  if (search) where.email = { contains: search };
+  if (false) where.email = { contains: search };
 
   return prisma.user.findMany({
killedBy: User Repository findMany should query with filters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(5) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Survived] ObjectLiteral
src/infra/repositories/user.repo.mjs:92:13
     orderBy: { createdAt: "desc" },
     skip: (page - 1) * limit,
     take: limit,
-    select: {
-      id: true,
-      email: true,
-      role: true,
-      createdAt: true,
-      updatedAt: true,
-      account: {
-        select: {
-          id: true,
-          status: true,
-          createdAt: true,
-          _count: {
-            select: { wallets: true },
-          },
-        },
-      },
-    },
+    select: {},
   });
 }

[Survived] BooleanLiteral
src/infra/repositories/user.repo.mjs:96:18
       id: true,
       email: true,
       role: true,
-      createdAt: true,
+      createdAt: false,
       updatedAt: true,
       account: {

[Survived] ObjectLiteral
src/infra/repositories/user.repo.mjs:98:16
       role: true,
       createdAt: true,
       updatedAt: true,
-      account: {
-        select: {
-          id: true,
-          status: true,
-          createdAt: true,
-          _count: {
-            select: { wallets: true },
-          },
-        },
-      },
+      account: {},
     },
   });

[Survived] BooleanLiteral
src/infra/repositories/user.repo.mjs:102:22
         select: {
           id: true,
           status: true,
-          createdAt: true,
+          createdAt: false,
           _count: {
             select: { wallets: true },

[Survived] BooleanLiteral
src/infra/repositories/user.repo.mjs:104:32
           status: true,
           createdAt: true,
           _count: {
-            select: { wallets: true },
+            select: { wallets: false },
           },
         },

[Killed] BlockStatement
src/infra/repositories/user.repo.mjs:117:43
  * @param {Object} options - Filter options
  * @returns {Promise<number>} Count
  */
-export async function count(options = {}) {
-  const { role, search } = options;
-
-  const where = {};
-  if (role) where.role = role;
-  if (search) where.email = { contains: search };
-
-  return prisma.user.count({ where });
-}
+export async function count(options = {}) {}
 
killedBy: User Repository count should count with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ { where: {} } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/user.repo.mjs:124:28
   if (role) where.role = role;
   if (search) where.email = { contains: search };
 
-  return prisma.user.count({ where });
+  return prisma.user.count({});
 }
 
killedBy: User Repository count should count with defaults
statusReason: expected "vi.fn()" to be called with arguments: [ { where: {} } ]

Received: 

  1st vi.fn() call:

  [
-   {
