[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:8:42
  * @param {string} id - Wallet ID
  * @returns {Promise<Object|null>} Wallet with account
  */
-export async function findWalletById(id) {
-  return prisma.wallet.findUnique({
-    where: { id },
-    include: { account: true },
-  });
-}
+export async function findWalletById(id) {}
 
 /**
killedBy: Wallet Repository findWalletById should call findUnique with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/wallet.repo.mjs:9:35
  * @returns {Promise<Object|null>} Wallet with account
  */
 export async function findWalletById(id) {
-  return prisma.wallet.findUnique({
-    where: { id },
-    include: { account: true },
-  });
+  return prisma.wallet.findUnique({});
 }
 
killedBy: Wallet Repository findWalletById should call findUnique with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] BooleanLiteral
src/infra/repositories/wallet.repo.mjs:11:25
 export async function findWalletById(id) {
   return prisma.wallet.findUnique({
     where: { id },
-    include: { account: true },
+    include: { account: false },
   });
 }
killedBy: Wallet Repository findWalletById should call findUnique with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:21:63
  * @param {string} accountId - Account ID for ownership check
  * @returns {Promise<Object|null>} Wallet with account
  */
-export async function findWalletByIdAndAccount(id, accountId) {
-  return prisma.wallet.findFirst({
-    where: { id, accountId },
-    include: { account: true },
-  });
-}
+export async function findWalletByIdAndAccount(id, accountId) {}
 
 /**
killedBy: Wallet Repository findWalletByIdAndAccount should call findFirst with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1', …(1) }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/wallet.repo.mjs:22:34
  * @returns {Promise<Object|null>} Wallet with account
  */
 export async function findWalletByIdAndAccount(id, accountId) {
-  return prisma.wallet.findFirst({
-    where: { id, accountId },
-    include: { account: true },
-  });
+  return prisma.wallet.findFirst({});
 }
 
killedBy: Wallet Repository findWalletByIdAndAccount should call findFirst with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1', …(1) }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] BooleanLiteral
src/infra/repositories/wallet.repo.mjs:24:25
 export async function findWalletByIdAndAccount(id, accountId) {
   return prisma.wallet.findFirst({
     where: { id, accountId },
-    include: { account: true },
+    include: { account: false },
   });
 }
killedBy: Wallet Repository findWalletByIdAndAccount should call findFirst with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1', …(1) }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:35:69
  * @param {string} accountId - Account ID for ownership check
  * @returns {Promise<Object|null>} Wallet with account
  */
-export async function findWalletByIdAndAccountTx(tx, id, accountId) {
-  return tx.wallet.findFirst({
-    where: { id, accountId },
-    include: { account: true },
-  });
-}
+export async function findWalletByIdAndAccountTx(tx, id, accountId) {}
 
 /**
killedBy: Wallet Repository findWalletByIdAndAccountTx should use transaction client
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1', …(1) }, …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:47:57
  * @param {string} accountId - Account ID
  * @returns {Promise<Array>} List of wallets
  */
-export async function findWalletsByAccountId(accountId) {
-  return prisma.wallet.findMany({
-    where: { accountId },
-    orderBy: { createdAt: "desc" },
-  });
-}
+export async function findWalletsByAccountId(accountId) {}
 
 /**
killedBy: Wallet Repository findWalletsByAccountId should call findMany with correct args
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:61:67
  * @param {number} newBalance - New balance to set
  * @returns {Promise<Object>} Updated wallet
  */
-export async function updateWalletBalance(tx, wallet, newBalance) {
-  return tx.wallet.update({
-    where: { id: wallet.id, version: wallet.version },
-    data: {
-      balance: newBalance,
-      version: { increment: 1 },
-    },
-  });
-}
+export async function updateWalletBalance(tx, wallet, newBalance) {}
 
 /**
killedBy: Wallet Repository updateWalletBalance should update with version check
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/wallet.repo.mjs:64:11
 export async function updateWalletBalance(tx, wallet, newBalance) {
   return tx.wallet.update({
     where: { id: wallet.id, version: wallet.version },
-    data: {
-      balance: newBalance,
-      version: { increment: 1 },
-    },
+    data: {},
   });
 }
killedBy: Wallet Repository updateWalletBalance should update with version check
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,13 +1,8 @@
  [

[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:79:74
  * @param {number} amount - Amount to add
  * @returns {Promise<Object>} Updated wallet
  */
-export async function creditWallet(tx, walletId, currentBalance, amount) {
-  return tx.wallet.update({
-    where: { id: walletId },
-    data: { balance: currentBalance + amount },
-  });
-}
+export async function creditWallet(tx, walletId, currentBalance, amount) {}
 
 /**
killedBy: Wallet Repository creditWallet should update balance directly
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
src/infra/repositories/wallet.repo.mjs:80:27
  * @returns {Promise<Object>} Updated wallet
  */
 export async function creditWallet(tx, walletId, currentBalance, amount) {
-  return tx.wallet.update({
-    where: { id: walletId },
-    data: { balance: currentBalance + amount },
-  });
+  return tx.wallet.update({});
 }
 
killedBy: Wallet Repository creditWallet should update balance directly
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   {

[Killed] ArithmeticOperator
src/infra/repositories/wallet.repo.mjs:82:22
 export async function creditWallet(tx, walletId, currentBalance, amount) {
   return tx.wallet.update({
     where: { id: walletId },
-    data: { balance: currentBalance + amount },
+    data: { balance: currentBalance - amount },
   });
 }
killedBy: Wallet Repository creditWallet should update balance directly
statusReason: expected "vi.fn()" to be called with arguments: [ { where: { id: '1' }, …(1) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] BlockStatement
src/infra/repositories/wallet.repo.mjs:93:55
  * @param {number} amount - Amount to deduct
  * @returns {Promise<Object>} Updated wallet
  */
-export async function debitWallet(tx, wallet, amount) {
-  return tx.wallet.update({
-    where: { id: wallet.id, version: wallet.version },
-    data: {
-      balance: wallet.balance - amount,
-      version: { increment: 1 },
-    },
-  });
-}
+export async function debitWallet(tx, wallet, amount) {}
 
 
killedBy: Wallet Repository debitWallet should debit with version check
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0

[Killed] ArithmeticOperator
src/infra/repositories/wallet.repo.mjs:97:16
   return tx.wallet.update({
     where: { id: wallet.id, version: wallet.version },
     data: {
-      balance: wallet.balance - amount,
+      balance: wallet.balance + amount,
       version: { increment: 1 },
     },
killedBy: Wallet Repository debitWallet should debit with version check
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] ObjectLiteral
src/infra/repositories/wallet.repo.mjs:98:16
     where: { id: wallet.id, version: wallet.version },
     data: {
       balance: wallet.balance - amount,
-      version: { increment: 1 },
+      version: {},
     },
   });
killedBy: Wallet Repository debitWallet should debit with version check
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Received: 

  1st vi.fn() call:

@@ -1,12 +1,10 @@
  [
