[Killed] StringLiteral
src/routes/wallet.routes.mjs:20:12
 // Read endpoints
 router.get("/:id", getWallet);
 router.get("/:id/balance", getBalance);
-router.get("/:id/transactions", getTransactions);
+router.get("", getTransactions);
 
 // Write endpoints with idempotency
killedBy: Wallet Routes should configure wallet routes
statusReason: expected "vi.fn()" to be called with arguments: [ '/:id/transactions', Any<Function> ]

Received: 

  1st vi.fn() call:

  [
-   "/:id/transactions",

[Killed] StringLiteral
src/routes/wallet.routes.mjs:23:13
 router.get("/:id/transactions", getTransactions);
 
 // Write endpoints with idempotency
-router.post("/:id/deposit", idempotency, deposit);
+router.post("", idempotency, deposit);
 router.post("/:id/withdraw", idempotency, withdraw);
 
killedBy: Wallet Routes should configure wallet routes
statusReason: expected "vi.fn()" to be called with arguments: [ '/:id/deposit', Any<Function>, …(1) ]

Received: 

  1st vi.fn() call:

  [
-   "/:id/deposit",
