[Killed] BlockStatement
src/services/wallet.service.mjs:13:42
  * Custom error with status code
  */
 class ServiceError extends Error {
-  constructor(message, code, statusCode) {
-    super(message);
-    this.code = code;
-    this.statusCode = statusCode;
-  }
+  constructor(message, code, statusCode) {}
 }
 
killedBy: Wallet Service getWallet should throw 404 if not found
statusReason: expected [Function] to throw error including 'Wallet not found' but got 'Must call super constructor in derive…'

[Killed] BlockStatement
src/services/wallet.service.mjs:26:54
  * @param {string} accountId - Account ID for ownership check
  * @returns {Promise<Object>} Wallet data
  */
-export async function getWallet(walletId, accountId) {
-  const wallet = await walletRepo.findWalletByIdAndAccount(walletId, accountId);
-
-  if (!wallet) {
-    throw new ServiceError("Wallet not found", "WALLET_NOT_FOUND", 404);
-  }
-
-  return wallet;
-}
+export async function getWallet(walletId, accountId) {}
 
 /**
killedBy: Wallet Service getWallet should return wallet if found
statusReason: expected undefined to be { id: 'wallet-1', balance: 100 } // Object.is equality

[Killed] BlockStatement
src/services/wallet.service.mjs:29:16
 export async function getWallet(walletId, accountId) {
   const wallet = await walletRepo.findWalletByIdAndAccount(walletId, accountId);
 
-  if (!wallet) {
-    throw new ServiceError("Wallet not found", "WALLET_NOT_FOUND", 404);
-  }
+  if (!wallet) {}
 
   return wallet;
killedBy: Wallet Service getWallet should throw 404 if not found
statusReason: promise resolved "null" instead of rejecting

[Killed] BlockStatement
src/services/wallet.service.mjs:42:55
  * @param {string} accountId - Account ID for ownership check
  * @returns {Promise<Object>} Balance info
  */
-export async function getBalance(walletId, accountId) {
-  const wallet = await getWallet(walletId, accountId);
-
-  return {
-    walletId: wallet.id,
-    currency: wallet.currency,
-    balance: wallet.balance,
-    availableBalance: wallet.balance, // Future: subtract pending holds
-  };
-}
+export async function getBalance(walletId, accountId) {}
 
 /**
killedBy: Wallet Service getBalance should return formatted balance
statusReason: expected undefined to deeply equal { walletId: 'wallet-1', …(3) }

[Killed] StringLiteral
src/services/wallet.service.mjs:72:30
     );
 
     if (!wallet) {
-      throw new ServiceError("Wallet not found", "WALLET_NOT_FOUND", 404);
+      throw new ServiceError("", "WALLET_NOT_FOUND", 404);
     }
 
killedBy: Wallet Service deposit should throw if wallet not found
statusReason: expected [Function] to throw error including 'Wallet not found' but got ''

[Killed] ConditionalExpression
src/services/wallet.service.mjs:80:9
 
     // Check for duplicate reference
     const existingTx = await txRepo.findByReferenceTx(tx, referenceId);
-    if (existingTx) {
+    if (false) {
       throw new ServiceError(
         "Duplicate reference ID",
killedBy: Wallet Service deposit should throw if duplicate reference
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] BlockStatement
src/services/wallet.service.mjs:80:21
 
     // Check for duplicate reference
     const existingTx = await txRepo.findByReferenceTx(tx, referenceId);
-    if (existingTx) {
-      throw new ServiceError(
-        "Duplicate reference ID",
-        "DUPLICATE_REFERENCE",
-        409
-      );
-    }
+    if (existingTx) {}
 
     // Credit the wallet
killedBy: Wallet Service deposit should throw if duplicate reference
statusReason: promise resolved "{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/services/wallet.service.mjs:151:9
 
     // Check for duplicate reference
     const existingTx = await txRepo.findByReferenceTx(tx, referenceId);
-    if (existingTx) {
+    if (true) {
       throw new ServiceError(
         "Duplicate reference ID",
killedBy: Wallet Service withdraw should process withdraw successfully
statusReason: Duplicate reference ID

[Survived] StringLiteral
src/services/wallet.service.mjs:154:9
     if (existingTx) {
       throw new ServiceError(
         "Duplicate reference ID",
-        "DUPLICATE_REFERENCE",
+        "",
         409
       );

[Killed] ArrayDeclaration
src/services/wallet.service.mjs:215:51
 
   const { page = 1, limit = 20, type, status } = options;
 
-  const [total, transactions] = await Promise.all([
-    txRepo.countByWalletId(walletId, { type, status }),
-    txRepo.findByWalletId(walletId, { page, limit, type, status }),
-  ]);
+  const [total, transactions] = await Promise.all([]);
 
   const totalPages = Math.ceil(total / limit);
killedBy: Wallet Service getTransactions should return transactions with pagination
statusReason: expected { transactions: undefined, …(1) } to deeply equal { transactions: [ …(2) ], …(1) }

[Survived] ObjectLiteral
src/services/wallet.service.mjs:217:37
 
   const [total, transactions] = await Promise.all([
     txRepo.countByWalletId(walletId, { type, status }),
-    txRepo.findByWalletId(walletId, { page, limit, type, status }),
+    txRepo.findByWalletId(walletId, {}),
   ]);
 

[Killed] ObjectLiteral
src/services/wallet.service.mjs:222:10
 
   const totalPages = Math.ceil(total / limit);
 
-  return {
-    transactions,
-    pagination: {
-      page,
-      limit,
-      total,
-      totalPages,
-      hasNext: page < totalPages,
-      hasPrev: page > 1,
-    },
-  };
+  return {};
 }
 
killedBy: Wallet Service getTransactions should return transactions with pagination
statusReason: expected {} to deeply equal { transactions: [ …(2) ], …(1) }

[Killed] EqualityOperator
src/services/wallet.service.mjs:229:16
       limit,
       total,
       totalPages,
-      hasNext: page < totalPages,
+      hasNext: page >= totalPages,
       hasPrev: page > 1,
     },
killedBy: Wallet Service getTransactions should return transactions with pagination
statusReason: expected { transactions: [ …(2) ], …(1) } to deeply equal { transactions: [ …(2) ], …(1) }

[Killed] EqualityOperator
src/services/wallet.service.mjs:230:16
       total,
       totalPages,
       hasNext: page < totalPages,
-      hasPrev: page > 1,
+      hasPrev: page <= 1,
     },
   };
killedBy: Wallet Service getTransactions should return transactions with pagination
statusReason: expected { transactions: [ …(2) ], …(1) } to deeply equal { transactions: [ …(2) ], …(1) }
