[Killed] BlockStatement
src/utlis/canonicalJson.mjs:1:36
-export function canonicalJson(obj) {
-  if (!obj || typeof obj !== "object") return "";
-
-  const sorted = Object.keys(obj)
-    .sort()
-    .reduce((acc, key) => {
-      acc[key] = obj[key];
-      return acc;
-    }, {});
-
-  return JSON.stringify(sorted);
-}
+export function canonicalJson(obj) {}
 
killedBy: canonicalJson basic functionality should return empty string for null
statusReason: expected undefined to be '' // Object.is equality

[Killed] BooleanLiteral
src/utlis/canonicalJson.mjs:2:7
 export function canonicalJson(obj) {
-  if (!obj || typeof obj !== "object") return "";
+  if (obj || typeof obj !== "object") return "";
 
   const sorted = Object.keys(obj)
killedBy: canonicalJson basic functionality should return empty string for null
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/utlis/canonicalJson.mjs:2:7
 export function canonicalJson(obj) {
-  if (!obj || typeof obj !== "object") return "";
+  if (true) return "";
 
   const sorted = Object.keys(obj)
killedBy: canonicalJson basic functionality should return JSON string for empty object
statusReason: expected '' to be '{}' // Object.is equality

[Killed] MethodExpression
src/utlis/canonicalJson.mjs:4:18
 export function canonicalJson(obj) {
   if (!obj || typeof obj !== "object") return "";
 
-  const sorted = Object.keys(obj)
-    .sort()
+  const sorted = Object.keys(obj)
     .reduce((acc, key) => {
       acc[key] = obj[key];
killedBy: canonicalJson key sorting should sort keys alphabetically
statusReason: expected '{"c":3,"a":1,"b":2}' to be '{"a":1,"b":2,"c":3}' // Object.is equality

[Killed] BlockStatement
src/utlis/canonicalJson.mjs:6:27
 
   const sorted = Object.keys(obj)
     .sort()
-    .reduce((acc, key) => {
-      acc[key] = obj[key];
-      return acc;
-    }, {});
+    .reduce((acc, key) => {}, {});
 
   return JSON.stringify(sorted);
killedBy: canonicalJson key sorting should sort keys alphabetically
statusReason: expected undefined to be '{"a":1,"b":2,"c":3}' // Object.is equality
